[
  {
    "context_id": 1,
    "context_text": "有一個豆莢，裡面有五粒豌豆。它們都是綠的，因此它們就以為整個世界都是綠的。事實也正是這樣！豆莢在生長，豆粒也在生長。它們按照它們在家庭裡的地位，坐成一排。太陽在外邊照著，把豆莢曬得暖洋洋的；雨把它洗得透明。這兒是既溫暖，又舒適；白天有亮，晚間黑暗，這本是必然的規律。豌豆粒坐在那兒越長越大，同時也越變得沉思起來，因為它們多少得做點事情呀。「難道我們永遠就在這兒坐下去麼？」它們問。 「我只願老這樣坐下去，不要變得僵硬起來。我似乎覺得外面發生了一些事情——我有這種預感！」許多星期過去了。這幾粒豌豆變黃了，豆莢也變黃了。 「整個世界都在變黃啦！」它們說。它們也可以這樣說。忽然它們覺得豆莢震動了一下。它被摘下來了，落到人的手上，跟許多別的豐滿的豆莢在一起，溜到一件馬甲的口袋裡去。“我們不久就要被打開了！”它們說。于是它們就等待這件事情的到來。“我倒想要知道，我們之中誰會走得最遠！”最小的一粒豆說。 “是的，事情馬上就要揭曉了。”“該怎麼辦就怎麼辦！”最大的那一粒說。 “啪！”豆莢裂開來了。那五粒豆子全都滾到太陽光裡來了。它們躺在一個孩子的手中。這個孩子緊緊地捏著它們，說它們正好可以當作豆槍的子彈用。他馬上安一粒進去，把它射出來。 “現在我要飛向廣大的世界裡去了！如果你能捉住我，那麼就請你來吧！”於是它就飛走了。“我，”第二粒說，“我將直接飛進太陽裡去。這才像一個豆莢呢，而且與我的身份非常相稱！ ”於是它就飛走了。“我們到了什麼地方，就在什麼地方睡，”其餘的兩粒說。 “不過我們仍得向前滾。”因此它們在沒有到達豆槍以前，就先在地上滾起來。但是它們終於被裝進去了。 “我們才會射得最遠呢！”“該怎麼辦就怎麼辦！”最後的那一粒說。它射到空中去了。它射到頂樓窗子下面一塊舊板子上，正好鑽進一個長滿了青苔的黴菌的裂縫裡去。青苔把它裹起來。它躺在那兒不見了，可是我們的上帝並沒忘記它。 “應該怎麼辦就怎麼辦！”它說。在這個小小的頂樓裡住著一個窮苦的女人。她白天到外面去擦爐子，鋸木材，並且做許多類似的粗活，因為她很強壯，而且也很勤儉，不過她仍然是很窮。她有一個發育不全的獨生女兒，躺在這頂樓上的家裡。她的身體非常虛弱。她在床上躺了一整年；看樣子既活不下去，也死不了。“她快要到她親愛的姐姐那兒去了！”女人說。 “我只有兩個孩子，但是養活她們兩個人是夠困難的。善良的上帝分擔我的愁苦，已經接走一個了。我現在把留下的這一個養著。不過我想他不會讓她們分開的；她也會到她天上的姐姐那兒去的。”可是這個病孩子並沒有離開。她安靜地、耐心地整天在家裡躺著，她的母親到外面去掙點生活的費用。這正是春天。一大早，當母親正要出去工作的時候，太陽溫和地、愉快地從那個小窗子射進來，一直射到地上。這個病孩子望著最低的那塊窗玻璃。“從窗玻璃旁邊探出頭來的那個綠東西是什麼呢？它在風裡擺動！”母親走到窗子那兒去，把窗打開一半。 “啊”她說，“我的天，這原來是一粒小豌豆。它還長出小葉子來了。它怎樣鑽進這個隙縫裡去的？你現在可有一個小花園來供你欣賞了！”病孩子的床搬得更挨近窗子，好讓她看到這粒正在生長著的豌豆。於是母親便出去做她的工作了。“媽媽，我覺得我好了一些！”這個小姑娘在晚間說。 “太陽今天在我身上照得怪溫暖的。這粒豆子長得好極了，我也會長得好的；我將爬起床來，走到溫暖的太陽光中去。”“願上帝准我們這樣！”母親說，但是她不相信事情就會這樣。不過她仔細地用一根小棍子把這植物支起來，好使它不致被風吹斷，因為它使她的女兒對生命起了愉快的想像。她從窗台上牽了一根線到窗框的上端去，使這粒豆可以盤繞著它向上長，它的確在向上長——人們每天可以看到它在生長。“真的，它現在要開花了！”女人有一天早晨說。她現在開始希望和相信，她的病孩子會好起來。她記起最近這孩子講話時要比以前愉快得多，而且最近幾天她自己也能爬起來，直直地坐在床上，用高興的眼光望著這一顆豌豆所形成的小花園。一星期以後，這個病孩子第一次能夠坐一整個鍾頭。她快樂地坐在溫暖的太陽光裡。窗子打開了，它面前是一朵盛開的、粉紅色的豌豆花。小姑娘低下頭來，把它柔嫩的葉子輕輕地吻了一下。這一天簡直像一個節日。“我幸福的孩子，上帝親自種下這顆豌豆，叫它長得枝葉茂盛，成為你我的希望和快樂！”高興的母親說。她對這花兒微笑，好像它就是上帝送下來的一位善良的安琪兒。但是其餘的幾粒豌豆呢？嗯，那一粒曾經飛到廣大的世界上去，並且還說過“如果你能捉住我，那末就請你來吧！”它落到屋頂的水筧裡去了，在一個鴿子的嗉囊裡躺下來，正如約拿躺在鯨魚肚中一樣。那兩粒懶惰的豆子也不過只走了這麼遠，因為它們也被鴿子吃掉了。總之，它們總還算有些實際的用途。可是那第四粒，它本來想飛進太陽裡去，但是卻落到水溝裡去了，在髒水里躺了好幾個星期，而且漲大得相當可觀。“我胖得夠美了！”這粒豌豆說。 “我胖得要爆裂開來。我想，任何豆子從來不曾、也永遠不會達到這種地步的。我是豆莢裡五粒豆子中最了不起的一粒。”水溝說它講得很有道理。可是頂樓窗子旁那個年輕的女孩子，她臉上射出健康的光彩，她的眼睛發著亮光正在豌豆花上面交叉著一雙小手，感謝上帝。水溝說：“我支持我的那粒豆子。”",
    "qas": [
      {
        "query_id": "1_0",
        "query_text": "誰住在小小的頂樓裡？",
        "answers": ["窮苦的女人"]
      }
    ]
  },
  {
    "context_id": 2,
    "context_text": "一位農夫有兩隻水桶，他每天就用一根扁擔挑著兩隻水桶去河邊汲水。兩隻水桶中有一只有一道裂縫,因此每次到家時這只水桶總是會漏得只剩下半桶水，而另一只桶卻總是滿滿的。就這樣,兩年以來，日復一日，農夫天天只能從河裡擔回家一桶半水。完整無缺的桶很為自己的完美無缺得意非凡,而有裂縫的桶自然為自己的缺陷和不能勝任工作而羞愧。經過兩年的失敗之後,一天在河邊,有裂縫的桶終於鼓起勇氣向主人開了口﹕「我覺得很慚愧,因為我這邊有裂縫,一路上漏水,只能擔半桶水到家。」農夫回答它說﹕「你注意到了嗎?在你那一側的路沿上開滿了花,而另外的一側卻沒有花?我從一開始就知道你有漏,於是在你的那一側的路沿撒了花籽。我們每天擔水回家的路上,你就給它們澆水。兩年了,我經常從這路邊採摘鮮花來裝扮我的餐桌。如果不是因為你的所謂的缺陷,我怎麼會有美麗的鮮花裝扮我的家呢?」我們每個人都好比那只有裂縫的桶,各自都具有這樣或那樣的不足和缺點。倘若我們懷著一顆包容的心,懂得發現對方的長處,並且能夠揚長避短,我們的生活一定會變得更加輕鬆愉快和豐富多彩。",
    "qas": [
      {
        "query_id": "2_0",
        "query_text": "農夫一日只能擔多少水？",
        "answers": ["一桶半"]
      }
    ]
  },
  {
    "context_id": 3,
    "context_text": "貓與狗原本是一對好朋友，也各自擁有令對方稱羨的能力，於是相互向對方討教，但又互相提防對手學走自己的本領。由於狗有靈敏的鼻子，就教貓搜尋獵物的能力；貓有靈活的身子，就教狗撲擊獵物的技巧。兩方各有盤算，表面上卻相安無事。有一天，一同發現了一隻肥老鼠，雙方提議捉到後各分一半。於是狗就用貓所教的撲擊方法，順利逮到了老鼠。但力氣大的狗根本沒有與貓分享食物的念頭，用最快的速度跑離現場，這是貓沒學到的技巧。正當狗洋洋得意時，忽然覺得身上癢癢的，眼見四下無人，放下肥老鼠搔癢，此刻的貓卻用狗教的搜尋獵物方法緊跟在後，趁機搶走狗到手的食物。狗發現食物被搶，生氣地追了過去，貓「蹭」的一聲爬到樹上。狗爬不上去，在樹下狂叫：「你這陰險的傢伙，竟然沒教我爬樹的本領！」貓則在樹上冷笑：「你不也同樣卑鄙，沒教我快跑的技巧！」雙方從此結下梁子，日後狗一見到貓，便狂追不捨，就好像要向牠討回昔日那隻到口的肥老鼠呢！",
    "qas": [
      {
        "query_id": "3_0",
        "query_text": "狗教貓什麼能力?",
        "answers": [
          "搜尋獵物有一隻猴子住在山林裏，它非常羡慕人類它覺得當人實在太快樂了果實熟了的時候，他們可以一擔一擔往家挑，不像自己，得四處尋覓食物，饑一餐飽一餐的"
        ]
      }
    ]
  },
  {
    "context_id": 4,
    "context_text": "冬天裏颳風下雪，人可以呆在自己的家裏，一家人親親熱熱在一起，享受預存的糧食。不像猴子，一到冬天，只能冷冰冰地蜷縮在石洞裏，又冷又餓。這只猴子想，來世我一定不再做猴了。後來，這只猴子真的死了，它去到陰間拜見閻王。閻王問猴子說：“來世你還想做猴嗎？”猴子連忙說：“不想做猴了，請大王讓我變人吧！”閻王說：“也好。不過想變人有個條件，就是必須將你身上的毛全部拔掉。”說完，閻王命一個夜叉將猴子帶到掌管超度變人的地府去。猴子到了地府，地府鬼讓猴子趴下，準備給它拔毛。可是剛被拔了一根毛，猴子便大叫起來：“哎喲，受不了，受不了！”地府鬼叫它忍耐一下，猴子哭喪著臉說：“這麼痛苦，實在不能忍受！”地府鬼只好把猴子又送回閻王那裏。閻王笑著對猴子說：“看你一毛不拔，又怎麼能成人呢？”",
    "qas": [
      {
        "query_id": "4_0",
        "query_text": "變人的條件是將身上的什麼拔掉?",
        "answers": ["毛"]
      }
    ]
  },
  {
    "context_id": 5,
    "context_text": "有一次，公雞對母雞說：“現在正是核桃成熟的時候，我們要趁著松鼠還沒有把核桃全部吃完，趕緊進山去吃個夠。”“對呀，”母雞答道，“走吧，我們可以好好地享受享受。”它們於是就上了山，而且因為天氣晴朗，一直在山上呆到天黑。不知道它們究竟是因為吃多了撐著呢，還是因為它們突然變得心高氣傲起來，它們竟然不願意步行回家。公雞用核桃殼做了一輛小車。車子做好後，小母雞坐了上去對公雞說：“你只管在前面拉車吧。”“讓我拉車？”公雞嚷了起來，“我寧願步行回家也不願意拉車。不行，我決不答應！要我坐在車上當個車伕還可以，可要我拉車，這根本不可能。”就在它們這樣爭論的時候，一隻鴨子嘎嘎嘎地叫著對它們說：“你們這兩個小偷，是誰同意你們上我的核桃山的？等著，我要讓你們吃點苦頭！”它說著便張開闊嘴，向公雞撲過去。但是公雞並非等閒之輩，毫不示弱地向鴨子反擊，對著鴨子猛踢猛蹬，弄得鴨子只好低頭求饒，並且願意接受懲罰，給它們拉車。公雞坐在車伕的位子上，高高地叫了一聲：“鴨子，盡量給我跑快點！”小車便飛快地向前駛去。他們走了一程後，遇到了兩個趕路的，一個是大頭針，一個是縫衣針。“停一停，停一停！”它倆喊道。然後又說，天快要黑了，它們寸步難行，而且路上又髒得要命，所以問能不能搭一會兒車。它倆還說，它們在城門口裁縫們常去的酒店裡喝啤酒，結果呆得太晚了。由於它倆都骨瘦如柴，佔不了多少位子，公雞便讓它們上了車，條件是要它們保證不踩到它和母雞的腳。天黑了很久以後，它們來到了一家旅店前。它們不願意在黑夜裡繼續趕路，再加上鴨子的腳力又不行，跑起來已經是左搖右擺，它們便進了店裡。店主人起初提出了許多異議，說什麼店已經住滿了，而且他覺得它們不是什麼高貴的客人。可它們說了很多好話，說要把小母雞在路上生的雞蛋給他，還把每天能生一隻蛋的鴨子留給他，他終於答應讓它們在店裡過夜。第二天清早，天剛濛濛亮，大家都還在睡夢中，公雞卻叫醒了母雞，取出那隻雞蛋，把它啄破，和母雞一起把蛋吃進了肚子，再把蛋殼扔進火爐。然後，它們來到還在沉睡的縫衣針旁，抓住它的腦袋，把它插進店老闆椅子的坐墊中，又把大頭針插在店老闆的毛巾裡。做完這些後，公雞和母雞便飛快地逃走了。鴨子因為喜歡睡在露天，所以晚上一直呆在院子裡，沒有進屋。它聽到公雞和母雞逃跑了，心裡萬分高興。它找到一條小溪，順著它遊了下去——這種旅行的方法當然要比拉車快多了。幾個小時之後，店老闆才起來。他洗了洗臉，準備用毛巾擦一擦，結果大頭針從他的臉上劃過，在他的臉上留下了一道直至耳根的長長的血印。他走進廚房，想點燃煙鬥，可當他走到火爐旁時，雞蛋殼從火爐裡蹦了出來，碰到了他的眼睛。“今天早晨好像什麼都跟我過不去。”他說，同時氣呼呼地在他爺爺留給他的椅子上坐了下來。可他立刻又跳了起來，而且叫著：“哎喲！哎喲！”那縫衣針雖然沒有紮著他的臉，卻比大頭針扎得更厲害。 他現在真的氣壞了，不由得懷疑起昨天很晚才住進店來的那幫客人。他去找它們，結果發現它們早已逃得無影無蹤了。他於是發誓說，他的店裡今後決不再接待任何二流子，因為這幫傢伙吃得多，不付一分錢，而且還忘恩負義地對你做惡作劇。",
    "qas": [
      {
        "query_id": "5_0",
        "query_text": "公雞和母雞一起把什麼吃進了肚子?",
        "answers": ["蛋"]
      }
    ]
  },
  {
    "context_id": 6,
    "context_text": "據傳說，以前有一戶人家，父母生了八個孩子，其中七個是兒子，最小的一個是女兒。這個女兒生下來以後，儘管非常漂亮可愛，但她太纖弱太瘦小，他們認為她可能活不下來，決定馬上給她施行洗禮。父親派了一個兒子要他趕快到井裡去打點水來，其他六個一看，也一窩蜂似地跟了去，每一個都爭先恐後地要第一個汲水，你爭我奪之中，他們把大水罐給掉到井裡去了。這一下，他們可就傻眼了，你看看我，我看看你，癡呆呆地站在井邊不知如何是好，都不敢回屋裡去。此時，父親正心急火燎的地等著他們把水提來，見他們去了很久還沒有回來，就說道：“他們一定是鬧著玩把這事給忘了。”他左等右等仍不見他們回來，氣得大罵起來，說他們都該變成烏鴉。話音剛落就聽見頭上一陣呱呱的叫聲傳來，他抬頭一看，發現有七隻煤炭一樣的黑色烏鴉正在上面盤旋著。看到自己的氣話變成了現實，他後悔了，不知道該怎麼辦才好。他失去了七個兒子，心裡非常悲傷，好在小女兒在接受洗禮之後一天比一天強壯起來，而且越長越漂亮了，總算對他這個父親有了一點安慰。女兒慢慢長大了，她一直不知道自己曾經有過七個哥哥，爸爸和媽媽都很小心，從來不在她面前提起。終於有一天，她偶然聽到人們談起有關她的事情，他們說：“她的的確確很漂亮，但可惜的是她的七個哥哥卻因為她的緣故而遭到不幸。”她聽到這些後非常傷心，就去問自己的父母她是不是有哥哥，他們到底怎麼樣了。父母親不好再對她隱瞞事情的真像。為了安慰她，他們說這一切都是上帝的意願，她的出生降臨都是上帝的安排，她是無罪的。但小姑娘仍然為此吃不下飯，睡不好覺，天天傷痛不已，她暗下決心，一定要想方設法把自己的七個哥哥找回來。有一天，她從家裡偷偷地跑了出去，來到外面廣闊的世界，到處尋訪自己的哥哥。她想：無論他們到了什麼地方，她不惜自己的生命，也要讓他們恢復本來面目，獲得做人的自由！出門的時候，她只帶了爸爸媽媽以前送給她的一隻小戒指，加上一塊用來充饑的長條麵包和一壺用來解渴的水，一張疲倦時用來休息的小凳子。她走啊，找啊，不停地尋訪著，一直找到遙遠的天邊，來到太陽面前。但太陽太熱太兇猛了，她急忙跑開，又來到月亮面前。可月亮又太寒冷太冷酷，還說道：“我聞到人肉和血腥味了！”她趕緊又跑到了星星那裡。星星對她很友好，很和氣，每顆星都坐在他們自己的小凳子上。當啟明星站起來往上飛時，他給了小姑娘一片小木塊，說道：“如果你沒有這片小木塊，就不能打開玻璃山上那座城堡的門。你的哥哥正是住在那座城堡裡。”小妹妹接過小木塊，把它用布包好，告別星星，起程又繼續尋找她的哥哥去了。經過艱苦跋涉，她終於找到了玻璃山。來到城門前一看，門是鎖著的，她拿出布包解開，發現裡面的小木塊不見了，不知是什麼時候自己把好心的啟明星送的禮物失落了。怎麼辦呢？她要救哥哥，可又沒有了玻璃山城堡的鑰匙。這位堅定忠實的小妹妹一咬牙，從口袋裡掏出一把小刀把自己的小指頭切了下來，那指頭的大小正好和失落的木塊相同，她將指頭插進門上的鎖孔，門被打開了。她走進城堡，迎面遇到了一個小矮人，他問道：“你來找什麼呀？”小妹妹回答說：“我來找那七隻烏鴉，他們是我的哥哥。”小矮人說道：“我的主人不在家，如果你非要等他們回來的話，就請進來吧。”這時，小矮人正在為烏鴉們準備晚餐，他在桌子上擺了七個盤子，在盤子裡放好食物，又端來七杯水放在盤子旁邊。小妹妹把每個盤子裡的東西都吃了一小塊，把每個小杯子裡的水也喝了一小口，又將她隨身帶來的小戒指放進了最後一隻杯子中。忽然，她聽到空中傳來了翅膀拍擊的聲音和呱呱的叫聲，小矮人馬上說道：“我的主人們回來了。”她連忙躲到門後面，想聽聽他們會說些什麼。七隻烏鴉一進來，就急於找自己的盤子和杯子想要吃東西喝水，他們一個接一個的叫道：“誰吃了我盤子裡的東西？誰把我杯子裡的水喝了一點點？呱呱呱！呱呱呱！我知道了呀，這一定是人的嘴巴。”第七隻烏鴉喝完水，發現杯子裡有一隻戒指，他仔細一瞧，認出了這是他們父母親的東西，就說道：“噯！我們的小妹妹來了！我們就會得救了。 ”小妹妹聽到這裡，馬上跑了出來。她一露面，七隻烏鴉立即都恢復了他們的人形。他們互相緊緊擁抱，親吻，一起高高興興地回到了他們的爸爸媽媽的身邊。",
    "qas": [
      {
        "query_id": "6_0",
        "query_text": "小妹妹走進城堡遇到了誰?",
        "answers": ["小矮人"]
      }
    ]
  },
  {
    "context_id": 7,
    "context_text": "敵人包圍了東印度，他們說不拿到六百元錢決不撤走。於是城裡就鳴鑼宣告，說誰能出六百元錢就能當鎮長。那時有個窮漁翁正和兒子在海邊打魚，敵人來了，掠走了他的兒子，給了父親六百元錢。父親拿著錢去交給了城裡的要人，敵人退了，漁翁便當了鎮長。接著鎮裡又出了告示，說有誰不稱他“鎮長先生”，就得處以絞刑。那兒子又從敵人手中逃走了，他來到了一座大山的森林旁。突然山裂開了，他走了進去，來到廣闊的魔國，那兒所有的桌椅板凳都披著黑色。這時來了三位公主，全身著黑，只露出一點白色的臉蛋在外。她們叫他別害怕，說他們不會傷害他，並說他能救她們。他說他樂意效勞，只是不知該怎麼做。三位公主便要求他在一年內既不能說話，又不能看她們一眼，不過他有​​什麼需要儘管開口，只要她們能做到，就會盡量滿足他。於是他在那住下了，過了一段時間，他提出要去他爹那兒，她們答應了，臨走時讓他帶上一袋錢，披上他的舊罩衣，過一禮拜就得趕回來。於是他被送上了天，眨眼間就到了東印度。他在漁翁的茅棚裡找不著爹，便問人那位窮漁翁可能在哪兒，人家告訴他不能那樣稱呼，否則就得上絞架。他來到他爹的跟前，說：“漁翁，你怎麼到這裡來了？”他爹說：“你可不要那樣大呼小叫的，如果讓城裡的要人聽見了，就會被送上絞架。”可他卻不肯改口，於是被帶向了絞架。他到了那兒時說：“哦！老爺們，讓我去我爹的漁棚一下吧！”然後他披上了他的舊罩衫，回到了要人們的跟前，說：“現在你們瞧瞧吧，難道我不是那窮漁翁的兒子嗎？我從前就是穿著這件衣服給我爹娘掙衣食的。”這時他爹認出了他，請他原諒，並把他領回了家。摟著兒子向他講述了發生的一切：自己是如何走進大山中的森林，然後大山裂開，他走進了一個魔國，那兒一切都是黑色的，後來了三位公主，也是全身著黑，只露出一張小白臉。她們又怎樣讓自己別害怕，並說自己能救她們。聽到這兒他娘說這恐怕不好，他得帶根聖燭去，並在她們臉上滴上幾滴溶燭。他又回去了，心裡充滿了恐懼。趁三位公主仍在睡覺，他在她們臉上滴上溶化了的蠟燭，她們便都白了一半。三位公主立刻跳起來，說：“你這該死的狗東西，我們不報此仇，誓不罷休！現在世上再也無人能救我們了；我們還有三個兄弟，他們仍被七根鐵鏈銬著，到時他們會把你撕得粉碎的。”接著一聲嘶心的尖叫聲響徹整個魔國的上空，他從窗口一躍而出了，可惜跌斷了腿。宮殿再次陷入地下，山縫合攏，從此便無人知曉它在何方了。",
    "qas": [
      {
        "query_id": "7_0",
        "query_text": "出六百元錢就能當什麼?",
        "answers": ["鎮長"]
      }
    ]
  },
  {
    "context_id": 8,
    "context_text": "從前有個女孩，非常懶惰，怎麼著都不願意紡紗。終於有一天，母親感到忍無可忍，就打了她一頓，她於是嚎啕大哭起來。正巧這時王后乘車從門前經過，聽見了哭聲，吩咐把車停下來，進屋問那位母親為什麼打女兒。做母親的怎好意思說自己的女兒如何如何的懶惰，於是就回答說：“我叫她不要再紡了，可她就是不聽，在紡車上仍然紡個不停。我窮啊，哪買得起那麼多的亞麻呀。”王后聽了說道：“我最愛紡紗。讓你的女兒隨我進宮去吧，我有的是亞麻，她願意紡多少就紡多少。”母親聽了這話，打心眼兒裡高興，滿口答應下來，王后便帶著女孩走了。她們到了王宮之後，王后領著女孩上了樓，把三間庫房指給她看，只見庫房裡裝滿了最好的亞麻。 “喏，你就為我紡這些亞麻吧，”王后說道，“你什麼時候紡完了，就嫁給我的長子。”女孩聽了心裡一陣驚恐，即使她每天從早紡到晚，紡到她三百歲的時候，也休想把那麼多的亞麻紡完。剩下女孩獨自一人時，她就哭了起來。她就這樣哭哭啼啼地坐著，一晃兒三天過去了，還沒動手紡紗呢。第三天，女孩不知如何是好，憂心忡忡地來到窗前。恰在這時她看見有三個女人走了過來：第一個女人的一個腳板又寬又平；第二個的下嘴唇很長，耷拉到下巴上；而第三個的一隻大拇指非常寬大。這三個女人走到窗下停住了腳，問女孩為什麼憂心忡忡，她就向她們訴說了自己的苦惱。 “只要你不嫌我們丟人，”他們對女孩說道，“請我們參加你的婚禮，說我們是你的表姐，並且讓我們與你同桌喝喜酒，我們就幫你把這些亞麻紡完。”“我非常樂意。”女孩回答說。說罷，女孩就讓這三個長相奇特的女人進屋來。她們進來後剛一坐下就開始紡紗。每次王后來，女孩生怕王后發現，便把那三個紡紗女藏起來，而讓王后看已經紡好的紗。王后看了之後，對她贊不絕口。庫房裡所有的亞麻都紡完了，這三個紡織女便跟女孩告別，臨行前對她說道：“你可千萬不要忘記了對我們許下的諾言，這關係到你自己的幸福啊。 ”女孩領著王后看了三間空蕩蕩的庫房和堆得像小山似的紗線，王后於是就安排了婚禮。“我有三位表姐，”女孩說，“她們待我非常好。在我自己幸福如意的時候，怎麼也不願意冷漠了她們。請允許我邀請她們來參加婚禮，並且讓她們在婚宴上和我們坐在一起。”王后和王子欣然同意。婚禮那天，三個紡紗女果然來了。她們打扮得怪模怪樣的，很令人發笑。新娘馬上迎上去說：“歡迎你們，親愛的表姐們。”“你的幾個表姐怎麼長得這麼醜？”王子問道。隨後，他轉身走到那個大腳板女人身邊，問道：“您的一隻腳怎麼會這樣大呢？”“踏紡車踏的唄。”她回答道。新郎又走到第二個女人身旁，問道：“您的嘴唇怎麼會耷拉著呢？”“舔麻線舔的唄。”她回答說。然後他問第三個女人：“您的大拇指怎麼會這樣寬呢？”“捻麻線捻的唄。”她回答說。王子聽罷三人的回答，大驚失色，於是就說：“我美麗的新娘今後絕不再碰紡車一下。”就這樣，女孩從此再也用不著幹紡紗這個討厭的活兒了。",
    "qas": [
      {
        "query_id": "8_0",
        "query_text": "庫房裡裝滿了什麼?",
        "answers": ["亞麻"]
      }
    ]
  },
  {
    "context_id": 9,
    "context_text": "從前，有個人有三個兒子，除了他所住的那棟房子外便沒有什麼財產了。三個兒子都想在父親死後得到那房子，可老人對他們仨一樣鐘愛，不知該把房子給誰好。不過他可以把房子賣掉再把錢分給他們呀！可房子是祖上傳下來的，老人捨不得賣它。終於他想出了個好主意，他把三個兒子叫到跟前說：“現在你們都出門去各學一門藝，待學成歸來，看誰的本事最高，房子就歸誰。”兒子們挺贊同這主意。老大要當鐵匠，老二要做剃頭匠，老三打算做名劍客。他們約好了回家“比武”的時間便各奔前程了事情很湊巧，他們各自找了位技藝高超的師傅，得以學習上乘的技藝。鐵匠專為國王的坐騎釘掌，心想：“房子肯定是我的啦！”剃頭匠專為達官貴人修面，也認為房子非他莫屬。學劍術的小弟卻沒有那麼順利，屢次挨打，不過還是咬緊牙關挺過來了，他想：“如果我怕挨打，就永遠得不到房子啦！”約定的時間到了，三兄弟按時回到了父親的身邊。不過他們不知道如何找到最好的機會來展示各自的本領，於是只好坐下來商量。就在這時，一隻兔子突然跑過田間，“哈哈！來得正是時候。”剃頭匠說著，只見他端起臉盆和肥皂，待兔子跑近，迅速地在兔子身上抹上肥皂泡沫，就在兔子仍在奔跑的同時，以迅雷不及掩耳之勢給兔子剃了個短鬍子，絲毫不傷體膚。“幹得漂亮！”老人讚道，“如果你的兄弟不及你，房子就歸你啦！”不一會兒，只見一個貴族乘著馬車疾馳而來。鐵匠說：“爹，您老瞧我的吧！”只見他幾步就追上了馬車、瞬間就給一匹飛馳的馬兒換了四個新嶄嶄的馬蹄鐵。“不錯！你一點也不比你弟弟遜色。”父親這下可犯難了，“我該把房子給誰呢？”這時老三說話了：“爹，如果你願意，該讓我做一回了。”天空正巧下起雨來，只見他拔出劍，不停地在頭頂揮舞起來，竟是滴水不漏，身上無絲毫濕跡。雨越下越大，後來竟成傾盆之勢，只見他手中的劍也越舞越快，身上仍沒沾絲毫滴雨，彷彿處在屋中一樣。父親見了大驚，說：“你的技藝最精湛，房子就歸你啦！”於是一切都如約進行，兩位大哥對這一結果也口服心服。由於他們仨手足情深，彼此不願分開，於是都留在這所房子裡，各施其藝。由於他們都各有一門絕活，且人又聰明，賺了很多錢。於是他們一同過著幸福的生活，一直到老。最後兄弟中的一個得病先去世了，其他兩位悲傷不已，不久他們也相繼去世，因為他們是那樣的手足情深，人們把他們合埋在同一個墳墓裡。",
    "qas": [
      {
        "query_id": "9_0",
        "query_text": "老二要做什麼?",
        "answers": ["剃頭匠"]
      }
    ]
  },
  {
    "context_id": 10,
    "context_text": "從前有個窮人，窮得連自己的兒子都養不活。兒子便對他說：“好爸爸，我們現在的日子過得太糟了，而我又是你的一個負擔。我現在想離開家，看能不能掙到飯吃。”父親祝福了他，然後悲痛欲絕地送他出了家門。這時候，一個強大帝國的國王正和人打仗，於是他便參加了國王的部隊，上前線去打仗。他到達前線時正好趕上激烈的戰鬥，而且情況非常危急，他的戰友們紛紛倒在敵人的彈雨中。當指揮官也犧牲時，剩下的人打算逃跑，可是這位年輕人站出來大著膽子對他們叫道：“我們決不能讓自己的祖國滅亡！”於是其他人跟在他的後面，在他的帶領下打敗了敵人。當國王得知這場勝利全靠他一個人時，就把他提升到最高的位置，給了他許多財富，使他一下子成了全國最顯赫的人物。國王有一個女兒，雖長得非常美麗，脾氣卻非常古怪，她只答應嫁給一個保證在她死後願意被活埋在她身邊的人。 “如果這個人真心實意地愛我，”她說，“我死了之後他活著還有什麼用？”反過來，她也是一樣。如果她丈夫先死，她願意和他一起被埋進墳墓。她這古怪的誓言嚇得人一直不敢向她求婚，可是這位年輕人被公主的美貌迷住了，不顧一切地請求國王把女兒嫁給他。“你知道你要作出什麼樣的承諾嗎？”國王問。“要是我活得比她長，就得為她做陪葬，”他回答，“可是我非常愛她，根本不在乎這種危險。 ”國王於是便答應了，他們舉行了盛大的婚禮。這對年輕人幸福美滿地生活了一段時間，妻子便突然得了重病，醫生們沒有一個能治好她。她死了之後，年輕的丈夫想起了自己的諾言，知道自己得活生生地被關在墳墓裡，不由得驚恐萬狀，可也沒有什麼別的辦法。國王在王宮的各個大門口都派了崗哨，所以他根本不可能逃避這厄運。安葬屍體的那一天，他也被帶進了王室的陵墓，然後墓門就被關上了，而且還上了插銷。棺材旁有張桌子，上面放著四支蠟燭、四條麵包和四瓶酒。等這些東西消耗完後，他就會餓死。他萬分痛苦、萬分傷心地坐在那裡，每天只吃一丁點麵包，只喝一口酒，可死神還是一天天地在向他逼近。正當他出神地坐在那裡時，他看到一條蛇從墓穴的角落裡鑽了出來，向死屍爬去。他以為蛇是去咬她的肉，便拔出寶劍說：“只要我還活著，你就休想碰她一下。”說完就把蛇砍成了三段。過了一會兒，又一條蛇從洞裡爬了出來。當它看到第一條蛇被砍成了三段，已經死了，它便爬了回去。可不一會兒它又爬了出來，嘴裡銜著三片綠色的葉子。然後，它把死蛇的三段拼在一起，在每一處傷口上蓋上一片葉子。頃刻之間，那條斷蛇的的幾個部分又長在了一起。蛇動了幾下便活了過來，然後和第二條蛇一起逃走了，而那三片葉子卻留在了地上。這位目睹了這一切的不幸青年突然產生了一個想法：不知道這些把死蛇重新救活的葉子的魔力能不能把人也救活。於是，他撿起葉子，在他亡妻的嘴上放了一片，又把另外兩片放在她的眼睛上。他剛把葉子放好，血液便開始在她的血管裡流動，慢慢湧上了她蒼白的臉頰，使它重新變得緋紅。接著，她吸了口氣，睜開眼睛，說：“啊，上帝，我這是在哪裡呀？”“你和我在一起，親愛的妻子，”他回答，然後把所發生的一切，以及他救活她的經過告訴了她。他給她喝了點酒，又給她吃了點麵包。等她重新恢復精力後，他扶她站起來走到墓門口，又是敲門又是叫喊。衛兵們聽到後便去報告國王。國王親自來打開墓門，發現他倆健康而富有活力，不禁為悲傷的事情終於結束而欣喜萬分。年輕人把那三片蛇葉帶了出來，把它們交給一個侍從，說：“給我小心保管好，要時刻帶在身邊。天知道我們還會遇到什麼麻煩呢？說不定我們還用得著它們呢！”可他的妻子發生了變化，她死而復生之後好像完全失去了對丈夫的愛。過了一段時間，年輕人想過海去看看他的老父親。他們上船之後，她就忘記了她丈夫對她所表現出的深深的愛和忠誠，也忘記了他對她的救命之恩，可惡地迷上了船長。一天，當年輕人睡著時，她叫來船長，自己抱住丈夫的頭，船長抓住他的腳，兩個人一起把他扔進了大海。幹完了這可恥的勾當之後，她說：“我們現在回去，就說他死在路上了。我會在我父親的面前大大地誇獎你，贊揚你，使他同意把我嫁給你，並且讓你做王位的繼承人。”可是那位忠心耿耿的侍從在暗中目睹了一切。他從大船上解下一隻小船，坐上去尋找他的主人，不再管那兩個壞傢伙駛向哪裡。他從水裡撈起年輕人的屍體，把身上帶著的三片蛇葉分別放在他的眼睛和嘴巴上，幸運地救活了他。他倆日夜奮力地划船，小船行駛如飛，結果他們比其他人先回到老國王的王宮。老國王看到他倆獨自回來自然感到很驚訝，便問發生了什麼事。他聽說自己女兒的可惡行徑後說：“我不相信她會幹出這樣卑鄙的事情，但是很快就會真相大白的。”他命令他倆躲進一間密室，不要讓任何人看見。不久，大船駛了回來，那個不知羞恥的女人滿臉愁容地來見父親。老國王問：“你怎麼獨自回來了？你丈夫呢？”“唉，親愛的父親，”她回答，“我的心都要碎了。我丈夫在途中突然得病死了，要不是這位好心的船長幫助我，我就慘嘍！我丈夫死的時候他也在場，他可以把一切告訴你。”國王說：“我要讓死去的人復活！”說著就打開了密室，叫那主僕二人出來。那女人一看見自己的丈夫，就像被雷打了一樣跪了下去，請求饒恕。國王說：“絕不能饒恕！他願意和你一起去死，而且把你救活，可你卻趁他睡著時害死他，你是罪有應得。”接著，她和她的幫兇被放在一條鑿了洞的船上。船被推到海上，很快就在洶湧的浪濤中沉沒了。",
    "qas": [
      {
        "query_id": "10_0",
        "query_text": "一條蛇死後，另一條蛇嘴裡銜著三片什麼?",
        "answers": ["綠色的葉子"]
      }
    ]
  },
  {
    "context_id": 11,
    "context_text": "從前，有位住在瑞士的老伯爵只有一個兒子，可這兒子傻傻的，什麼也學不會。父親於是對兒子說：“聽著，兒子。我已經盡一切努力教你，可你什麼都沒學會。我替你找了個有名的導師，你上他那兒去，看他能不能教你點什麼。”就這樣，年輕人被送到另外一座城市，在那裡學了一年。年底他回到家，父親問他：“兒子，你這一年學了點什麼？”“父親，我學會了狗語。”“主啊，可憐可憐我們吧！”父親叫起來，“這就是你所學的？我要把你送到另一個城市去，另找一位導師。”於是，年輕人又被送去和另一位導師學了一年。回來時父親問：“我的孩子，今年你學了點什麼？”他回答說：“父親，我能聽懂鳥語了。”父親大發雷霆：“你這蠢貨，竟然一無所獲地度過寶貴的時光！你回來就不感到難為情嗎？我再為你找個導師，如果你這次還是什麼都學不會，我就再沒你這兒子了！”年輕人跟著第三位導師又學了一年。等回到家，父親問他：“你學會了什麼，兒子？”他回答：“親愛的父親，今年我能聽懂蛙鳴的含義了。”父親氣得火冒三丈地跳起來對僕人說：“這傢伙不再是我兒子，我已經把他趕出去了。我命令你們把他帶到森林裡去殺了。”僕人把青年帶到森林裡，但是不忍心殺他，他把他放了，然後殺了一頭鹿，取了眼睛和舌頭拿回去稟報伯爵。青年漫無目的地朝前走，走了很久，終於來到一座城堡。他請求那裡的人讓他歇一夜。“可以，”城堡的主人說，“只要你願意，就去塔樓裡住一夜吧。不過我要警告你：那裡很危險，有很多野狗在不停地亂吠亂叫，到某個時辰還得給它們一個人吃，傾刻就會把人吃光。”原來當時整個地區都被這群野狗鬧得不得安寧，可又沒有辦法。年輕人一點也不害怕地說：“就讓我去吧，不會有事的。給點吃的讓我去餵它們。”既然他自己要去，人們便給了他一些餵狗的東西讓他去了。年輕人走進塔樓，那些狗不叫也不鬧，友好地搖著尾巴圍著他轉，吃著他擺在它們跟前的食物，絲毫沒有傷害他。第二天，他毛髮無損地平安走出塔樓來對主人說：“那些狗用它們的話告訴我為什麼它們會住到這兒來，為什麼會為害一方的。它們中了魔法，被迫到這兒來守護塔樓底下的一筆財寶，只有等人們取走財寶時它們才能得到安寧。我還從它們的談話中瞭解到怎樣才能取出這些財寶。 ”聽到的人無不欣喜萬分，主人說只要年輕人做好這件事就認他作兒子。於是年輕人又來到塔樓，胸有成竹地取出一個裝滿了金子的箱子。從此，人們再沒聽到野狗的嚎叫，也再沒見到那些野狗了，這個地方又恢復了原有的寧靜。過了一段時間，年輕人想去羅馬。他路過一片沼澤地，聽到許多青蛙在“呱呱”地說話。他聽後沉思起來，感到有些悲傷。後來他終於到了羅馬，原來教皇剛剛去世了，紅衣主教們正在為由誰繼任教皇發愁。他們最後決定選一個有神力、能創造奇跡的人繼任。年輕的伯爵這時恰好走進教堂，兩隻白鴿飛到他肩頭就不走了。教士們認為那是主的意志，當時就問他是否願意當教皇。年輕人猶豫著，不知道自己是否配做教皇。鴿子建議他答應下來，於是他同意了。接著就是塗油、獻祭等一系列宗教儀式。他在來羅馬的路上就聽到青蛙們說自己會當上神聖的教皇，他當時大為震驚，這時正好驗證了。輪到他主持做彌撒的時候，他連一個字也不會講。兩隻鴿子就一直坐在他肩頭，一句句教給他。",
    "qas": [
      {
        "query_id": "11_0",
        "query_text": "年輕人路過一片沼澤聽到誰在說話?",
        "answers": ["青蛙"]
      }
    ]
  },
  {
    "context_id": 12,
    "context_text": "從前從前，有三隻小豬。最大的小豬：豬大哥很貪睡，很懶惰。一天到晚都在打瞌睡。第二個小豬：豬二哥很愛吃，他也很懶惰。最小的小豬：豬小弟是個勤勞的好孩子。常常努力的工作有一天，豬媽媽告訴他們說：「你們都長大了，應該自己蓋房子，自己住，自己種田，自己生活。我要你們自己照顧自己。」豬大哥噘起嘴，懶洋洋走出家門。「咿咿．．．．．好討厭哦！」豬大哥想一想說：「蓋一棟稻草屋吧，那最簡單了。」稻草屋很快的蓋好了，豬大哥好得意，他馬上去找兩個弟弟來，很驕傲的對他們說：「我的房子蓋好了，很漂亮吧～，你們也快一點蓋吧！」豬二哥看見說：「哇，果然很漂亮，大哥，你真了不起啊！」可是豬小弟並不以為然，他說：「哥，你不擔心稻草屋會被風吹倒嗎？」豬二哥想了想，說：「稻草屋會被風吹倒，那我就用木頭來蓋好了，木屋較重，不怕風吹。」豬二哥決定以後，「咚咚咚，咚咚咚！」他很認真的工作，一會兒敲敲釘子，一會兒鋸木頭。很快的，一棟木屋蓋好了。豬二哥趕忙把哥哥和弟弟都請來，驕傲的說：「你們看，這麼漂亮的房子！而且釘得很牢固，不會被風吹倒，我真的好棒呀！」豬小弟說：「木屋雖然不會被風吹倒，可是用力打，木頭會被打斷，房子就垮了。」「討厭！」豬二哥罵小弟說：「你以為你最聰明？看你搬磚頭搬一整天了，房子還沒蓋出來。笨蛋～～」豬小弟不慌不忙說：「我蓋房子雖然比你們慢，但是我要蓋的房子不怕風吹，也不怕敲打，紅磚房子最牢固了。」豬小弟不理會哥哥的嘲笑，他搬好了磚塊，又搬水泥，他把水泥和好了，開始堆砌磚塊，一塊一塊將抹上水泥的磚頭堆砌起來。豬小弟心理想：你們不要笑我，等我蓋好了，你們就知道了，我的房子比什麼都堅固，野狼來了我也不怕呢！豬小弟繼續加油工作，他趕呀趕，趕到天黑，月亮掛在天上了，他的紅磚房子才好不容易蓋好了。豬小弟正想休息，卻聽到了大野狼的吼叫聲。這時兩個豬哥哥也聽到了野狼的吼叫聲，怕得發抖，他們怕野狼來，所以整夜都不敢安心睡覺。隔天，豬媽媽要三隻小豬到田裡工作，沒想到走到半路的時候，他們被一隻可怕的大野狼發現了，野狼一直跟蹤他們。野狼決定先吃豬大哥。豬大哥剛回到家，就聽到大野狼的聲音：「砰砰砰！小豬朋友，快給我開門！」野狼叫門叫得好兇。豬大哥嚇得臉都白了，他趕緊拿一把大鎖，把門緊緊鎖了起來。可是野狼哈哈大笑說：「你這個大笨蛋，這種稻草屋，我吹一口氣就倒了。」他說完話，用力一吹，果然把稻草屋吹倒了，豬大哥嚇得直跑到豬二哥家。「救命呀！」大哥慌慌張張跑進豬二哥的木屋子，趕忙把大門閂上，怕野狼闖進來。可是野狼吼叫說：「木頭屋子一樣擋不住我，我一定要把你吃掉！」兩隻小豬怕得縮著身子擠在一起，頭上直冒冷汗。因為野狼怕把門打壞了，「砰～～」，門板發出吱吱吱的斷裂聲，兩隻小豬眼看野狼就要衝進來了，他們亂闖亂撞，結果撞倒了木屋子，他們直奔到豬小弟的家。野狼也一直在身後追趕他們。兩隻小豬逃呀逃呀，逃到小弟弟的家中。「弟弟，弟弟，小．．．．弟弟，野狼在我們．．身．．．後．．．」豬大哥上氣不接下氣的說：「快把門鎖緊，不然我們會被吃掉的。」豬小弟卻一點都不擔心，他說：「怕什麼？這麼堅固的磚屋，野狼進不來的。」很快的，野狼就追來了。他生氣的說：「死小豬，看我把你們的房子撞倒，你們就要被我吃掉了。」野狼說著說的開始撞牆了。「呀！～～」他使出全身力氣，向磚牆猛撞過去！「啪啦！」一聲，磚牆沒被撞倒，野狼的骨頭卻斷了，「哎唷，痛死我了，痛死我了！」野狼哭哭啼啼的回家去了。「萬歲！」三隻小豬很高興的叫起來。從此，他們三個兄弟住在一起，每天一起吃飯睡覺，也一起工作，日子過得很快樂，而且野狼一直沒再出現呢！",
    "qas": [
      {
        "query_id": "12_0",
        "query_text": "豬媽媽要三隻小豬到哪裡去工作?",
        "answers": ["田裡"]
      }
    ]
  },
  {
    "context_id": 13,
    "context_text": "上帝造完所有的動物後，挑了狼做他的狗，卻單單忘了造山羊。於是魔鬼就做好了準備，要創造一種尾巴細長的山羊。當這種山羊在牧場上吃草時，長尾巴老是掛在了籬笆上，魔鬼又得馬上去解開，費盡了周折。魔鬼最後也火了，他乾脆咬斷了所有的羊尾巴，現在我們還能看到羊身上餘下來的那一截。後來魔鬼就讓它們自己去吃草，但上帝正巧打那裡經過，看見了這些羊，發現一隻正在啃吃一棵果樹，一隻在損壞葡萄樹，一隻在摧殘別的弱小植物，上帝很傷心。本著慈悲為懷的心願，上帝喚來了狼，眨眼間狼就把那些山羊咬得稀爛了。魔鬼知道了這件事，便來到了上帝的跟前說：“你的畜生咬死了我的山羊。”上帝反問道：“你為何創造那些東西來作孽呢？”魔鬼申辯說：“我也沒辦法，因為我腦子裡總想著要幹壞事，我不能創造別種性質的東西，你得重重地賠償我。”“好的，等橡樹葉落光後我再賠你。那時你來，我會如數把錢賠給你。”等橡樹落葉時，魔鬼來討債了。但上帝說：“君士坦丁教堂裡還有一棵橡樹葉子仍在。”魔鬼憤怒異常，口中詛咒著，便去尋找那棵橡樹。他在杳無人煙的荒野遊盪了六個月，最後總算找到了那棵樹。當他回來時，枯木又逢了春，所有的橡樹又披上綠裝了。魔鬼只得放棄了他的債，盛怒之下，挖掉了所有山羊的眼睛，把自己的眼睛給塞了進去。從此，山羊就有了魔鬼的眼睛和咬斷的尾巴，而鬼呢，總是喜歡裝成它們的樣子。",
    "qas": [
      {
        "query_id": "13_0",
        "query_text": "上帝挑了誰做他的狗?",
        "answers": ["狼"]
      }
    ]
  },
  {
    "context_id": 14,
    "context_text": "從前有姊妹倆，一個膝下無子卻很富裕；一個有五個兒女卻是個寡婦，她窮得叮噹響連一家子都養不活。為生計所迫，沒辦法，她只得到姐姐那兒去要，說：“我的孩子和我正餓得慌，你很有錢，給我們一口麵包吧！”那個有錢的姐姐可是個鐵石心腸，她居然說：“我連自己也沒有什麼吃的呢！”後來又惡言惡語地把可憐的妹妹打發走了。過了一會兒，富姐姐的丈夫回來了，想切塊麵包吃。等他切第一刀時，麵包裡竟流出了殷紅的血液。女人見了很害怕，便把妹妹要麵包的事告訴了丈夫，丈夫急匆匆地趕到那寡婦家，準備給她點週濟。等他踏進寡婦的屋內時，只見她正在祈禱，懷裡正抱著兩個小孩，三個大的已躺在床上死去了。他給了她些食物，但她卻回答說：“我已不需人間的食物了，上帝已滿足了我三個孩子的食慾，我們的祈求他一定會聽見的。”說著兩個孩子就斷了氣，於是她的心也碎了，倒下死了。",
    "qas": [
      {
        "query_id": "14_0",
        "query_text": "麵包裡會流出什麼?",
        "answers": ["血液"]
      }
    ]
  },
  {
    "context_id": 15,
    "context_text": "一個農夫趕著兩頭牛去耕地，到了地裡，發現兩隻畜生的角開始長大，而且越長越大。在他回家的時候，它們的角竟然大得進不了院門了。一個屠戶正巧此時路過這裡，農夫把牛賣給屠戶，他們商定的支付方式是，農夫給屠夫一配克油菜籽，然後由屠夫點數，一粒油菜籽付一塊金幣。這筆買賣真不錯！農夫回家扛了一配克油菜籽，可是半路上從口袋裡掉出了一粒油菜籽。屠夫按數付給了農夫錢，假如農夫沒有掉那粒種子，他本來是可以多得一塊金幣的。在農夫迴轉的時候，那粒種子已經長成一棵大樹直抵藍天。這時農夫心想：“既然有了這個機會，你一定得去看看上面的天使們在幹什麼。”於是他爬了上去，看見天使們正忙著打曬燕麥呢，他不由地被這情景所吸引。就在看得入神的當兒，他發覺身下的樹開始搖晃，他趕緊低頭往下瞧，發現有人正在砍這棵樹。“如果我從這兒掉下去，那可就倒大霉了。”他嚇出一身冷汗。在絕望之中，他從旁邊的燕麥稈堆中拽出一些麥稈，搓成了一根草繩。在天堂中到處扔有種莊稼的工具，他手忙腳亂地抓了一把厥頭和一把木枷，然後順著繩子爬了下來。沒想到他著地的時候，正好掉進了一個很深很深的洞中。幸虧他帶著一把厥頭，他用厥頭挖了很多的台階，爬了出來。作為物證，他還隨身帶出了那把木枷，這樣一來就沒有人會懷疑他上過天堂的故事啦。",
    "qas": [
      {
        "query_id": "15_0",
        "query_text": "農夫趕著兩頭什麼去耕地?",
        "answers": ["牛"]
      }
    ]
  },
  {
    "context_id": 16,
    "context_text": "從前有個婦人，她帶著女兒住在一座漂亮的花園裡，院子裡種了許多捲心菜。冬天，有隻兔子來到院子裡偷吃捲心菜，媽媽對女兒說：“去把那兔子趕走。”小姑娘就出來對兔子說：“餵！兔子，你快把我們家的捲心菜吃光了。”兔子對小姑娘說：“小姑娘，來坐到我尾巴上來吧，我帶你上我家去。”小姑娘不肯。第二天，兔子又來吃捲心菜了。媽媽又對女兒說：“到院子裡去把那隻兔子趕走。”小姑娘就出來對兔子說：“餵！兔子，你快把我們家的捲心菜吃光了。”兔子對小姑娘說：“小姑娘，來坐到我尾巴上來吧，我帶你上我家去。”小姑娘還是拒絕了。第三天，兔子又來了，坐在卷心菜上面。媽媽對女兒說：“去把那兔子趕走。”小姑娘就出來對兔子說：“餵！兔子，你快把我們家的捲心菜吃光了。”兔子對小姑娘說：“小姑娘，來坐到我尾巴上來吧，我帶你上我家去。”小姑娘坐到兔子尾巴上，被帶到了很遠的兔子家。它對姑娘說：“現在動手燒飯吧，用青菜和小米，我去請來參加婚禮的客人。”接著，所有的客人都到了（誰是客人？我把別人告訴我的說給你聽吧：全是兔子！奶牛是牧師，為新郎新娘主持婚禮；狐狸是司儀，祭壇在彩虹下面。）姑娘十分難過，因為只有她是人。小兔子走來說：“開門開門快開門，客人們都很有興趣。”被當成新娘的姑娘一言不發地抽泣起來，兔子走了出去。它再回來時又說：“開飯開飯快開飯，客人們肚子都很餓了。”新娘還是一聲不吭，顧自流淚，兔子又走了。它第三次回來時對小姑娘說：“揭開鍋蓋快揭開，客人已經不耐煩。”新娘沉默著，兔子又出去了。於是姑娘將自己的衣服套在一個稻草人身上，給它一把勺子裝成攪拌鍋裡煮的東西的樣子，然後把它擺在鍋邊，自己回家找媽媽去了。小兔子又回來喊：“快開飯，快開飯！”然後站起來，對著新娘就是一拳，結果把稻草人的帽子給打掉了。小兔子發現這不是它要的新娘，十分難過地離開了那裡。",
    "qas": [
      {
        "query_id": "16_0",
        "query_text": "冬天，兔子來到院子裡偷吃什麼?",
        "answers": ["捲心菜"]
      }
    ]
  },
  {
    "context_id": 17,
    "context_text": "從前有個鞋匠，生意上從來沒出過什麼差錯，日子卻過得越來越窮，後來窮到連做鞋子的材料也沒有了，只剩下了一張皮子。他把這張皮子裁剪好，發現剛剛夠做一雙鞋子。然後他就上床休息，睡前還做了祈禱。由於他為人問心無愧，所以睡得很香很甜。第二天一大早，他洗漱完畢，穿好衣服，走到工作台前正準備做鞋，卻驚奇地發現，鞋已經做好了，他完全給弄糊塗了，不知道這到底是怎麼一回事。他拿起鞋子仔細查看……活兒做得一絲不苟，沒有哪一針縫得馬虎。事實上，這雙鞋是令鞋匠都感到驕傲的傑作。過了一小會兒，一位顧客走了進來。他一見這雙鞋子也就愛不釋手，花了高價買下了這雙鞋。這樣一來，鞋匠就有了足夠的錢去買可做四雙鞋子的皮子。第二天清早，鞋匠發現四雙鞋子已經做好了。於是，就這樣日復一日，他頭天晚上裁剪好的皮料，次日一早就變成了縫製好的鞋子。不久，隨著鞋匠生意的興隆，他也成了一個有錢的人。聖誕節前幾天的一個晚上，鞋匠在上床睡覺前對妻子說：“咱們今晚上熬個通宵，看看到底是誰這樣幫助我們，好不好？”他妻子欣然同意，並點燃了一根蠟燭。隨後他們倆便藏在掛著衣服的屋角裡，注意著周圍的動靜。午夜一到，只見兩個光著身子的小人兒走了進來，坐在鞋匠工作台前。他們剛一坐下，就拿起裁剪好的皮料，用他們纖細的手指開始做鞋，又是錐，又是縫，還不時地敲敲打打。鞋匠目不轉睛地看著他們，對他們的工作贊賞不已。他們做好了鞋子，又把東西整理得井井有條，然後才急急忙忙地離去。第二天早上，鞋匠的妻子對他說：“是這兩個小人兒使咱們發了財，咱們得好好感謝他們才是。他們光著身子半夜裡來來去去，一定會著涼的。我跟你說咱們怎麼辦，我打算給他們每人做一件小襯衫、一件小背心和一條小褲子，再給他們每人織一雙小襪子，你呢，給他們每人做一雙小鞋。”她丈夫很贊成這個主意。到了晚上，給兩個小人兒的禮物全都做好了，他們把禮物放在工作台上，沒有再放裁剪好的皮料。然後他們自己又躲藏起來，想看看兩個小人兒會說些什麼。午夜時分，兩個小人兒蹦蹦跳跳地跑了進來，準備馬上開始幹活兒，可他們怎麼也找不到裁剪好的皮料，卻發現了兩套漂亮的小衣服，他們喜形於色，高興得手舞足蹈起來。兩個小人兒飛快地穿上衣服，接著唱了起來：“咱們穿得體面又漂亮，何必還要當個皮鞋匠！”他們倆在椅子和工作台上又是蹦啊，又是跳，最後蹦跳著離開了房門。從此，兩個小人兒再沒有來過，而鞋匠一直過著富足的日子，事事稱心如意。",
    "qas": [
      {
        "query_id": "17_0",
        "query_text": "小人兒找不到剪好的皮料，卻發現了兩套漂亮的什麼?",
        "answers": ["小衣服"]
      }
    ]
  },
  {
    "context_id": 18,
    "context_text": "在丹麥的一個島上，在麥粟田中間高高兀出古議事會址的所在，在生長著高大的山毛櫸樹林的地方，有一個很小的鎮子。這里矮小屋子都是紅頂的。在這樣的一所屋子里，在火爐里燒得白晃晃的火和灰的上面，燉著很奇特的東西；玻璃杯里有東西被燒開翻滾；有些東西被摻和在一起，有的東西被蒸溜了，缽里的草類的植物被搗碎了。這都是一位老年人干的。「我們必須按照正確的原則辦事！」他說道，「是啊，正確的，真實的，我們得認識和把握住每一件事物的真締。」在屋子里，在賢惠的主婦身邊，坐著他們的兩個兒子，都還小，但是已經有成年人的思想了。母親時常對他們講正義，講合理合法，講堅持真理，真理是上帝在這個世界上的化身。大的那個孩子，看來很聰明、敏銳。他的興趣是研究自然力，研究太陽星星之類的事物，這些比任何童話對他都要美好得多。啊，出去旅行探險，或者去探索如何才能仿造鳥類的翅膀，然後飛起來，那會是多麼幸福！是的，就是探索正確的事物！父親很對，母親很對；把世界維系在一起的是真理。弟弟則更安靜一些，完全專注于書籍。讀到雅可布披上羊皮裝成以掃把長子權騙到手的時候，他便憤憤地攥緊自己的小拳頭，對詐騙十分惱怒。讀到暴君，讀到存在于世上的不公平和邪惡的時候，他會流出眼淚。正義和真理最終必定勝利的思想，強烈地充滿他的胸懷。有一天夜里，他已經上了床，但是窗簾沒有完全拉嚴，有光線射進照著他，他帶著書躺在床上，他得把梭倫的故事讀完。他的思想奇異地領著他飄得很遠。床好像成了一條大船，船帆被風吹得完全脹了起來。他是在做夢呢還是怎麼回事？他航行在波濤洶湧的海上，在時間的大海之中，他聽到了梭倫的喊聲，用的是外國語言但卻又能聽得懂。這聲音喊出了丹麥的那競選名言：「以法立國！」人類的智慧之神，來到了這貧寒的屋裡。他把身子彎向了床，在孩子的面頰上吻了一下：「在榮譽中保持堅強，在生活的鬥爭中保持堅強！把真理放在胸中，飛向真理之鄉！」哥哥還沒有上床，他站在窗前，望著草地上升起的霧靄。那不是山精姑娘在跳舞，一位老年真誠的幫工千真萬確對他講到過山精跳舞。但是他有更聰慧的見解，那是水蒸汽，比空氣還暖，所以它們便升了起來。有一顆流星閃光滑過，這孩子的思想一下子便從地面上的霧靄高高地飛到那閃光體上去了。天空中星星在閃動，就好像有金線從星星上垂到我們的地面上一樣。「隨我去翱翔吧！」這聲音一直傳到了這孩子的心中。人類的偉大的智慧之神，用比鳥、比箭、比世界上任何能飛的東西都要快的速度，把他一下子帶到了太空之中，帶到了一顆顆星用發出的光把各天體綁在一起的地方。我們的地球在稀薄的空氣中轉動，一個個城市好像都靠得很近。有一個聲音穿過了各天體響了起來：「偉大的精神智慧之神把你托起的時候，什麼是近，什麼是遠？」小孩又站到了窗前，朝外望去，弟弟躺在床上。母親叫著他們的名字：「安諾斯和漢斯·克里斯欽！」丹麥知道他們，世界知道這兩兄弟——奧斯特。",
    "qas": [
      {
        "query_id": "18_0",
        "query_text": "誰完全專注於書籍?",
        "answers": ["弟弟"]
      }
    ]
  },
  {
    "context_id": 19,
    "context_text": "一天，一家人和一個來訪的好友坐在桌子旁吃午飯，吃著吃著，鐘聲敲響了十二點，這時客人看到門打開了，進來了一個孩子，他穿著白夾克，臉色有點蒼白。他不看四周，也不說一句話，就徑直走進了隔壁的房間。不久他又出來了，同樣一言不發地走了出去。第二天和第三天，他照樣又來了。客人問這父親每天走進隔壁房間的那漂亮的孩子是誰？父親說：“沒有看見。也不知道這是誰家的孩子。”第二天，那孩子又進來了，客人指著給父親看，但他看不見，母親和小孩一樣也看不見。於是客人站了起來，走到房門旁，開了一條縫，往裡瞅了瞅。他看那男孩正坐在地上，用手指頭使勁地在地板縫裡挖呀挖的，當他看見客人時，就消失了。隨後客人講述了他所看到的一切，並且仔細描述了那孩子的模樣。於是母親知道了說：“啊呀，那是我親愛的孩子，四個星期前死了。”於是他們打開了地板，找到了兩個硬幣，那是一次孩子向母親討來準備給窮人的。也許小孩那時想：“我可以用它為自己買塊餅乾。”於是就私自留下了錢，藏在了地板縫裡。因為他在墳墓中不得安寧，所以每天中午來找那兩枚錢。後來父母把那錢給了個窮人，從此以後就再也看不見那小孩了。",
    "qas": [
      {
        "query_id": "19_0",
        "query_text": "父母把錢給了誰?",
        "answers": ["窮人"]
      }
    ]
  },
  {
    "context_id": 20,
    "context_text": "在基督誕生前的三百年時，一位母親生了十二個兒子。可她是那樣的貧困潦倒，不知如何來養活這些兒子。她天天向上帝祈禱，請他施恩，讓她所有的兒子能和那預言要降臨人間的救世主在一起。當她生活越來越窘困時，她就把兒子一個個從身邊打發出去找活路。老大叫彼得，他已出門走了一整天，走了很遠的路，最後進入了一片大森林。他想找一條出去的路，卻再也找不著，反而越迷越深。加之他非常饑餓，幾乎都站不起來了，他實在太虛弱了，只得躺下來，並深信死神就在咫尺了。突然從他身邊冒出了個小男孩，渾身上下閃著光，像天使一樣和善。孩子拍了拍手，彼得只得抬起頭望著他。只聽小孩問道：“你為什麼這般絕望地坐在這裡？”“唉！”彼得答道，“我正四處流浪，想找條活路，希望能見到那即將降臨人間的救世主，那也是我最大的心願。”孩子說：“那就跟我來吧！你的願望會滿足的。”他拉著可憐的彼得的手，領著他穿過懸崖，來到一個山洞前。他們走進了山洞，裡面全是金銀水晶，一切都在閃閃發光。在洞的正中央有十二個搖籃挨個兒排放著。小天使說：“躺到第一個搖籃裡睡一會兒，我會搖你入睡的。”彼得照做了，天使邊唱歌邊輕輕晃動他著，最後搖他進入了夢鄉。當他睡熟時，老二也被他的保護天使領來了，他也像哥哥一樣被搖著進了夢鄉；接著其他兄弟一個接著一個都來了，直到最後十二個兄弟都躺在金色的搖籃裡睡著了。他們睡啊，睡啊，一直到三百年後的最後一個晚上，救世主降臨了，那時他們醒了，最終和救世主在一起，成了人們所說的耶穌的十二門徒。",
    "qas": [
      {
        "query_id": "20_0",
        "query_text": "三百年後的最後一個晚上誰降臨了?",
        "answers": ["救世主"]
      }
    ]
  },
  {
    "context_id": 21,
    "context_text": "從前，有個裁縫總愛吵架。他的妻子善良、勤勞、虔誠，卻不能得到他的歡心。無論她幹什麼事，他都不滿意，總是嘀嘀咕咕，又是打又是罵。當地的官府最後知道了這件事，就傳訊了他並把他關進了監獄，希望能讓他改過自新。他在監獄裡只能靠麵包和水度日，關了一段時間後，他就被釋放了，不過要他發誓從此不再打老婆，要與她和睦相處，休戚與共，像夫妻應該的那樣。開始一陣子還好，隨後他又舊病復發，老愛嘀咕爭吵。因為他不敢打她，便扯抓她的頭髮，女人掙脫了他，逃到外面的院子裡，他就拿著尺和剪刀尾隨其後，四處追趕她，並用尺和剪刀以及其他所能拿到的東西朝她摔去。打著她時，他就哈哈大笑；沒打中時，他就暴跳如雷，百般詛咒。這樣一直鬧到鄰居趕來幫他的妻子，他才罷手。於是裁縫再次被官府傳去，官府叫他想想他說過的話。 “親愛的大人，”他說，“我信守了我的誓言，並沒有打她，而是與她同甘共苦。”法官說，“這怎麼可能？她可是再次嚴厲地控告了你。”“我沒有打她，只是因為看見她怪模怪樣，我想用手去給她理理頭髮，她卻掙脫了我，惡意地跑開了。於是我就匆匆地去趕她，讓她回來做她的事。我把手裡東西向她扔，是作為善意的紀念。可我仍和她同甘共苦呀！因為我每次打她，我高興，她痛苦；如果沒打到她，她就高興，我就難受。”法官對這種回答可不滿意，給了他應得的懲罰。",
    "qas": [
      { "query_id": "21_0", "query_text": "誰總愛吵架?", "answers": ["裁縫"] }
    ]
  },
  {
    "context_id": 22,
    "context_text": "從前，有一個很愛漂亮的國王，一天到晚命令王宮裡的裁縫師，替他做不同式樣的新衣裳。雖然裁縫師們很認真的工作，但是誰也想不出更多新花樣，每天做不同的漂亮衣裳。有一天，裁縫師們把剛做好的新衣，展示給國王看。國王馬上大發脾氣說：「這是新衣嗎？這麼醜？滾，統統給我滾！」國王氣得把裁縫師和新衣，一腳踢得老遠。國王沒有滿意的新衣穿，決定到市街上張貼布告，上面寫著：「如果有人能做出讓國王滿意的新衣，可以得到一大筆獎金。」看到布告的人，一個傳一個，最後全國的裁縫師都很認真的做起國王的新衣來。幾天後，王宮的大門外，排了長長的隊伍，每個裁縫師都帶著自己最滿意的作品，想獲得國王的歡心。「國王，這是用最美麗的中國絲綢做的，穿起來很高貴哦！」「這式樣是最流行的，穿起來最時髦了。」國王一件接一件的試穿，他站在穿衣鏡前面左看右看，然後挑剔的說：「嘖，這麼這麼難看！嘖，這花色好老氣！嘖，腰身太粗了！嘖．．．．」國王一天試穿了幾百件，就是挑不出滿意的。其實並不是衣服難看，而是國王的身材太胖了。有一天，王宮裡來了兩個裁縫師，一高一矮，他們信心十足的說：「我們倆會一種魔法，可以做出世界上最神奇的衣服。」國王聽了，非常高興，急忙問：「那是什麼樣的款式，什麼花色？為什麼是世界上最神奇的衣服？有什麼特別的呢？」矮個兒裁縫師說：「它的顏色比花朵鮮艷、質料比雲彩輕柔，而且款式獨一無二，最特別的是，只有聰明人才看得見它。」「啊！」國王驚訝的瞪圓眼睛說：「那麼，愚笨的人就看不見這衣服囉？」「是啊，所以說它是一件神奇的衣服。」「太好了！」國王高興的說：「只要我穿上那件衣服，就可以分辨我的臣子，哪個是聰明人，哪個是不可信賴的笨蛋。」兩個裁縫師向國王領了一大筆錢，就開始紡紗織布，每天都忙到三更半夜！「我那神奇的衣服，不知做好了沒？」國王越想越心急，忍不住想親自去看看裁縫師織布的情形。可是想了一想，國王又不敢去了，因為他怕萬一看不見那塊布，不就等於告訴大家，我是一個傻瓜國王嗎？我還是派誠實的大臣去看看吧！誠實的大臣奉命去察看裁縫師工作的情形。他心裡也很害怕，萬一看不見布料，不就會被大家嘲笑嗎？大臣在門外緊張得一顆心怦怦跳，不過還是深深吸了一口氣，走進織布房大聲說：「兩位裁縫師，工作得如何了？國王急著想穿神奇的新衣呢！」高個兒裁縫師笑嘻嘻的說：「我們日夜趕工，都快織好了，您看，這布料的顏色和花紋多麼美麗鮮艷啊！」大臣上前一看，咦，織布機上面什麼也沒有！他驚訝的眨眨眼睛，還是空空的。矮個兒裁縫師指著織布機，得意洋洋的說：「大人，您看，是不是很漂亮啊？我想國王一定會滿意的，您說是不是呢？」大臣呆了，他吞吞吐吐半天，才大聲的說：「太．．．．太漂亮了，我都看傻了眼，不知該怎麼讚美了。」大臣不希望被當作傻瓜，所以不停的讚美。矮個兒裁縫師說：「請大人報告國王，說我們很快就會完成了。」大臣馬上趕回王宮回報國王。大臣的心裡好緊張，他不敢說實話，只好假裝看見布料了，不斷的讚美說：「那布料真的很漂亮，顏色鮮艷，花紋精緻，布面平滑，好像會發光呢！我從來沒見過那麼漂亮的布料！」國王開心的笑了，但是說謊的大臣早已嚇出一身的冷汗。過了兩天，國王又等不及了。他又派了一名平日常自誇聰明的臣子，去織布房察看進度。當這名自以為聰明的臣子，看到織布機上面什麼也沒有時，也嚇出了一身冷汗。他不敢承認自己笨，只好不斷讚美：「哇，多麼高貴的布料呀！」臣子回報國王說：「陛下，您真有福氣，能夠穿那種高貴布料做成的衣服，全國人民看了，一定都會讚不絕口的。」國王說：「你能看見那塊布料，證明你的確是個聰明的人，很好很好！」臣子聽國王誇讚他，緊張的一直冒冷汗，因為他並沒看見那件神奇的衣服。國王心裏很開心，因為他想：「那傢伙都能看得見，我一定也能看得見，畢竟我的腦筋比他還聰明許多啊！」國王自信的笑了。國王有了信心以後，就帶著侍衛浩浩蕩蕩的出宮，準備親自去察看裁縫師織布的情形。一群帶路的隨從領先進入織布房通知說：「兩位裁縫師辛苦了，待會兒國王將親自來看你們工作的情形。」兩位裁縫師說：「各位聰明的軍爺，你們先來看看，開開眼界吧！這布料這麼薄，這麼輕，保證你們從來沒有看過。」這群侍衛你看我，我看你，誰也沒看見什麼布料。但是卻沒有人敢承認自己笨，大家都同聲讚美說：「哇，好光滑的料子呀！」國王笑咪咪的走進織布房，睜大眼睛一看，卻嚇得直冒冷汗。他著急的想：「這是怎麼回事？我怎麼看不見呢？難道我真的是個傻瓜？哎呀，這．．．這該怎麼辦呢？」國王打定主意，要假裝看得見布料。國王裝出滿意的笑容，笑呵呵的說：「哈哈哈，這塊布料真是漂亮極了，你們說是不是？」侍衛聽了，也都跟著讚美說：「是呀，好亮，好光滑，從來沒有看過這麼高貴的布料，你們瞧，那紋路多細緻、多精巧呀！」每個人都在誇讚布料好，心裡卻在罵自己，為什麼這麼笨，為什麼就看不見布料呢？國王對兩位裁縫師說：「好極了，你們把布織好後，趕快替我做件衣服。我準備穿著神奇的新衣，到街上遊行一圈，看一看全國的人民中，有多少個聰明人，又有多少個笨蛋？」說完，國王頒給兩位裁縫師最高榮譽勳章，並賞賜了許多袋金幣。兩個裁縫師得到這麼多獎賞，好高興，工作得更加起勁。只見他們忙個不停，從白天到深夜，都不敢休息呢！「終於織好了。現在開始剪裁縫線吧！」兩個裁縫師有模有樣的拿起大剪刀，喀嚓喀嚓的裁剪樣式，接著一針一線的縫起來。他們的手不停的比來比去，非常忙碌。兩人忙了好久，才大大的鬆了一口氣。「唉，累死了，不過終於做好了，相信國王一定會很滿意，我們趕緊送去給國王。」兩位裁縫師捧著新衣去拜見國王。他們得意的說：「陛下，您的新衣做好了，您瞧，這是一件多漂亮的衣服呀！相信穿在您的身上，一定會顯得更年輕英俊，是世界上穿著最高貴的國王。」裁縫師一邊說，一邊將衣服翻來翻去，展示給國王看。國王雖然什麼也看不見，仍然裝出很滿意的表情，誇讚兩位裁縫師說：「嗯，我非常喜歡這個款式，辛苦你們了。」兩位裁縫師高興極了，他們對國王說：「陛下，您身上的衣服實在太醜，快脫下來吧，讓我們替您穿上這件漂亮的新衣吧！」國王聽裁縫師的話，就把身上的衣服，一件件的脫下來，最後只剩下一條內褲。裁縫師比畫著說：「國王，請把手伸進衣袖裡。嗯──剛好合身，不大也不小。」國王只覺得空空的，什麼也摸不到。不過，他仍然站在穿衣鏡前面，左看右瞧，一直誇讚說：「嗯，像羽毛一樣輕盈，穿起來真涼爽，你們的手藝的確高超，我要好好賞賜你們。」他又賞賜裁縫師許多錢。國王召喚眾臣來，問大家說：「怎樣，我這件衣服是不是真的很好看？」臣子們愣了一下，就同聲讚美說：「哇，好高貴的衣服呀！陛下您穿起來真是合適。」大家口裡讚美著，表情卻都怪怪的。國王穿著新衣，得意洋洋的走出王宮，到街上遊行。國王一邊走，一邊望向兩旁的人群，心想：「我這件衣服是給聰明人看的，不聰明的人就看不見，不知道這群人當中，有多少人看得見呢？這件衣服真是神奇。」其實每個人所看見的，是一個脫得光光，只剩下一條內褲的國王。但是沒有人敢說出來，因為誰也不願意承認自己是個笨蛋呀！就在這個時候，一個小男孩從人群中跑出來，指著國王哈哈大笑說：「哈哈哈！國王沒穿衣服，差差臉！」接著他指著國王的肚子說：「哇，你的肚子好大哦，你不穿衣服，不怕感冒嗎？」路旁的人群聽到小男孩的笑聲，忍不住也跟著笑成一團，大家都覺得好滑稽。「糟了，我上當了，根本沒有新衣嘛！太丟臉了。」國王拉著小男孩的手匆匆跑回王宮。路邊的群眾都擔心小男孩會不會被國王處死。沒想到，國王不但沒有處罰小男孩，還賞賜他許多禮物，並且誇讚他說：「你是個誠實的孩子，全國只有你對我說實話，讓我明白自己是個被人愚弄的傻瓜國王。」國王經過這次教訓以後，決心做個勤政愛民的好國王，不再愛穿漂亮的新衣了。",
    "qas": [
      {
        "query_id": "22_0",
        "query_text": "誰穿著新衣，得意洋洋的走出王宮?",
        "answers": ["國王"]
      }
    ]
  },
  {
    "context_id": 23,
    "context_text": "冬天沉重的腳步漸漸走遠，春天輕巧的悄悄降臨，山上的雪漸漸消融，大地一片回春景象，但空氣中依然瀰漫一股寒意。草原犬鼠阿土一大清早就起來工作，牠從清晨開眼到深夜閤眼，只有不間斷地工作，別的草原犬鼠笑牠「勞碌命」，阿土總會回以靦腆的微笑，因為牠知道時間不多了！隨著草原上冒出一個個小土丘，好像為青草地上戴上一頂頂土黃色的帽子，阿土已經將牠的地下聯絡通道挖了十之八九，再過1、2天就要大功告成了。天氣漸漸轉熱，冬眠的動物們紛紛從睡夢中醒來。其他好吃懶做的草原犬鼠雖然不會冬眠，卻也一個個猛打哈欠，肚子餓得發昏，正要外出覓食，突然外面一陣騷動，先是從天而降的老鷹捉走了幾位還在昏睡的同伴；接著地面的郊狼也聞風前來，又叼走了幾隻大意的同伴；其他則四處亂竄，倉皇躲入久未梳理的淺洞，這時從遠處又有一隻雙眼發亮的大青蛇尾隨而來。就在大伙兒不知所措的時候，阿土發現同伴有難，也顧不得自身安危，立刻發出草原犬鼠特有的「吠叫」聲，想吸引大青蛇注意。大青蛇發現獵物主動上門，內心竊喜，立刻追了過去，在草地上輕巧滑過，彷彿不留一點痕跡。阿土立刻將大青蛇引入牠巧妙設計多時的地底迷宮。大青蛇在洞裡鑽進鑽出，每次都差一點點就逮到阿土。由於阿土完全掌握迷宮方位，大青蛇被引入草根茂密又曲折的深洞，滑溜溜的蛇身也被纏得動彈不得，差點脫不了身，最後嚇得逃走了！阿土救了大家，大家這才了解阿土為什麼平日那麼辛苦的工作，原來就是為了等待敵人來襲時可以全身而退！於是大家就搬進阿土精心設計的地下迷宮，一個安全又舒適的家，再也不用擔心可怕的天敵了！",
    "qas": [
      {
        "query_id": "23_0",
        "query_text": "先是從天而降的什麼捉走了還在昏睡的同伴?",
        "answers": ["老鷹"]
      }
    ]
  },
  {
    "context_id": 24,
    "context_text": "從前有一位母親，她有一個人見人愛、英俊漂亮的兒子。那年他七歲了，她視她的小寶貝為自己的生命，比世上任何東西都珍貴。但是天有不測風雲，他忽然病了，而且病入膏肓，上帝將他召喚了去。母親悲痛欲絕，日夜哭泣。時過不久，孩子下葬了，可是夜裡他又會出現在生前玩耍的地方，陪著母親一同哭泣，到了早晨則又消失了。母親非常悲傷，每時每刻都在不停地哭。一天夜裡他身著一件入葬就穿著的白色小壽衣，頭上戴著一頂花環來到床前，站在母親的腳旁說：“噢，母親，請別哭啦，否則我在墓中無法入睡，因為您的淚水，把我的壽衣都打濕啦。 ”母親聽到後擔起心來，不再流淚了。第二天晚上孩子又來了，手裡舉著一盞小燈，說：“母親，您看看我的壽衣快乾啦，我可以在墓中休息了。”從此，母親把悲痛交給了上帝，自己默默地承受了心中的創傷。",
    "qas": [
      {
        "query_id": "24_0",
        "query_text": "第二天晚上，孩子手裡舉著一盞什麼?",
        "answers": ["小燈"]
      }
    ]
  },
  {
    "context_id": 25,
    "context_text": "從前，一個生活貧窮、心地虔誠的農夫死了，來到了天堂的門前。同時來的還有一位生前富甲一方的大財主，他也想進天堂。聖彼得拎著鑰匙來了，他打開了大門讓進了財主，似乎沒有看見農夫，就把門隨手關上了。這時外面的農夫聽到了財主如何受到各種各樣的禮遇和接待，那兒既有奏樂，又有歌唱，最後一切又歸於平靜了。聖彼得又來了，打開了門，讓農夫進去了。農夫原想他進去後也會有奏樂和歌唱，可裡面竟是靜悄悄的一片。不過他還是受到了很熱情的接待，天使們走來歡迎他，只是沒有誰來唱歌。於是農夫問聖彼得為什麼財主來給他唱歌，而他來卻不一樣，好像天堂和人間一樣，也存在著偏心。聖彼得回答說：“根本不是這回事，你和任何別的人一樣對我們來說都很可愛，也一定會和那富人一樣享受天堂裡每一樂趣，但是像你這樣的窮人每天都有人來到天堂，而像這樣的富人一百年內進天堂的卻只有一個呢！”",
    "qas": [
      {
        "query_id": "25_0",
        "query_text": "什麼一百年內進天堂的卻只有一個?",
        "answers": ["富人"]
      }
    ]
  },
  {
    "context_id": 26,
    "context_text": "從前有兄妹兩人在井邊玩耍，不小心掉進了井裡。下面住著一個女水妖，把他們抓了去，說：“現在你們可是在我的手裡了，替我好好幹活吧！”她給小姑娘一把亂糟糟的髒亞麻要她紡，給她一個漏了的水桶要她打水；男孩子則被迫去砍伐木頭，可斧子是鈍的，根本砍不動樹。至於吃的，除了像石頭一般硬的面疙瘩就再也沒有別的了。孩子們忍無可忍，在一個星期天，趁水妖上教堂的工夫，兄妹倆悄悄地溜走了。水妖從教堂回來，發現小鳥們飛走了，撒腿就追。遠遠看到水妖追來，姑娘便朝身後扔了一把刷子，刷子頓時變成了一座長滿荊棘的大山，水妖只好艱難地往上爬，終於爬過來了。孩子們一看不好，男孩又扔出一把梳子，那梳子頓時變成成千上萬顆牙齒，可是水妖還是穩穩當當地跨過來了。小姑娘又扔了一塊鏡子，鏡子變成一座光滑的山峰，任水妖怎麼爬也難以爬上來。水妖想：“還是快些回家象把斧子來把這玻璃山砍成兩半吧。”可是等她取來斧子把玻璃山砍開時，小兄妹早已逃得遠遠的了。女水妖只好又回到井裡去了。",
    "qas": [
      {
        "query_id": "26_0",
        "query_text": "男孩子被迫去砍伐什麼?",
        "answers": ["木頭"]
      }
    ]
  },
  {
    "context_id": 27,
    "context_text": "一個裁縫和一個金匠一起外出旅行。一天傍晚太陽下山後，他們聽到遠處傳來了歌聲，而且聲音越來越清晰。樂聲很怪但又如此悅耳，以致他們忘記了疲勞，趕緊向前走去。月亮升起時，他們走到了山頂，在那兒看到一大幫個子矮小的男男女女手拉手兒圍著圈，在盡情跳舞。他們唱的歌非常動聽，剛才兩人聽到的就是這歌聲。在那些人中間坐著一位長者，他比其他人都要高，身穿一件雜色外套，花白的鬍子垂至胸前。那兩個人還站在那兒，滿臉驚訝地看著他們跳舞呢，老人示意他們加入，那些小人們也熱心地散開了一個口子。那個金匠背上有個瘤，就像所有的駝背一樣，他大膽地加入了跳舞者的圈子，而裁縫開始還有些害怕，想退縮，但他看到所有人都玩得那樣開心，便也鼓起勇氣加入了他們的行列。舞圈馬上又合攏了，小人們又繼續載歌載舞，歡樂無比。只見那位老者從腰間抽出把大刀，把刀磨得鋒利無比，既而把目光轉向了兩位陌生人。他們都嚇壞了，他倆還沒來得及思索，就見老人抓住了金匠，以迅雷不及掩耳之速把他的頭髮和鬍子給剃得個精光，裁縫同樣也未能逃脫此劫。等完事後，兩人又馬上感到恐懼蕩然無存了。因為老人友好地拍了拍他倆的肩膀，奇怪的是，他倆覺得是自願地讓老人把頭髮剃下來的，毫無反抗。他指了指堆在一邊的煤堆，示意他倆用煤渣填滿口袋，雖然他倆不知道這些東西對他們有什麼用，二話沒說便照著老人說的去做了。接著他們就動身去找一間過夜的小屋，當他們到達山谷時，附近僧院的鐘聲剛剛響過十二點，人們都停止了歌唱。過了一會兒一切都結束了，這座山在月光下顯得幽寂而靜謐。兩個旅行者找到一家小酒店，躺在了草墊床上，用大衣蓋住了身體，他們畢竟太累了，忘了把煤塊拿出來，沉重的負擔把他倆早早地壓醒了。他們把手伸進口袋，簡直不能相信自己的眼睛，袋裡裝的不是煤塊，而是金子。更可喜的是，他倆的頭髮、鬍子變得又長又濃又密，和以前沒有什麼兩樣了。現在他倆都成了有錢的人，但是那位金匠由於貪婪成性，順便多裝了些煤塊，自然比裁縫富得多了。貪婪的人即使擁有很多，希望得到的也越多。所以金匠建議他倆多呆一天，晚上再出去到老人那兒，以便得到更多的金銀財寶。裁縫沒有答應，他說：“我知足了，現在我將成為一個財主，娶一個我心愛的戀人，而且我也是個幸福的人。”但為了朋友，他決定多呆一天。為了能裝回更多財寶，當晚金匠肩上揹著許多大包，樂滋滋地上了路。正如前天晚上一樣，他發現小人們又在唱歌跳舞，老人又給他剃了個光頭，讓他帶走一些煤塊。他毫不猶豫地把包裝得滿滿的，滿心喜悅地走回來，身上全是大包小包。 “即使金子背起來很重，”他說，“我也能承受。”最後他甜甜地進入了夢鄉，夢見自己清晨醒來變成了一個大富翁。當他睜開雙眼伸手來摸口袋時，發現自己什麼也沒摸到，只摸到一些黑煤塊，不禁驚訝萬分。 “前天晚上我得到的那些金子一定還在那兒。”他心想，然後把那個口袋拿了出來，結果驚奇的發現它們也變成了煤塊。他又用又黑又髒的手摸了摸前額，突然發現他的整個腦袋又禿又平，長鬍子的地方也同樣如此。但是他的噩運還沒完，他突然注意到他胸部也長出了一塊和背上一樣大的東西。那時他才意識到這一切都是對他貪婪成性的懲罰，便開始大哭起來。哭聲一下把好心的裁縫給鬧醒了，裁縫馬上安慰那個可憐的人，並說：“旅行時咱們一直結伴而行，你應當和我一起分享我的財產。”他許下了諾言，但那個可憐的金匠不得不帶著兩個腫塊度過餘生，並不時用帽子遮住他那光光的腦袋。",
    "qas": [
      {
        "query_id": "27_0",
        "query_text": "金匠的背上有什麼?",
        "answers": ["瘤"]
      }
    ]
  },
  {
    "context_id": 28,
    "context_text": "窗子上有一株綠玫瑰花。不久以前它還是一副青春煥發的樣子，但是現在它卻現出了病容，在害某種病。它身上有一批客人在一口一口地把它吃掉。要不是因為這個緣故，這一群穿著綠制服的朋友們倒是蠻好看的。我和這些客人中的一位談過話。他的年紀還不過三天，但是已經是一個老爺爺了。你知道他講過什麼話嗎？他講的全是真話。他講著關于他自己和這一群朋友的事情。「我們是世界生物中一個最了不起的隊伍。在溫暖的季節里，我們生出活潑的小孩子。天氣非常好；我們立刻就訂了婚，馬上舉行婚禮。天氣冷的時候，我們就生起蛋來。小家伙在那里面睡得才舒服哩。最聰明的動物是螞蟻。我們非常尊敬他們。他們研究和打量我們，但是並不馬上把我們吃掉，而是把我們的蛋搬走，放在他們家族的共同蟻窟里的最低的一層樓上，同時在我們身上打下標記和號數，把我們一個挨著一個地、一層堆上一層地排好，以便每天能有一個新的生物從蛋里孵出來；然後就把我們關進柵欄里，捏著我們的後腿，擠出我們的奶，直到我們死去為止。這可是痛快啦！他們送我們一個最好聽的稱號：甜蜜的小奶牛！一切具有螞蟻這種知識的動物都叫我們這個名字。只有人是例外——這對我們是一種極大的侮辱，氣得我們完全失去了甜蜜性。」你能不能寫點文章來反對這事兒，叫這些人能懂得一點道理呢？他們那樣傻氣地望著我們，繃著臉，用那樣生氣的眼光望著我們，而這只不過是因為我們把玫瑰葉子吃掉了；但是他們自己卻吃掉一切活的東西，一切綠色的和會生長的東西。他們替我們起些最下賤的、最丑惡的名字。噢，那真使我作嘔！我說不出口，最低限度在穿著制服時說不出口，而我是永遠穿著制服的。”我是在一個玫瑰樹的葉子上出生的。我和整個隊伍全靠玫瑰葉子過活，但是玫瑰葉子卻在我們身體里面活著——我們屬于高一等的動物。人類憎恨我們，他們拿肥皂泡來殲滅我們；這種東西的味道真難受！我想我聞到過它！你並不是為洗滌而生下來的，因此被洗滌一番真是可怕！「人啊！你用嚴厲和肥皂泡的眼光來看我們；請你想想我們在大自然中的地位，以及我們生蛋和養孩子的天才的機能吧！我們得到祝福：願你們生長和繁殖！我們生在玫瑰花里，我們死在玫瑰花里；我們整個一生是一首詩。請你不要把那種最可怕的、最丑惡的名字加到我們身上來吧——我們說不出口，也叫不出來的那種名字！請把我們叫做螞蟻的奶牛、玫瑰樹的隊伍、小小的綠東西吧！」我作為一個人站在一旁，望著這株玫瑰，望著這些小小的綠東西——他們的名字我不願意喊出來；也不願意侮辱一個玫瑰中的公民，一個有許多卵子和小孩的大家族。本來我是帶著肥皂水和惡意來的，打算噴他們一通。現在我打算把這肥皂水吹成泡，然後凝望著它們的美，可能每個泡里面會有一篇童話的。泡越長越大，泛出各種顏色。泡里好像都藏著珍珠。泡浮起來，翱翔著，飛到一扇門上，于是爆裂了。但是這扇門忽然開了！童話媽媽站在門口。是的，那些小小的綠東西——我不說出他們的名字！關于他們的事情，童話媽媽講的要比我好得多。「蚜蟲！」童話媽媽說。「我們對任何東西應該叫出它正確的名字。如果在一般場合下不敢叫，我們至少可以在童話中叫的。」",
    "qas": [
      {
        "query_id": "28_0",
        "query_text": "最聰明的動物是什麼?",
        "answers": ["螞蟻"]
      }
    ]
  },
  {
    "context_id": 29,
    "context_text": "從前有隻小母雞和一隻小公雞一起上核桃山找食物，它們約定誰先找到果仁就一定要和另一個分享。小母雞首先找到一大塊核桃仁，它一聲不吭，想獨自把牠吃了。然而果仁太大了，卡在它喉嚨裡下不去。它很緊張，唯恐被噎死，於是大叫：“小公雞、小公雞！我求求你快去替我弄些水來，要不我就要噎死了！”小公雞以最快的速度跑到泉水邊，說：“泉水、泉水，請你給我一點水！小母雞被一塊核桃仁噎住了。”泉水說：“先去找新娘要一段紅綢來。”小公雞於是跑到新娘那兒說：“新娘，新娘，請給我一段紅綢子拿去給泉水，它才會給我水。我要拎著水去救躺在核桃山上的小母雞，它被一大塊核桃仁給噎住了。”新娘說：“先去柳樹上把我的花冠取來給我。”小公雞於是跑到柳樹下，從柳枝上取下了花冠交給新娘。新娘這才給了一段紅綢給小公雞，它拿上紅綢趕忙送給泉水，泉水給了它一些水。可是等小公雞帶著水趕來時，小母雞已經躺在那兒一動不動，——噎死了。小公雞悲傷地放聲痛哭，其他動物紛紛出來表示哀悼。六隻小老鼠做了一輛小車用來將小母雞運到墓地去。車做好之後，它們自己套上拉繩，讓公雞駕車。路上，它們遇到一隻狐狸，說：“你上哪兒去呀，小公雞？“我去給小母雞送葬。”“我和你一起去好嗎？”“可以。不過前面坐不下了，坐在後面吧。”狐狸就在後面坐了下來。後來又遇到一隻狼、一頭熊、一頭鹿以及森林裡所有動物，它們都要求一起去。送葬的隊伍來到一條溪水邊。 “怎麼過呀？”小公雞問。溪邊有根乾草說：“讓我把自己橫架在溪水上面吧，你趕著車從我身上過去好了。”可是六隻老鼠剛踏上這座“橋”，乾草就滑到水裡去了，六隻老鼠被淹死了，大家全被困住了。一塊炭過來說：“我夠大吧。你們從我身上過去好了。”說著就將自己橫到溪水上。可剛一碰到水，它就“嘶”地一聲滅了，死了。一塊石頭看到了，很同情小公雞，也想幫助它，於是自己躺到了水裡。小公雞趕著車過了溪，當它再次回來接坐在後面的其他動物時，馬車後退了，結果動物們全落水淹死了，只有小公雞和死去的小母雞留在岸上。小公雞挖了個墓穴，將小母雞埋了，自己則坐在墓塚上悲傷不已，最後它也和大夥兒一樣，死了。",
    "qas": [
      {
        "query_id": "29_0",
        "query_text": "誰做了一輛小車用來將小母雞運到墓地去?",
        "answers": ["小老鼠"]
      }
    ]
  },
  {
    "context_id": 30,
    "context_text": "小白兔原本擁有一雙令人稱羨的水汪汪大眼睛。有一天，小白兔發現河中沙洲的綠地上，長了幾株綠意盎然的紅蘿蔔，但不會游泳的他只能乾瞪眼，摸摸自己「咕嚕咕嚕」叫的肚子，忽然想到一個好主意。小白兔找來同樣肚子餓的小烏龜，二人說好，小烏龜載小白兔過河到沙洲上，小白兔則將摘下的紅蘿蔔葉子與小烏龜分享。小烏龜費了好大一番力氣，才將小白兔馱上沙洲。小白兔一見到鮮紅欲滴的紅蘿蔔，早忘了方才的約定，立刻將拔下來的紅蘿蔔吃光光，連葉子也不放過，並心滿意足地睡了個大覺。等小白兔醒來，要小烏龜載他過河，空肚子等了好久的小烏龜問他紅蘿蔔葉子呢？小白兔才傻笑說不小心被他吃光了，只要先載他過河去，再等幾天，他立刻找新鮮的來還他。小烏龜發現自己上了當，生氣極了，但並不馬上發作。依然將小白兔背在身上，只是將他載往河裡更遠、更荒涼的沙洲上，就游走了，臨走前拋下一句：「再等幾天，等這荒地上長出紅蘿蔔葉子我再來接你囉！」小白兔自作自受，望著好像不曾間斷的河水，哭紅了雙眼卻回不了家。",
    "qas": [
      {
        "query_id": "30_0",
        "query_text": "誰有水汪汪的大眼睛?",
        "answers": ["小白兔"]
      }
    ]
  },
  {
    "context_id": 31,
    "context_text": "從前有個可愛的小姑娘，誰見了都喜歡，但最喜歡她的是她的奶奶，簡直是她要什麼就給她什麼。一次，奶奶送給小姑娘一頂用絲絨做的小紅帽，戴在她的頭上正好合適。從此，姑娘再也不願意戴任何別的帽子，於是大家便叫她“小紅帽”。一天，媽媽對小紅帽說：“來，小紅帽，這裡有一塊蛋糕和一瓶葡萄酒，快給奶奶送去，奶奶生病了，身子很虛弱，吃了這些就會好一些的。趁著現在天還沒有熱，趕緊動身吧。在路上要好好走，不要跑，也不要離開大路，否則你會摔跤的，那樣奶奶就什麼也吃不上了。到奶奶家的時候，別忘了說'早上好'，也不要一進屋就東瞧西瞅。”“我會小心的。”小紅帽對媽媽說，並且還和媽媽拉手作保證。奶奶住在村子外面的森林裡，離小紅帽家有很長一段路。小紅帽剛走進森林就碰到了一條狼。小紅帽不知道狼是壞傢伙，所以一點也不怕它。“你好，小紅帽，”狼說。謝謝你，狼先生。”“小紅帽，這麼早要到哪裡去呀？”“我要到奶奶家去。”“你那圍裙下面有什麼呀？”“蛋糕和葡萄酒。昨天我們家烤了一些蛋糕，可憐的奶奶生了病，要吃一些好東西才能恢復過來。”“你奶奶住在哪裡呀，小紅帽？”進了林子還有一段路呢。她的房子就在三棵大橡樹下，低處圍著核桃樹籬笆。你一定知道的。 ”小紅帽說。狼在心中盤算著：這小東西細皮嫩肉的，味道肯定比那老太婆要好。我要講究一下策略，讓她倆都逃不出我的手心。於是它陪著小紅帽走了一會兒，然後說：“小紅帽，你看周圍這些花多麼美麗啊！幹嘛不回頭看一看呢？還有這些小鳥，它們唱得多麼動聽啊！你大概根本沒有聽到吧？林子裡的一切多麼美好啊，而你卻只管往前走，就像是去上學一樣。”小紅帽抬起頭來，看到陽光在樹木間來回跳蕩，美麗的鮮花在四周開放，便想：“也許我該摘一把鮮花給奶奶，讓她高興高興。現在天色還早，我不會去遲的。”她於是離開大路，走進林子去採花。她每採下一朵花，總覺得前面還有更美麗的花朵，便又向前走去，結果一直走到了林子深處。就在此時，狼卻直接跑到奶奶家，敲了敲門。 “是誰呀？”“是小紅帽。”狼回答，“我給你送蛋糕和葡萄酒來了。快開門哪。”“你拉一下門栓就行了，”奶奶大聲說，“我身上沒有力氣，起不來。”狼剛拉起門栓，那門就開了。狼二話沒說就衝到奶奶的床前，把奶奶吞進了肚子。然後她穿上奶奶的衣服，戴上她的帽子，躺在床上，還拉上了簾子。可這時小紅帽還在跑來跑去地採花。直到采了許多許多，她都拿不了啦，她才想起奶奶，重新上路去奶奶家。看到奶奶家的屋門敞開著，她感到很奇怪。她一走進屋子就有一種異樣的感覺，心中便想：天哪！平常我那麼喜歡來奶奶家，今天怎麼這樣害怕？她大聲叫道：“早上好！”，可是沒有聽到回答。她走到床前拉開簾子，只見奶奶躺在床上，帽子拉得低低的，把臉都遮住了，樣子非常奇怪。“哎，奶奶，”她說，“你的耳朵怎麼這樣大呀？”“為了更好地聽你說話呀，乖乖。”可是奶奶，你的眼睛怎麼這樣大呀？”小紅帽又問。“為了更清楚地看你呀，乖乖。”“奶奶，你的手怎麼這樣大呀？”“可以更好地抱著你呀。”“奶奶，你的嘴巴怎麼大得很嚇人呀？”“可以一口把你吃掉呀！”狼剛把話說完，就從床上跳起來，把小紅帽吞進了肚子，狼滿足了食慾之後便重新躺到床上睡覺，而且鼾聲震天。一位獵人碰巧從屋前走過，心想這老太太鼾打得好響啊！我要進去看看她是不是出什麼事了。獵人進了屋，來到床前時卻發現躺在那裡的竟是狼。 “你這老壞蛋，我找了你這麼久，真沒想到在這裡找到你！”他說。他正準備向狼開槍，突然又想到，這狼很可能把奶奶吞進了肚子，奶奶也許還活著。獵人就沒有開槍，而是操起一把剪刀，動手把呼呼大睡的狼的肚子剪了開來。他剛剪了兩下，就看到了紅色的小帽子。他又剪了兩下，小姑娘便跳了出來，叫道：“真把我嚇壞了！狼肚子裡黑漆漆的。”接著，奶奶也活著出來了，只是有點喘不過氣來。小紅帽趕緊跑去搬來幾塊大石頭，塞進狼的肚子。狼醒來之後想逃走，可是那些石頭太重了，它剛站起來就跌到在地，摔死了。三個人高興極了。獵人剝下狼皮，回家去了；奶奶吃了小紅帽帶來的蛋糕和葡萄酒，精神好多了；而小紅帽卻在想要是媽媽不允許，我一輩子也不獨自離開大路，跑進森林了。",
    "qas": [
      {
        "query_id": "31_0",
        "query_text": "誰把奶奶吞進了肚子?",
        "answers": ["狼"]
      }
    ]
  },
  {
    "context_id": 32,
    "context_text": "小草莓旅行到一座新農場，想找同伴，走著走著，來到「蘋果園」，他看到前方有許多鮮紅欲滴的大蘋果。它問：「我是你的同伴，是不是？」「怎麼是呢？雖然我們都是紅色的，不過我這麼大，你那麼小。」小草莓不氣餒，繼續走，來到「小蕃茄園」，又看到一顆顆紅通通的小蕃茄。「我是你的同伴，是不是？」它又問。「怎麼是呢？雖然我們都是紅色的，不過我這麼光滑細緻，你那麼凹凸不平。」小草莓好傷心，下定決心不想再當草莓了！繼續走著，終於找到他的同伴「草莓園」。他正在猶豫要不要進去，被一隻農場的老母雞發現了，問明原委，老母雞慈祥地說：「怎麼會呢？你看看，農場裡有那麼多紅色水果，當小朋友來採果時，蘋果雖然碩大，卻高高掛在樹上，最難親近；小蕃茄很好採收，反而不受重視，全像沙丁魚擠在一起；就屬你們草莓最高貴，大家都小心翼翼，倍極呵護地將你們一顆顆排列整齊，深怕一個不小心傷著了，所以你們草莓一族可是嬌貴的很呢！」聽完老母雞的話，小草莓開心極了，重新投入草莓園的懷抱，準備迎接快樂的每一天。",
    "qas": [
      {
        "query_id": "32_0",
        "query_text": "小草莓聽誰說完話開心極了?",
        "answers": ["老母雞"]
      }
    ]
  },
  {
    "context_id": 33,
    "context_text": "小象喬治出生在馬戲團中，它的父母也都是馬戲團中的老演員。小象喬治很淘氣，總想到處跑動。工作人員在它腿上拴上一條細鐵鍊，另一頭系在鐵桿上。小喬治對這根鐵鍊很不習慣，它用力去掙，掙不脫，無奈的它只好在鐵鍊範圍內活動。過了幾天，喬治又試著想掙脫鐵鍊，可是還沒能成功，它只好悶悶不樂地老實下來。一次又一次，小喬治總也掙不脫這根鐵鍊。慢慢地，它不再去試了，它習慣了鍊子，再看看父母也是一樣嘛，好像本來就應該是這個樣子。喬治一天天長大了，以它此時的力氣，掙斷那根小鐵鍊簡直不費吹灰之力，可是它從來也想不到這樣做。它認為那根鍊子對它來說，牢不可破，這個強烈的心理暗示早已深深地植入它的記憶中了。一代又一代，馬戲團中的大家們就被一根有形的小鐵鍊和一根無形的大鐵鍊拴著，活動在一個固定的小範圍中。",
    "qas": [
      {
        "query_id": "33_0",
        "query_text": "小象出生在哪裡?",
        "answers": ["馬戲團"]
      }
    ]
  },
  {
    "context_id": 34,
    "context_text": "在寬闊無比的大海域，生活了一群小銀魚，牠們數量龐大，引來不少大魚覬覦，成了大魚們爭相競逐的點心區，雖然損失一些同伴對於為數眾多的牠們來講關係不大，但是每天生活在被獵食的恐慌中，牠們決定改變命運。「我們可以組成一隻大魚，把其他壞魚嚇走！」一隻閃閃發亮的小銀魚提出好建議。於是牠們努力組成一隻附近海域體型最大的魚，只是好像少了什麼？「你可以當我們的眼睛嗎？」一隻小黑魚游過去，小銀魚們懇請他幫忙，同樣活在被獵食的陰影裡，小黑魚一口答應。可是黑眼睛太過平和，在幽暗的海裡發揮不了作用，又有一隻小紅魚游過去。「你可以當我們忿怒時的眼睛嗎？」小紅魚剛從大魚口中逃生，也十分痛恨大吃小的宿命，決定反擊，也爽快答應了。於是海裡出現了一隻黑眼睛的大銀魚，全身閃閃發光，當其他大魚靠近時，立刻翻出紅色的憤怒大眼，嚇得大魚們爭相走告，說這片海域來了一隻可怕的大銀魚，生氣時眼睛會放出紅色光芒，好像要吞噬所有看得到的獵物一般！聰明的小銀魚們充分發揮團隊合作的精神，終於讓這片海域再度恢復往日的平靜。",
    "qas": [
      {
        "query_id": "34_0",
        "query_text": "誰剛從大魚口中逃生?",
        "answers": ["小紅魚"]
      }
    ]
  },
  {
    "context_id": 35,
    "context_text": "碧綠的湖面，倒映著天上的朵朵白雲，這座湖泊，美得像顆發亮的寶石。在蘆葦叢的層層掩護下，成為一座天然的食物寶庫。湖面寬廣，魚蝦成群，是雁類兼具嬉戲與覓食的天堂。可惜冬天一到，湖面結冰，蘆葦乾枯，荒涼得像地獄一樣。小雁不敢再想下去，看著其他同伴辛苦的練習飛翔，自己也好想加入，只是天生的短翅缺陷，讓牠飛不高也飛不遠，冬天似乎成了自己生命燭光的燃燒盡頭。但小雁並不氣餒，經過仔細觀察環境與認真思考後，心中打定主意，與其飛行中途落單在遙遠的異鄉，不如想辦法在熟悉的地方生存下來。只是冬天無情，不容許犯下絲毫錯誤，必須做好萬全準備。首先看到一望無際的蘆葦，小雁將蘆葦條一一折彎，晒乾，套疊成一個有蓋的大窩，這樣就可以安然度過寒冷的冬天。接下來，如果冬天湖面結了冰，食物來源就會中斷，於是小雁將捉到的小魚晒成乾，貯藏在蘆葦叢裡，勉強成為過冬的乾糧。最後，由於冬天整個湖面都會結冰，雁類的天敵——狐狸，就會踩著堅硬的湖面四處覓食。小雁先用蘆葦做成一隻假雁，故意讓狐狸捉錯，這樣聰明的狐狸就不會上第二次當，就能達到躲避天敵的效果。小雁的方法果然一一奏效，千盼萬盼，冬天的腳步終於離開了，湖面也一天天溫暖起來，小雁的朋友回來了，訝異小雁竟然能安然度過冬天，這是從來沒聽說過的事，都很佩服小雁的智慧，當然，也肯定了小雁所做的正確選擇。◇",
    "qas": [
      {
        "query_id": "35_0",
        "query_text": "小雁用什麼做成一隻假雁?",
        "answers": ["蘆葦"]
      }
    ]
  },
  {
    "context_id": 36,
    "context_text": "小羽出生在一個燕子大家庭，個個都是飛行高手，尤其具備長途飛行的能力，在小鎮裡是郵差工作的不二人選；不過小羽天生翅膀無法完全張開，所以只能做短距離飛行，不能從事送信的工作，這讓牠非常沮喪。小羽有一項天生才能，只要聽到音樂，就能翩然起舞，即使沒聽過旋律，也能搭配得天衣無縫，可惜這項才能被埋沒了。有一天，小鎮來了一個馬戲團，是遠近馳名的「快樂鳥馬戲團」，小羽好期待去觀賞，不過牠沒有多餘的錢買票，正在售票口徘徊時，被一位雙目炯炯發亮的老鷹先生看到了。「年輕人，你是不是小鎮有名的燕子家族成員？我是這個馬戲團的團長，想向你打聽一個人，不知道可不可以？你認識愛跳舞的小羽嗎？」小羽不敢相信自己的耳朵，原來這位赫赫有名的馬戲團團長正要找牠。「我聽說牠很會跳舞，我們團裡正好缺一名舞者，我想當面問牠要不要加入我們，一起到世界各地巡迴表演呢？」這個突來的天大消息嚇得小羽久久說不出話來，等情緒平復後，才表明身分，並向團長報告要父母同意才行。「沒關係，我這裡有3張貴賓票送給你，記得帶你的父母一起來看表演喔！」當天晚上熱鬧非凡，小羽帶著父母親，看到這群特別的馬戲團員，有不會游泳的企鵝，卻踢了一腳好足球；有不會唱歌的鸚鵡，卻是跳繩高手；還有不會跑步的駝鳥，竟是矯健的空中飛人。表演結束後，老鷹團長對著小羽的父母親說：「天生我材必有用，命運收走你一樣才能，卻會還給你另一樣，我的團員就是最好的證明，所以千萬不要小看自己喔！」小羽就在團長的鼓勵與父母親的祝福下，以優雅的身段，曼妙的舞姿，超越飛行能力，成為家喻戶曉的燕子舞蹈表演家。",
    "qas": [
      { "query_id": "36_0", "query_text": "誰是跳繩高手?", "answers": ["鸚鵡"] }
    ]
  },
  {
    "context_id": 37,
    "context_text": "從前，有個牧羊人急於想娶個老婆。他一下子認識了三姐妹，發現各個貌美，哪個也不差。這下他可為難了，一時不知該選哪一個好。他只好去問他母親，母親說：“請她們三個一塊兒來我們家，在她們面前擺些奶餅，看看她們怎麼個吃法”，年輕人照做了。第一個連皮把奶餅一口吞了下去；第二個想先削皮，但一時匆忙，削去的皮上還留有許多奶酪，就把它給扔了；第三個去皮時很仔細，切得不多也不少。牧羊人把這一切都看在眼裡，然後告訴了他母親，母親說：“就挑第三個做你的媳婦吧！”牧羊人照辦了，從此他倆過著幸福美滿的生活。",
    "qas": [
      {
        "query_id": "37_0",
        "query_text": "誰想娶個老婆?",
        "answers": ["牧羊人"]
      }
    ]
  },
  {
    "context_id": 38,
    "context_text": "從前有個人，他孩子太多，已經請過世界上所有的人當孩子們的教父了。可又有個孩子即將出世，顯然沒人可請了，他不知道如何是好，只好疲憊地躺下睡了。夢中他夢見自己出了門，請遇到的第一個人當孩子的教父。醒來時他決定照夢中的指點辦，因而出了大門，在那兒碰到一個陌生人，於是請他當教父。很多年後，教父送給教子一杯水，告訴他：“這是杯神水，可以治好任何人的病。不過你要看清死神站在病人的哪一頭，如果站在病人頭前，給病人喝點這種水，他就會痊癒；如果他站在病人腳後，一切努力都將白費，他必死無疑。”從此，教子就能判斷病人是否有救，並因此出了名，也掙了大錢。有一次國王請他去給他孩子治病，他看到死神站在孩子頭前，就用神水治好了孩子的病；第二次也是這樣。第三次死神站到了孩子腳邊，他便知道孩子非死不可了。有一次他想見見這位教父，告訴他自己用神水取得的成就。當他來到教父家時，看到了世界上最古怪的事：掃把和鐵鍬在頭一段樓梯上吵架，並且猛打對方。他問它們：“教父住在哪兒？”掃把回答說：“在很多樓梯上面。”他上到第二段樓梯，看到一堆死手指。他問它們：“教父住在哪兒？”其中一個手指回答說：“再上一層樓。”三樓是一堆死人頭，它們也說教父住在上面一層。他在四樓看到各種各樣的魚在火上烤著，它們也說再上一層樓。他來到五樓，看到有扇門，就從鎖孔往裡看，結果看到了長著兩隻長長的犄角的教父。他推開門走了進去，教父急忙躺到床上，用被子把自己蓋上。這人說：“教父先生，您的房子多奇怪呀！我在一樓看到掃把和鐵鍬又吵又打。”“你多愚蠢呀！”教父說：“那是一個小伙子和一個姑娘在說話呢！”“可我在二樓看到很多死人的手指頭。”“唉，你真笨！那是一些樹根。”“三樓上有一堆死人頭呢。”“傻瓜！那些是卷心菜。”“我在四樓看到各種各樣的魚在鍋裡燒得絲絲作響。”正說著那些魚自己走來送給教父了。“我從鎖孔往裡看的時候，我看到你有兩隻長長的犄角。”“噢！不可能！”小伙子警惕起來，趕忙跑了出來。如果不是那樣，還不知道教父會把他怎麼樣呢！",
    "qas": [
      {
        "query_id": "38_0",
        "query_text": "教父家三樓有什麼?",
        "answers": ["死人頭"]
      }
    ]
  },
  {
    "context_id": 39,
    "context_text": "令人期待的暑假終於開始了！個性溫和的小玲，邀請好朋友小英到她家玩，小玲都會隨手把玩過的玩具、用過的文具等物品收好，脾氣暴躁的小英則玩一樣、丟一樣，還呵欠連連地抱怨：「好無聊的暑假呵！」「真的嗎？」一種令人聽了就會飄飄然的悅耳聲音，從小玲整齊的書桌傳來：「我是文具小天使，你們想不想到文具王國看看啊？」一個全身由文具組成的「卡哇伊」小天使出現了，在窗戶邊還散發出閃亮的天使光芒。「好呀！好呀！可是怎麼去呢？」小英毫不考慮就答應了。「看我的……」文具小天使揮動尺做的四片翅膀，轉動烏溜溜的眼睛。小玲與小英突然眼前一亮，耳邊出現呼呼風聲，不一會兒，就到達目的地了。「歡迎來到文具王國，這裡有玩不完的文具遊戲，還有拿不完的獎品，不過你首先要通過三關考驗，開始吧，GO！GO！GO！」「那第一關是什麼？」「把鉛筆送回家！」「啊？這是什麼簡單的關？」小英一邊嘮叨，一邊把鉛筆依顏色排好，但那些鉛筆好像有生命一般，小英的手一靠近，就自動躲開，好像怕極了她似的！「我來試試！」小玲細心、輕柔地安撫，一枝枝鉛筆馬上變成一隻隻聽話的小狗，三兩下子就排好了！「第二關是繪圖區，請先找出要著色的蠟筆，再把人物的臉畫好就行了！」「那簡單，紅蠟筆，還愣在那裡幹什麼，快給我過來！還有你，黃蠟筆、藍蠟筆……」小英大呼小叫著，結果蠟筆不是躲著她，就是心不甘情不願地被她使用，但實在不甘心，又偷偷補上幾筆，所以畫好後就成了一張「大花臉」！「什麼嘛！難看死了，我不畫了！」「我來試試！」小玲先將筆分類，從紅、橙、黃……一路分下去，再輕巧的使用那些蠟筆；而那些蠟筆也彷彿有了靈性，爭先恐後排隊等著發揮最佳色彩，完成後人物的臉不僅容光煥發，簡直像真人一般。「最後一關是什麼？快說！」小英彷彿命令的語氣，令文具小天使皺了皺眉頭，不過祂並沒有生氣，還是笑嘻嘻地說：「這一關你應該會喜歡，就是橡皮擦保齡球。」一顆顆橡皮擦做的保齡球瓶，被整齊地排列在固定位置上，等待被比賽者擊出「全倒」！累積了前二關的悶氣，小英心急地想大展身手，大叫一聲，以增加氣勢。接著她用盡全身力氣，將彈珠做的保齡球擲了出去，心想：「一定可以全倒！」哪知球被她這一叫，嚇飛了魂，竟然像喝醉似地「洗溝」去了！小英不太高興地再次用力將球拋了出去，所有橡皮擦球瓶似乎害怕被打到，紛紛躲開。小英一把火上來，立刻上前想要用手直接推倒這些不聽話的瓶子，突然間，她覺得四周景物怎麼變大了，再仔細一看，不得了，原來是自己變小了！「救命呀！我……怎麼變成橡皮擦球瓶了？」文具小天使高舉手裡的保齡球，用剛才小英一模一樣的動作，使勁全力朝前方擲了過去，四周的瓶子四處躲避，小英想移動身體，卻一點也動彈不得，眼看巨球朝自己眼前轟了過來，嚇得大叫：「我再也不敢了！」小英抬起頭來，原來自己玩累了，趴在小玲的書桌上睡著了！看著小玲整整齊齊地將文具用品擺放妥當，想起自己如同垃圾堆的書桌，還是趕快告辭回家，好好整理一下自己的書桌吧！",
    "qas": [
      {
        "query_id": "39_0",
        "query_text": "第一關是把什麼送回家?",
        "answers": ["鉛筆"]
      }
    ]
  },
  {
    "context_id": 40,
    "context_text": "北風與太陽的第一回合比賽，對象是旅人，太陽勝出。北風不服氣，有一天又來找太陽理論，準備討回顏面。「我說太陽啊！上次是不小心輸給你，這次對象換我挑，你敢接受挑戰嗎？」「行，行，有本事放馬過來，我會讓你輸得心服口服！」北風看到河邊有個捕魚的人，就向太陽下戰帖，誰讓他趕快工作完回家誰就勝出。太陽先出手，使出渾身解數，彷彿將大地當成披薩餅皮，要一吋一吋烤熟一般。漁夫熱得全身發燙，立刻放下手邊工作，竟然到一旁的大樹下涼快去了！「哼，有本事換你！」北風難掩嘴角的笑意，一下子就風起雲湧，岸邊浪花漸大，漁夫不解地搔了搔頭，今天的天氣怎麼這麼怪，一會兒大太陽使人發暈，一會兒起大風好像要下雨，於是趕緊加快手邊捕魚的工作，不一會兒，就捕完滿滿一簍筐的魚，高高興興地回家了！第二回合北風扳回顏面。太陽不服氣，北風也不甘示弱，兩人各勝一場，只能算是平手，還要再比。他們認為先前所選的對象有偏袒一方的嫌疑，於是相中一位在地上玩耍的小娃娃，小娃娃做事全憑直覺，誰也占不到便宜，輸贏就看誰能讓他睡著。這次換北風先出手。北風用盡全身力氣，想把小娃娃吹進家門，好回家睡覺；但小娃娃見風大好玩，竟然笑咯咯地跳起舞來，讓北風舉白旗投降。太陽得意地散發光與熱，小娃娃熱得沒處躲，竟然鑽到雞籠裡，與小雞們玩了起來！正要宣布又平手時，月姑娘看不下去，從烏雲縫裡鑽了出來，笑著說：「二位先生省點力氣吧！想用蠻力贏得勝利，就像叫大力士做針線活一樣，無濟於事，讓我來吧！如果我贏了，你們可要停止這種無聊的遊戲喔！」北風與太陽聽完，同時點點頭，心想月姑娘年紀輕輕的，能有什麼能耐呢？存著看好戲的心情爽快答應了！只見月姑娘不慌不忙地面帶微笑，輕輕哼起歌來。起初很大聲，立刻吸引住小娃娃的目光，爬出雞籠，側耳傾聽，好像是媽媽唱的催眠曲。後來聲音漸漸變小，不知不覺中，小娃娃眼皮漸漸沉重，最後趴在石頭上睡著了。月姑娘用巧手柔柔地摘下一小片雲衣，輕輕覆蓋在小娃娃身上。小娃娃睡得好甜，連嘴角吹出的泡泡都洋溢著幸福色彩，也讓北風與太陽的暴戾之氣，逐漸消融在清柔的夜色中。",
    "qas": [
      {
        "query_id": "40_0",
        "query_text": "第一回合比賽是誰勝出?",
        "answers": ["太陽"]
      }
    ]
  },
  {
    "context_id": 41,
    "context_text": "從前，有位窮女人，她有一個兒子。這兒子總想出去旅行，母親說：“你怎樣去旅行呢？我們沒有一點錢能讓你路上用。”兒子說：“我會自己想辦法的。我會說：不多，不多，不多。”他就是這樣走了好些日子，嘴裡總是“不多，不多，不多”地說個不停。一次他打一群漁夫那兒經過，說：“願上帝保佑你們！不多，不多，不多。”“你說什麼來著，鄉巴佬，‘不多’？”說著他們拖起網來，打著的魚果然不多。因此一個人就操起根棍子朝這年輕人打來，口中說道，“你沒瞧見我正打魚嗎？”“那我該怎麼說？”年輕人問。“你得說：‘打一滿網，打一滿網’。”於是，他又走了很長時間，口裡不斷念道：“打一滿網，打一滿網。”最後他來到一個絞架旁，那兒正要處決一個可憐的罪犯。於是他說：“早上好，打一滿網，打一滿網。”“你這傢伙說什麼？ ‘打一滿網’，難道世上壞蛋還多的是？絞死一個還不夠嗎？ ”這樣他背上又挨了幾下打。“那麼，我該怎麼說呢？”他問。你得說“願上帝保佑這個可憐的靈魂吧！ ”年輕人又走了很長時間，口裡念道：“願上帝保佑這個可憐的靈魂吧！ ”他又來到了一條水溝邊。那兒站著個人，正在給一匹馬剝皮，只聽這年輕人說：“早上好，願上帝保佑這個可憐的靈魂吧！ ”“你這渾小子，說什麼來著？”這剝皮者給了他的耳朵重重一拳，痛得他眼冒金星，一時分不出哪是東南西北。“那麼，我該說什麼？”“你得說'你這殭屍，快躺進溝裡吧！”於是，他又繼續往前走，口中念道：“你這殭屍，快躺進溝裡吧！你這殭屍，快躺進溝裡吧！”這時，他來到一輛乘滿人的馬車旁，說：“早上好，你這殭屍，快躺進溝裡吧！”話剛出口，馬車果然翻進了水溝裡，車伕操起馬鞭，給了他一頓猛抽，痛得他只好回到他母親那兒去了。從此，他一輩子再也不出去旅行了。",
    "qas": [
      { "query_id": "41_0", "query_text": "誰在打魚?", "answers": ["漁夫"] }
    ]
  },
  {
    "context_id": 42,
    "context_text": "從前有個小女孩，從小父母雙亡，她窮得沒有地方住，也沒有床兒睡，除了身上穿的衣服和手裡拿的一塊麵包外，什麼也沒有了，就連那麵包也是個好心人送的。她心地善良，待人誠懇，但她無依無靠，四處流浪。一次她在野外遇了一位窮人，那人說：“行行好，給我點吃的，我餓極了。”小姑娘把手中的麵包全部給了他。往前走了沒多久，她又遇到了一個小男孩，哭著哀求道：“我好冷，給我點東西遮一遮好嗎？”小女孩聽了，取下了自己的帽子遞給他。然後她又走了一會兒，她看見一個孩子沒穿罩衫，在風中冷得直發抖。她脫下了自己的罩衫給了他。再走一會兒又有一個在乞丐求一件褂子，她把自己的給了她。最後，她來到了一片森林，這時天色漸漸暗起來了。走著走著又來了一個孩子，請求她施捨一件汗衫，這個善良的小女孩心想：“天黑了，沒有人看我，我完全可以不要汗衫。”想著就脫下了自己的汗衫給了這孩子。當她就這樣站著，自己一點東西也沒有時，突然有些東西從天上紛紛落了下來，一看盡是些硬梆梆、亮晶晶的銀元。雖然她剛才還把汗衫給了人，現在身上卻穿著一件嶄新的亞麻做的汗衫，小女孩馬上把銀元揀起裝在了兜裡，終生不再缺錢用。",
    "qas": [
      {
        "query_id": "42_0",
        "query_text": "誰來求一件褂子?",
        "answers": ["乞丐"]
      }
    ]
  },
  {
    "context_id": 43,
    "context_text": "從前有個國家來了一頭野豬。它踐踏耕地、咬殺牲畜，還用尖利的獠牙咬人，人們為此痛苦不堪。國王宣佈只要有人能將王國從這一災難中拯救出來，他就會大大地賞賜他。可是野豬太大了，而且強不可敵，因此誰也不敢接近它藏身的那片森林。最後國王宣佈：誰若能捕獲或者殺死那頭野豬，他就能娶國王的獨生女為妻。在鄉下住著兩兄弟，是窮人家的孩子。老大狡猾精明卻缺乏勇氣；弟弟單純而心地善良。兩兄弟說他們願意接受這個危及生命的使命。國王對他們說：“為了讓你們能確實找到那頭野獸，你們兩人必須分頭從兩個方向進森林。”於是，哥哥從西頭走，弟弟從東邊進。弟弟走了沒多遠就遇到一個小個子男人。他手裡握著一支黑色長矛，對弟弟說：“我把這支長矛給你，因為你心地純潔善良；你拿著這長矛，只管大膽去鬥那野豬，長矛會幫你的。”弟弟謝過那小個男子，扛起長矛，毫不畏懼地繼續趕路。不久，他看到了那頭野豬，便用長矛對準了朝他撲來的野獸。野豬氣瘋了，它沖得太快太猛，結果長矛把它的心臟劃成了兩半。弟弟扛起巨獸往回走。森林另一端的入口處有座房子，人們在那裡飲酒、跳舞作樂。弟弟來到那兒時，哥哥早已坐在裡面了，他以為野豬反正逃不出他的手心，於是先喝點酒壯膽。當他看到弟弟帶著戰利品從森林裡返回時，邪惡的心裡充滿了嫉妒，無法平息。他對弟弟喊道：“進來吧，親愛的弟弟，喝杯酒歇歇。”從無戒心的弟弟走了進去，把好心男人給他長矛、自己又如何用長矛制服野豬的經過告訴了哥哥。哥哥留弟弟一起喝酒直到天色將晚，然後一道離開了小屋，在黑暗中趕路。他們來到小河上的一座橋跟前，哥哥讓弟弟走在前面，走到橋心時，哥哥對準弟弟的後腦勺狠狠一擊，弟弟倒下死了。哥哥將弟弟埋在橋下，自己扛起野豬去向國王領賞，似乎野豬是他獵殺的。他娶了國王的獨生女為妻。當有人問他為什麼弟弟沒有回來時，他說：“準是野豬把他給吃了。”人們也就信以為真了。可是什麼都瞞不過上帝的眼睛，這罪孽總有一天要真相大白的。幾年以後，有個牧羊人趕著羊群過橋，一眼看到沙子下面有根雪白的骨頭。他覺得這是做口吹樂器的好材料，於是爬下橋，將骨頭撿了起來。他用骨頭給自己的號角做了個吹口。可他第一次用它吹響號角時大吃了一驚，因為骨頭吹口自顧自唱起了小調： “啊，朋友，你在用我的骨頭吹奏，我在這河邊沉睡已久。哥哥殺我奪走了野豬，娶的妻子是國王之女。”“多好的號角呀！”牧羊人說，“竟然自己會唱小調！我一定要把它獻給國王陛下。”於是他將號角獻給國王，號角又唱起了同一支小調。國王一聽就明白了，於是派人到橋下挖出了被害人的屍骨。罪孽深重的哥哥無法抵賴他的所作所為，因此被縫進一個麻袋，沉到河裡去了。被害人的屍骨則被安葬在教堂墓地裡一座漂亮的墓塚裡了。",
    "qas": [
      {
        "query_id": "43_0",
        "query_text": "國家來了一頭什麼?",
        "answers": ["野豬"]
      }
    ]
  },
  {
    "context_id": 44,
    "context_text": "古時候，有個地方夜晚總是漆黑一片，天空就像籠罩著一塊黑布。因為在這裡，月亮從來沒有升起過，星星也不閃爍。其實在上帝創造世界時，晚上還是很明亮的。有一次，有四個年輕人離開了這片國土，來到了另一個國度。在那兒，當傍晚太陽消失在山後時，樹梢上總會掛著一個光球，灑下一片柔和的光華，它雖然不如太陽那樣光彩明亮，但一切還是清晰可見。那些旅客停下來問一個趕車經過的村夫那是什麼光。 “這是月亮，”他回答說，“我們市長花了三塊錢賣下它，並把它拴在橡樹梢頭。他每天都得去上油，保持它的清潔，使它能保持明亮。這樣他就每週從我們身上收取一塊錢。”村夫推著車走了。他們當中的一個人說：“我們也可以用這盞燈，我們家鄉也有棵和這一樣大的橡樹，我們可以把他掛在上面。夜晚不用在黑暗中摸索將有多痛快呀！”第二個說：“我來告訴你該怎麼辦。我們去弄架馬車來，把月亮運走。這裡的人會再買一個的。”第三個人說：“我很會爬樹，我來取下它。”第四個買了輛馬車。第三個人爬上樹，在月亮上鑽了個洞，穿上一根繩子，然後把月亮放了下來。這個閃閃發光的圓球於是被放在了馬車上，他們用一塊布蓋在上面，以免別人發現是他們偷的。他們順利地把月亮運到了自己的國家，把它掛在了一棵高高的橡樹上。這盞新燈立刻光芒四射，照耀著整個大地，所有的房間都充滿了光亮，老老少少都喜笑顏開。矮子走出了石洞，小孩們也穿著小紅褂在草地上圍著圈子跳起舞來。那四個人負責給月亮添油、淨身，並每週收取一塊錢。但他們慢慢地老了，其中的一個生了病，眼看著不久於人世了，他要求把四分之一的月亮作為他的財產，埋進他的墳墓裡。等他死後，市長爬上了大樹，用籬笆剪子剪下了四分之一的燈，放進了他的棺材。月亮的光芒減弱了，但仍然發光。第二個人死時，又有四分之一陪了葬，月光又減弱了。第三個人死後，他也帶走了他那一份，月亮更暗了。當第四個走進墳墓時，原來的黑暗又回來了。但是月亮的各部分，在陰間又重新拼合在一起，使得那些黑暗中的死人不得安寧，一個個又醒來了。他們又能睜眼看世界了，覺得非常驚異。淡淡的月光對他們已是綽綽有餘，因為他們的眼睛已變得那樣衰弱，經不起太陽的強光。他們興奮地爬起來，又開始了從前的生活方式：一些人去看戲跳舞，一些人去客棧要酒喝，醉了就爭吵，最後拳腳相加。吵鬧聲越來越大，最後傳到了天堂。守衛天堂大門的聖彼得以為下界在造反，就招集了天兵天將，叫他們去擊敗惡魔，如果他們來侵犯天庭的話。但是沒有惡魔來，於是他便騎上馬穿過天門，下到凡間。在凡間，他叫死者安靜下來，讓他們重新回到墳墓，從他們手中拿走了月亮，把它掛在了天上。",
    "qas": [
      {
        "query_id": "44_0",
        "query_text": "誰招集天兵天將去擊敗惡魔?",
        "answers": ["聖彼得"]
      }
    ]
  },
  {
    "context_id": 45,
    "context_text": "一天下午，耶穌基督躺在搖藍裡睡著了，他媽媽來到他身邊，滿懷喜悅地望著他，說：“我的兒，你睡著了嗎？好好睡吧，待會兒我去給你摘一把草莓來，我知道你醒來後，看見草莓準喜歡。”在外邊的森林中，聖母瑪利亞找到了一塊地方，上面長滿了令人興奮的草莓。等她彎腰去摘時，猛地從草叢中竄出來一條毒蛇，把她給嚇壞了，她丟下草莓，扭頭就跑。那條毒蛇在後面緊追不捨，聖母瑪利亞急中生智，迅速地躲進了一叢榛樹下，靜靜地站在那裡，最後毒蛇離去了。後來她又摘到了草莓,臨回家前她說:“榛樹這次保護了我,將來也會保護其他人的。”因此，從很久遠的時候起，一根綠色的榛樹枝就成了對付毒蛇、其它蛇類以及所有在地上爬行的東西的最佳保護物。",
    "qas": [
      {
        "query_id": "45_0",
        "query_text": "聖母瑪利亞找到的地方上面長滿了什麼?",
        "answers": ["草莓"]
      }
    ]
  },
  {
    "context_id": 46,
    "context_text": "從前有一個窮人，他有十二個孩子。他必須起早貪黑地幹活才能養活他們。眼看第十三個孩子又要出世了，他在困境中一籌莫展，不知所措。他來到大路上，想請他碰到的第一個人在孩子命名受洗時當他的教父。他首先遇到的是仁慈的上帝。上帝已經知道他的心事，便對他說：“可憐的人，我憐憫你。讓我當你孩子的教父吧，我會照應他，給他帶來人世間的幸福。”窮人問：“你是誰？”“我是仁慈的上帝。”窮人便說：“那我就不求你給孩子做教父了。你把什麼都給了富人，而讓窮人挨餓。”說完轉身繼續朝前走。不久他遇到了魔鬼。魔鬼說：“你還找什麼？只要你讓我給孩子當教父，我會給他用不完的金子，讓他享受世界上一切歡樂。”窮人問：“你是誰？”“我是魔鬼。”窮人便說：“那我不願意你給孩子做教父，你騙人，並且害人。”說著繼續朝前走。骨嶙峋的死神朝他大步走來，說：“讓我做孩子的教父吧。”窮人問：“你是誰？”“我是使人人平等的死神。”窮人便說：“那我就讓你給孩子做教父吧。”",
    "qas": [
      { "query_id": "46_0", "query_text": "誰使人人平等?", "answers": ["死神"] }
    ]
  },
  {
    "context_id": 47,
    "context_text": "古時後，有個巨人漫步在鄉間的大道上，突然一個陌生人跳到他跟前說：“站住，不許再往前走一步！”“什麼？”巨人叫道，“你這小東西，我兩根指頭就能把你捏死，你敢擋我的路？你是什麼人，敢口吐狂言？”“我是死神，”他回答說，“沒有人能反抗我，你也必須服從我的命令。”但巨人拒絕了，和死神打鬥起來，這是一場持久而激烈的戰鬥，最後巨人佔了上風，一拳擊倒了死神，使他癱倒在一塊石頭旁。巨人凱旋而去，死神倒在那兒屈服了，他太虛弱了，竟爬不起來了。 “現在我該怎麼辦呢？”他說，“如果就縮在這個角落裡，世上就沒人會死，那麼必定會擠滿人而無處容身了。”這時來了位年輕人，朝氣蓬勃，一路高歌，並且在舉目四顧。一看見這個半死半活的人，馬上關切地走了上來，扶起他，從自己的瓶中倒了口水給他，看著他恢復了幾分力氣。那陌生人邊爬起邊說：“你可知道我是誰嗎？你知道你幫了誰嗎？”“不，”年輕人說，“我不認識你。”“我是死神，我從不放過任何人，你也不例外。但為了表示我的感激之情，我向你保證我絕不出其不意地降臨於你，我會在來取你性命之前派我的報信使者通知你。”“好的，”年輕人說，“能知道自己的死期就足夠了，至少在這以前我不用提心吊膽的。”然後他愉快地走了，無憂無慮地生活著。但青春和健康不會長久，很快病痛與悲哀都來了，它們開始一天天地折磨他。他自言自語道：“我不會死的，因為死神還沒來，我真希望這病痛纏身的痛苦日子趕快結束。”後來他的病好了，他又過上了開心的日子。有一天，有人拍了拍他的肩膀，他扭頭一看，發現死神就站在他身後。 “跟我來，你和這個世界告別的時刻已經到了。”“什麼？”這人問道，“你怎能食言？你不是保證說你本人來之前會派信使來嗎？”“別作聲！”死神說，“我不是接二連三地差信使到這裡了嗎？寒熱不是來打你、推你、摔倒你了嗎？暈眩不是弄得你頭昏腦脹嗎？痛風病不是折磨你四肢嗎？耳鳴有過嗎？牙痛時不曾使面頰發腫嗎？而且，我的兄弟'睡神'不是每晚向你提起我嗎？夜裡，你難道不是像死人那樣地躺在那嗎？”這人無話可說，只得聽天由命，跟著死神走了。",
    "qas": [
      { "query_id": "47_0", "query_text": "巨人和誰打鬥?", "answers": ["死神"] }
    ]
  },
  {
    "context_id": 48,
    "context_text": "母狼生了一隻小狼，於是請來狐狸當教父。她說：“總之，狐狸是我們的近親，見多識廣而且頭腦聰明；它能教好我兒子，幫他在世界上生存。”狐狸裝得很誠實地說：“親愛的高司普太太，感謝你對我的尊敬，我也要同樣對待你，不辜負你的期望。”在宴席上，他非常高興地盡情大吃，然後對狼媽媽說：“親愛的高司普太太，我們有責任讓孩子們吃得好吃得飽，這樣他們才能長得結實強壯。我知道有個羊圈，我們可以輕而易舉地搞到一塊肥肉來。”狼一聽，覺得不錯，於是跟著狐狸來到農莊。它指著遠處的一群羊說：“你可以輕易地悄悄溜進去，我到另一邊看看能不能抓只雞回來。”其實它沒去另一邊，而是在森林的入口處坐了下來，伸直了腿腳休息。母狼爬進羊圈，裡面一隻狗狂叫起來。農夫聽到了跑出來，逮住了母狼高司普，而且將一盆準備用來洗衣服的強鹼性的水潑在了它身上。母狼總算逃出來了，那隻狐狸卻假裝很哀傷地說：“哦，親愛的高司普太太，我真是不幸。農夫抓住了我，把我所有的腳指頭都打斷了。如果你不願意看著我躺在這裡死去，那你就背我回去吧。”母狼儘管自己也只能慢慢地走，可它很關心狐狸，把它馱到了背上，把這個沒病沒痛的教父背回了家。這時，狐狸對母狼說：“再見，親愛的高司普太太，願你吃上一頓精美的烤肉。”它開心地笑著走了。",
    "qas": [
      {
        "query_id": "48_0",
        "query_text": "母狼請誰來當教父?",
        "answers": ["狐狸"]
      }
    ]
  },
  {
    "context_id": 49,
    "context_text": "從前，有隻公雞準備和一隻母雞一起出門旅行。公雞做了一輛漂亮的車，裝上四隻紅色的輪子，然後套上四隻小老鼠拉車。母雞和公雞坐上車出發了，不久，它們遇到一隻貓，貓問它們：“你們上哪兒？”公雞回答說：“去海爾家。”“帶上我吧。”貓說。公雞說：“十分願意。從後面上來吧，可別摔下來，小心別弄髒了小紅輪子。小小車輪快快跑，小老鼠兒吱吱叫，我們朝前奔，快到海爾家。 ”隨後又來了磨盤、一個雞蛋、一隻鴨子、一個髮夾，最後來的是一根縫衣針，它們全擠到車上，一起朝海爾家趕去。它們到時海爾不在家。於是小老鼠將車拖進牲口棚。母雞和公雞飛到一根橫桿上歇著了，貓咪蹲伏在灶膛邊，鴨子蹲到了井台邊，雞蛋用毛巾把自己裹了起來，髮夾一頭扎進座墊上，縫衣針則跳到床上，藏到了枕頭中央，磨盤也爬到門頂上。海爾回到家中，走到灶膛邊準備生火。蹲在那裡的貓撒了他一臉爐灰；他急忙跑到廚房去洗臉，鴨子又潑了他一臉水；他想用毛巾把水擦乾，雞蛋又滾出來破了，把他的眼睛給粘上了；他想休息一下，於是往坐椅上一坐，髮夾扎得他彈了起來；他勃然大怒，一頭倒到床上，可是頭一碰枕頭，縫衣針便把他扎得“嗷嗷”亂叫著往外沖；當他走到門口時，磨盤從門上落了下來，一下把他砸死了。看來海爾﹒柯貝斯準是個大壞蛋！",
    "qas": [
      { "query_id": "49_0", "query_text": "誰幫公雞拉車?", "answers": ["老鼠"] }
    ]
  },
  {
    "context_id": 50,
    "context_text": "一個裁縫夥計四處找活干，卻一件也沒找著，他已窮得叮噹響了。不久他在路上遇到了一位猶太人，他想這人身上肯定有很多錢，便兇像畢露，走上前去說：“要錢還是要命？”猶太人說：“饒了我吧，錢我沒有，只剩八分錢了。”小裁縫說：“你有錢，通通交出來。”說著便對他一頓痛打，打得他奄奄一息。猶太人快死了，只聽他最後說：“清白的太陽會揭露真相的！”說完就死了。裁縫夥計搜遍了猶太人的身子，只發現了那八分錢，猶太人果然沒有撒謊。他把猶太人的屍體拖起來，背到了一叢樹後面，又繼續去找活兒幹，找了很久，他終於在一個小鎮上找到了一份活，那家主人還有位千金，小裁縫愛上了她，與她結了婚，他們的婚姻生活倒還很美滿幸福呢。過了很久，他和妻子有了兩個孩子，妻子的父母都去世了，他們單獨撐起了這個家。一天早上，丈夫坐在窗前的桌子旁，妻子給他端來了咖啡。當他把咖啡倒進杯子裡，正準備要喝時，太陽光照在了上面，反射光忽閃忽閃地投影在牆上，形成了一個個圓圈。裁縫抬起了頭看著說：“啊，它真像要揭露真相，但不可能！”他妻子說：“哦，親愛的，那是什麼？你是什麼意思？”他回答說：“我不能告訴你。”但他妻子說：“如果你愛我，就該告訴我。”然後又用甜言蜜語來迷他，說別人決不會知道的，一直糾纏得他不得安寧。於是他告訴妻子許多年前，他為了找活干而到處奔波，衣服襤褸又身無分文，最後殺了一位猶太人，猶太人垂死前說：“清白的太陽會揭露真像的！”現在，太陽就是想要把它揭穿，在牆上閃耀著畫著圈子，可是還沒能揭穿。講完後，他一再要妻子不要講出去，否則他的小命就沒了。妻子答應了。可是就在他又坐下去幹活時，他的妻子去了她的一個好朋友那兒吐露了實情，還叮囑她的朋友不要再對任何人說起。但不到三天，這件事便整個小鎮無人不知了，裁縫被帶上了法院，得到了應有的懲罰。就這樣清白的太陽還是揭露了這件事。",
    "qas": [
      {
        "query_id": "50_0",
        "query_text": "誰被小裁縫痛打?",
        "answers": ["猶太人"]
      }
    ]
  },
  {
    "context_id": 51,
    "context_text": "以前有個叫漢斯的年輕農夫，他的舅舅想給他找個闊媳婦。所以他讓漢斯坐在爐子後面，並把火生得旺旺的，然後拿來一壺牛奶和許多白麵包，將一枚亮晶晶的新硬幣遞到漢斯的手裡並囑咐道：“漢斯，趕緊握住這枚硬幣，把白麵包掰碎了泡在牛奶裡，坐著別動，我回來之前你千萬別站起來。”“好吧。”漢斯答應道，“我照您說的做。”然後舅舅穿上一條打著補丁的舊褲子，去旁村見一位富家的女兒，並問道：“能嫁給我的外甥漢斯嗎？他既老實又通情達理，你一定覺得非常合適。”那位貪婪的父親問：“他有些什麼財產？他拿什麼招待客人？”親愛的朋友，”舅舅回答，“我那年輕的外甥有一個溫暖的店舖，手裡有亮晶晶的錢，有許多麵包等著招待賓客，另外他和我一樣有很多農田，”（他一邊說著一邊拍著他的褲子，在那個地區小塊農田被稱做補丁）。“如果您不嫌麻煩就請和我一起回家，您馬上就會看到我說的一切都是真的。”那守財奴可不願意失掉這個好機會，馬上說：“真是如此的話，我決不會反對這門婚姻。”選定吉日，喜結良緣，新娘子步出洞房想看看新郎子的財產，漢斯脫掉他的新衣，換上一件打著補丁的工裝並說道：“我怕弄壞了這件好衣服。”然後他們一塊走了出去，看到了一塊葡萄園，農田旁邊是草地，漢斯用手指指點點，然後又拍了拍他工裝上的大小補丁，說：“我最親愛的，你看這塊是我的，那塊也是我的。”他的意思是讓他的媳婦別老盯著寬闊的田野，也看看他的衣服，這才是他自己的。“婚禮你也參加了？”“我當然參加了，還穿了全套禮服。我的帽子是雪做的，太陽一出來就給曬化了；我的外套是蜘蛛網，過荊棘的時候全給撕壞了；鞋是玻璃的，踩在石頭上，卡嚓一聲，碎成了兩半。”",
    "qas": [
      {
        "query_id": "51_0",
        "query_text": "年輕的農夫叫什麼?",
        "answers": ["漢斯"]
      }
    ]
  },
  {
    "context_id": 52,
    "context_text": "在一個小朋友的房間裏，有一個古老的木橱，木橱的正中央刻著一位男人，大家叫他羊角將軍。房間裏還放著各式各樣的玩偶，有牧羊女和他的爺爺，還有一個掃烟囪的年輕人。一天，羊角將軍說要娶牧羊女做妻子，這可把牧羊女嚇了一大跳，她說：“我已經有喜歡的人了。” 可是牧羊女的爺爺却同意這門親事，理由很簡單，羊角將軍是用很好的橡木雕刻成的，而且木橱裏有許多金銀財寶。再說，他是爺爺，應該由他說了算。牧羊女不同意，她怎麽願意整天呆在漆黑的木橱裏呢？她只好把希望寄托在掃烟囪的年輕人身上，因爲這個年輕人才是她心裏真正喜歡的人。羊角將軍聽說她爺爺同意了這門婚事，高興地睡了，爺爺呢？也睡了。這不是絕好的機會嗎？牧羊女拉著年輕人就跑，可從哪逃走呢？ 年輕人說：“這樣吧，我們鑽進爐子，從烟囪裏逃走，這條路我很熟，他們誰也找不到我們。不過，你可一定要勇敢。”這時，爺爺和羊角將軍都醒了，見他們要逃走，便大喊起來。 牧羊女跟著年輕人迅速鑽進烟囪。好黑呀，什麽也看不清，她拉著年輕人的手，心理怦怦直跳。突然，她聽到“哐當”一聲，好像房間裏什麽東西率破了。她不顧看這些，跟著年輕人，慢慢爬到了烟囪的頂上。啊，外面真美，空氣真新鮮。天空上挂滿了星星，還有一輪圓月呢！脚下是房頂，一間挨著一間，一陣凉風吹過來，它緊緊挨著年輕人。 站在房頂上，外面的世界太安靜了。突然，牧羊女感到孤獨了，這是她第一次離開房間，他想爺爺了。她一定要回去。年輕人無奈，只好帶著她又返回房間。當他們打開爐門，望房間裏一看，不禁嚇呆了。原來，爺爺在追他們時摔倒了。 牧羊女哭了，“都是爲了我，都是爲了我，爺爺才弄成這個樣子的。”年輕人找來一瓶膠水，對牧羊女說：“別急，我們把他拼到一塊，粘起來。”羊角將軍呢？站在一邊動也不動，好像什麽也沒有發生一樣。年輕人一片片撿著碎片，牧羊女一片一片細心地粘，慢慢地，爺爺恢復了原樣。 遺憾的是，爺爺的脖子不能轉動了，但是站在那裏，仍和以前一樣威風。他對牧羊女和年輕人說：“非常感謝你們，是你們幫助了我，使我恢復了原樣。”說到這裏，爺爺有意看了看羊角將軍。羊角將軍低下了頭，一句話也說不出來。牧羊女呢？她拉著年輕人的手，高高興興回到原來的位置。不過，他和年輕人挨得很緊，兩人幷排站在一起。看到牧羊女這個樣子，羊角將軍心裏很不好受，但仍厚著臉皮對爺爺說：“你原先同意我和牧羊女結婚的，現在她回來了，請你還是答應我們的婚事吧！”爺爺不理睬他，爺爺的頭不能動，但爺爺把頭擡得高高的，一句話也不回答。",
    "qas": [
      {
        "query_id": "52_0",
        "query_text": "木櫥的正中央刻著什麼?",
        "answers": ["男人"]
      }
    ]
  },
  {
    "context_id": 53,
    "context_text": "從前，有個又固執好奇心又強的小姑娘，無論她父母要她幹什麼她總是不服從。這樣的孩子會有什麼好結果呢？有一天她問父母：“我總聽人們說起特魯得太太，說她的一切都與眾不同，她家裡盡是些希奇古怪的東西。我太好奇了，哪天我一定得去看看。”她父母堅決反對，說：“特魯得是個壞女人，盡幹壞事。你要是去了就不是我們的孩子了。”可是姑娘並沒因父母的阻止而回心轉意。當她來到特魯得太太家時，特魯得問她：“你的臉色怎麼這麼蒼白啊？”“唉呀，”她渾身發抖地回答說，“我被見到的那些東西嚇壞了。”“你看到什麼了？”“我在台階上看到一個黑色的人。”“那是燒炭的。“後來看到一個綠色的人。”“那是獵人。”“後來還看到一個血紅血紅的人。”“那是屠夫。”“唉呀，特魯得太太，我從窗口望進來，看到的不是你，而是火頭魔鬼本人。我不會看錯的，真嚇死了！”“哦！”特魯得說，“看來你的確看到了穿著平常服飾的巫婆了。我早就想要你了，已等了這麼久，你可以讓我這兒亮一點呢。”說罷將姑娘變成了一段木頭，扔進了火堆。木頭熊熊燃燒起來，巫婆靠近火堆取暖，說：“它亮一陣子就會熄滅的。”",
    "qas": [
      {
        "query_id": "53_0",
        "query_text": "姑娘被變成什麼了?",
        "answers": ["木頭"]
      }
    ]
  },
  {
    "context_id": 54,
    "context_text": "在一座新建公園的小池塘裡，住著一隻癩蛤蟆和許多小昆蟲。癩蛤蟆靠著自己體型比其他小昆蟲大，就在小池塘裡稱王，所有的昆蟲必須得聽他的，否則，就會變成牠的「點心」。有一天，癩蛤蟆睡飽覺後，發現池塘裡有一樣令牠覺得很刺眼的東西，其它昆蟲都圍著那樣東西交頭接耳說：「哇！好美麗！」「好香呀！」「這真是太神奇啦！」原來池塘長了一朵含苞待放的荷花，在公園裡散步的人也都停下腳步欣賞那朵美麗的荷花。荷花的美麗跟醜陋的癩蛤蟆形成強烈對比，癩蛤蟆感覺那一朵花竟然凌駕了它在池塘裡的地位，心裡感到很不是滋味，趁著人們都走散時，它號召所有的昆蟲都到它的面前來。癩蛤蟆對所有的昆蟲說：「大家以後都不准接近那多花！否則，後果你們應該知道！」所以的昆蟲雖然心裡都很不服，卻噤若寒蟬，唯恐得罪了癩蛤蟆。但奇怪的現象來了，池塘的許多地方竟然也紛紛的冒出荷花來，看到昆蟲們圍著荷花快樂的玩鬧著，讓癩蛤蟆更是火冒三丈，癩蛤蟆再一次的號召所有的昆蟲，氣沖沖的對它們說：「你們實在太笨了！那些荷花在搶我們生存的地盤。」一隻紡織娘聽了說：「不會呀！那些花讓我們生活得更快樂，池塘變得更美麗了！」話才剛一說完，紡織娘就被癩蛤蟆吞到肚子裡了。癩蛤蟆咽咽口水說：「你們看！紡織娘已經被那些荷花毒害了！它上了那些荷花的當！真是太可惜啦！你們還有沒有話想要說的？」所以的昆蟲嚇得一點聲音都不敢出，癩蛤蟆看了非常滿意說：「竟然大家都沒意見！為了維護我們的地盤，我們要徹底剷除這些荷花。」應聲蟲為了討好癩蛤蟆，馬上呼應說：「對！我們要剷除這些荷花！」說完就馬上跳到一朵荷花上，把荷花的花瓣咬得西巴爛。癩蛤蟆很高興的對其它昆蟲說：「應聲蟲果然是我們大家的楷模呀！現在就讓我們一起來剷除這些荷花！」一些昆蟲聽了這番話，也加入應聲蟲的行列，癩蛤蟆用斜眼射向那些還待原處的不動的昆蟲，讓那些昆蟲不得不配合，也紛紛加入。只見一朵朵美麗的荷花被瘋狂的迫害著，水池上飄著一片片零落的花瓣，但荷花卻依然筆直的挺立著。 癩蛤蟆看了很不高興，決定將荷花連莖咬斷，牠賣力的跳到每一朵荷花的莖上，用力的啃咬，正當癩蛤蟆在享受摧殘荷花的快感時，一個小男孩剛好路過，看到池塘變成這副模樣，癩蛤蟆還自顧自的東跳西跳咬來咬去，感到非常生氣，小男孩抓起癩蛤蟆的後腿，從地上撿隻小樹枝，用力鞭打癩蛤蟆數十下後，狠狠的摔到路邊去，當癩蛤蟆還搞不清楚什麼狀況時，一輛大卡車將這隻狂妄自大的癩蛤蟆給壓死了。",
    "qas": [
      {
        "query_id": "54_0",
        "query_text": "誰討好癩蛤蟆?",
        "answers": ["應聲蟲"]
      }
    ]
  },
  {
    "context_id": 55,
    "context_text": "一隻貓在森林裡遇到一隻狐狸，心想他又聰明，經驗又豐富，挺受人尊重的。於是它很友好地和狐狸打招呼：“日安，尊敬的狐狸先生，您好嗎？這些日子挺艱難的，您過得怎麼樣？”狐狸傲慢地將貓從頭到腳地打量了一番，半天拿不定主意是不是該和它說話。最後它說：“哦，你這個倒霉的長著鬍子、滿身花紋的傻瓜、饑腸轆轆地追趕老鼠的傢伙，你會啥？有什麼資格問我過得怎麼樣？你都學了點什麼本事？”“我只有一​​種本領。”貓謙虛地說。“什麼本領？”狐狸問。“有人追我的時候，我會爬到樹上去藏起來保護自己。”“就這本事？ ”狐狸不屑地說：“我掌握了上百種本領，而且還有滿口袋計謀。我真覺得你可憐，跟著我吧，我教你怎麼從追捕中逃生。 ”就在這時，獵人帶著四條狗走近了。貓敏捷地竄到一棵樹上，在樹頂上蹲伏下來，茂密的樹葉把它遮擋得嚴嚴實實。 “快打開你的計謀口袋，狐狸先生，快打呀！”貓衝著狐狸喊道。可是獵狗已經將狐狸撲倒咬住了。 “哎呀，狐狸先生，”貓喊道，“你的千百種本領就這麼給扔掉了！假如你能像我一樣爬樹就不至於丟了性命了！”",
    "qas": [
      {
        "query_id": "55_0",
        "query_text": "誰會爬到樹上保護自己?",
        "answers": ["貓"]
      }
    ]
  },
  {
    "context_id": 56,
    "context_text": "一個農夫有一匹勤奮、任勞任怨為他幹活的馬，但這匹馬現在已經老了，幹活也不行了，所以，農夫不想再給馬吃東西。他對馬說：“我再也用不著你了，你自己離開馬廄走吧，到你比一頭獅子更強壯時，我自然會把你牽回來的。”說完，他打開門，讓馬自己去謀生去了。這匹可憐的馬非常悲哀，它在森林裡漫無目標地到處徘徊，寒風夾著細雨，更增加了它的痛楚，它想尋找一個小小的避雨處。不久，它遇到了一隻狐狸，狐狸問它：“我的好朋友，你怎麼了？為什麼垂頭喪氣，一副孤苦伶仃、愁眉苦臉的樣子呢？”馬歎了一口氣回答說：“哎——！公正和吝嗇不能住在一間房子裡。我的主人完全忘了我這許多年為他辛辛苦苦所幹的一切，因為我不能再幹活了，他就把我趕了出來，說除非我變得比一頭獅子更強壯，他才會重新收留我。我有這樣的能力嗎？其實，主人是知道我沒有這樣的能力的，要不然，他也不會這樣說了。”狐狸聽了之後，要它別愁了，只管放心，說道：“我來幫助你，你躺在那兒，把身子伸直，裝做死了的樣子，我自有辦法。”馬按狐狸的吩咐做了。狐狸跑到獅子住的洞口邊，對獅子說：“獅子大王，有條小路上躺著一匹死馬，我們一同去，你可以作一頓很不錯的午餐來享受哩。”獅子聽了非常高興，立即就動身了。它們來到馬躺的地方，狐狸說：“在這兒你吃不完它，我告訴你怎麼辦：先讓我把它的尾巴牢牢地綁在你的身上，然後你就能夠將它拖回你的洞穴去慢慢地享用了。”獅子對這個建議很欣賞。於是它一動不動地躺下來，讓狐狸把它綁在馬背上。但狐狸卻設法將它的腿捆在一起，用最大的力氣把獅子牢牢地捆作一團，獅子沒法掙脫束縛了。一切料理完畢，狐狸拍了拍馬的肩背說道：“起來吧！老馬頭，你可以走了！”那匹馬跳起來，把獅子拖在尾巴後面離開了。獅子知道上了狐狸的當，開始咆哮吼叫起來，巨大的吼聲把樹上所有的鳥兒都嚇得飛走了。但老馬隨便它怎麼叫，只管自己慢慢悠悠地走過田野，終於把獅子拖到了主人的屋裡。它對主人說：“主人，獅子在這兒，我把它料理妥當了。”當主人看見它的這匹老馬後，對它產生了憐憫之心，說道：“你就住在馬廄裡吧，我會好好待你的。”於是，這匹可憐的老馬又有了吃的東西，主人一直供養它到死去。”",
    "qas": [
      {
        "query_id": "56_0",
        "query_text": "馬把什麼拖到主人的屋裡?",
        "answers": ["獅子"]
      }
    ]
  },
  {
    "context_id": 57,
    "context_text": "狐狸來到一塊草地，看見草地上有一群肥肥大大的鵝，笑道：“我來得正好，你們的隊形很不錯，我可以毫不費事地把你們一隻一隻地都吃掉。”鵝群嚇壞了，它們哭叫著、蹦跳著、央求著饒命。可是狐狸卻裝著不聽見，威脅說：“無法開恩！你們必須死。”過了一會兒，一隻鵝壯著膽子來問：“既然我們不得不放棄我們年輕的生命，那麼能不能高抬貴手，讓我們做最後一次祈禱，讓我們別在自己的罪孽中死去，然後我們會排成一行，讓您每次都能選出最肥美的。”好啊，”狐狸答，“這倒是合情合理、挺虔誠的請求。去祈禱吧，我等著，等你們祈禱完。 ”於是第一隻開始了長長的禱告，它不停地叫著：“嘎！嘎！”好像是沒完沒了，第二隻等不及了，也開始“嘎！嘎！”叫了起來。接著是第三隻、第四隻，不一會兒它們一起叫了起來。等它們祈禱完了，咱們再繼續講這個故事，可是事到如今，它們還在不歇氣地祈禱著呢。",
    "qas": [
      {
        "query_id": "57_0",
        "query_text": "狐狸看見草地上有一群什麼?",
        "answers": ["鵝"]
      }
    ]
  },
  {
    "context_id": 58,
    "context_text": "從前有隻老山羊。它生了七隻小山羊，並且像所有母親愛孩子一樣愛它們。一天，它要到森林裡去取食物，便把七個孩子全叫過來，對它們說：“親愛的孩子們，我要到森林裡去一下，你們一定要提防狼。要是讓狼進屋，它會把你們全部吃掉的——連皮帶毛通通吃光。這個壞蛋常常把自己化裝成別的樣子，但是，你們只要一聽到他那粗啞的聲音、一看到它那黑黑的爪子，就能認出它來。”小山羊們說：“好媽媽，我們會當心的。你去吧，不用擔心。”老山羊咩咩地叫了幾聲，便放心地去了沒過多久，有人敲門，而且大聲說：“開門哪，我的好孩子。你們的媽媽回來了，還給你們每個人帶來了一點東西。”可是，小山羊們聽到粗啞的聲音，立刻知道是狼來了。“我們不開門，”它們大聲說，“你不是我們的媽媽。我們的媽媽說話時聲音又軟又好聽，而你的聲音非常粗啞，你是狼！”於是，狼跑到雜貨商那裡，買了一大塊白堊土，吃了下去，結果嗓子變細了。然後它又回來敲山羊家的門，喊道：“開門哪，我的好孩子。你們的媽媽回來了，給你們每個人都帶了點東西。”可是狼把它的黑爪子搭在了窗戶上，小山羊們看到黑爪子便一起叫道：“我們不開門。我們的媽媽沒有你這樣的黑爪子。你是狼！”於是狼跑到麵包師那裡，對他說：“我的腳受了點傷，給我用面團揉一揉。”等麵包師用面團給它揉過之後，狼又跑到磨坊主那裡，對他說：“在我的腳上灑點白麵粉。”磨坊主想狼肯定是想去騙什麼人，便拒絕了它的要求。可是狼說：“要是你不給我灑麵粉，我就把你吃掉。”磨坊主害怕了，只好灑了點麵粉，把狼的爪子弄成了白色。人就是這個德行！這個壞蛋第三次跑到山羊家，一面敲門一面說：“開門哪，孩子們。你們的好媽媽回來了，還從森林裡給你們每個人帶回來一些東西。”小山羊們叫道：“你先把腳給我們看看，好讓我們知道你是不是我們的媽媽。”狼把爪子伸進窗戶，小山羊們看到爪子是白的，便相信它說的是真話，打開了屋門。然而進來的是狼！小山羊們嚇壞了，一個個都想躲起來。第一隻小山羊跳到了桌子下，第二隻鑽進了被子，第三隻躲到了爐子裡，第四隻跑進了廚房，第五隻藏在櫃子裡，第六隻擠在洗臉盆下，第七隻爬進了鐘盒裡。狼把它們一個個都找了出來，毫不客氣地把它們全都吞進了肚子。只有躲在鐘盒裡的那隻最小的山羊沒有被狼發現。狼吃飽了之後，心滿意足地離開了山羊家，來到綠草地上的一棵大樹下，躺下身子開始呼呼大睡起來。沒過多久，老山羊從森林裡回來了。啊！它都看到了些什麼呀！屋門敞開著，桌子、椅子和凳子倒在地上，洗臉盆摔成了碎片，被子和枕頭掉到了地上。它找它的孩子，可哪裡也找不到。它一個個地叫它們的名字，可是沒有一個出來答應它。最後，當它叫到最小的山羊的名字時，一個細細的聲音喊叫道：“好媽媽，我在鐘盒裡。”老山羊把它抱了出來，它告訴媽媽狼來過了，並且把哥哥姐姐們都吃掉了。大家可以想像出老山羊失去孩子後哭得多麼傷心！老山羊最後傷心地哭著走了出去，最小的山羊也跟著跑了出去。當它們來到草地上時，狼還躺在大樹下睡覺，呼嚕聲震得樹枝直抖。老山羊從前後左右打量著狼，看到那傢伙鼓得老高的肚子裡有什麼東西在動個不停。 “天哪，”它說，“我的那些被它吞進肚子裡當晚餐的可憐的孩子，難道它們還活著嗎？”最小的山羊跑回家，拿來了剪刀和針線。老山羊剪開那惡魔的肚子，剛剪了第一刀，一隻小羊就把頭探了出來。它繼續剪下去，六隻小羊一個個都跳了出來，全都活著，而且一點也沒有受傷，因為那貪婪的壞蛋是把它們整個吞下去的。這是多麼令人開心的事啊！它們擁抱自己的媽媽，像當新娘的裁縫一樣高興得又蹦又跳。可是羊媽媽說：“你們去找些大石頭來。我們趁這壞蛋還沒有醒過來，把石頭裝到它的肚子裡去。”七隻小山羊飛快地拖來很多石頭，拚命地往狼肚子裡塞；然後山羊媽媽飛快地把狼肚皮縫好，結果狼一點也沒有發覺，它根本都沒有動彈。狼終於睡醒了。它站起身，想到井邊去喝水，因為肚子裡裝著的石頭使它口渴得要死。可它剛一邁腳，肚子裡的石頭便互相碰撞，發出嘩啦嘩啦的響聲。它叫道：“是什麼東西，在碰撞我的骨頭？我以為是六隻小羊，可怎麼感覺像是石頭？”它到了井邊，彎腰去喝水，可沉重的石頭壓得它掉進了井裡，淹死了。七隻小山羊看到後，全跑到這裡來叫道：“狼死了！狼死了！”它們高興地和媽媽一起圍著水井跳起舞來。",
    "qas": [
      { "query_id": "58_0", "query_text": "誰掉進了井裡?", "answers": ["狼"] }
    ]
  },
  {
    "context_id": 59,
    "context_text": "從前有隻狐狸向狼談起人的力量，說沒有動物能抵擋得了，所以他認為所有動物都必須施展計謀才能保護自己。可狼回答說：“假如我有機會碰到一個人，我就撲上去讓他無法抵擋。”狐狸說：“我可以幫你碰到人啊。明早你早點來我家，我把他指給你看。”第二天，狼很早就來了，狐狸帶它來到獵人每天的必經之路。他們碰到的第一個人是個退役老兵，狼問：“那是個人嗎？”“不是，”狐狸回答，“他以前是。”接著他們遇到一個去上學的小男孩。 “那是個人嗎？”狼又問。不是，”狐狸回答說，“他將來是。”最後一個獵人朝它們走來，他肩上扛著雙筒獵鎗，腰間還插著一把獵刀，狐狸對狼說：“那個就是人，你該朝他撲過去，我可是要回我洞裡去了。”於是狼朝獵人沖了過去。獵人一看說：“真可惜我沒裝上子彈，而是散彈。”他瞄準狼的臉開了一槍。狼疼得一陣痙攣，可還是沒被嚇倒，又朝獵人沖了過去。獵人又開了一槍。狼忍著巨痛撲向獵人，沒想到獵人抽出獵刀左右開弓地在狼身上劃了幾道口子。狼鮮血四濺，嚎叫著逃到狐狸那裡去了。“狼兄弟，”狐狸說，“和人相處怎麼樣？”狼回答說，“我從沒想到人的力量會這麼大！他先是從肩上取下一根棍子，朝裡面吹了一口氣，就有什麼東西飛到我臉上，癢得我要命；接著他又吹了一次，就有東西飛到我鼻子周圍，像下了一陣雹子。當我靠近他時，他從身上抽出一根白得發亮的肋骨狠狠地打我，幾乎把我打死在那裡。”狐狸說：“你這個吹牛大王，誰讓你把話說得太大了，自己連退路都沒有了呢。”",
    "qas": [
      { "query_id": "59_0", "query_text": "誰說人的力量大?", "answers": ["狼"] }
    ]
  },
  {
    "context_id": 60,
    "context_text": "狼以前是和狐狸住在一起的，而且狼要什麼，狐狸就得去做，因為狐狸較弱。有一次他們一起穿越一片大森林，狼說：“紅狐，去給我找點吃的，不然我就把你給吃了。”狐狸回答說：“我知道附近有個農場，裡面有兩隻小羊。如果你願意，我們就去弄一隻來。”狼覺得這主意不錯，和狐狸來到農場。狐狸溜進去偷了一隻小羊交給狼，自己很快走開了。狼吃完那隻小羊，覺得不過癮，還想吃，於是自己跑去偷。狼笨手笨腳的，馬上被母羊發現了，便“咩咩”地驚叫起來。農夫聽到了跑出來一看是隻狼，毫不手軟地給了一頓痛打，直打得狼嚎叫著，一瘸一拐地跑到狐狸那裡去了。 “你騙得我好苦哇！”狼說，“我想再吃一隻羊，那農夫突然襲擊，打得我幾乎變成肉醬了！第二天他們又來到農場。貪婪的狼說：“紅狐，去給我找點吃的，不然我就把你給吃了。”狐狸回答說：“我知道有戶農家今晚要煎薄餅，我們去弄些來吃吧。”他們來到農捨，狐狸圍著房子躡手躡腳地轉了一圈，一邊嗅一邊朝裡張望，終於發現了放餅的盤子，就去偷了六個薄煎餅交給狼。“這是給你吃的。”狐狸說完就走了。狼轉眼就吃完了六個薄餅，對自己說：“這些餅真讓人還想吃。”於是跑到那裡，把整個盤子都拖了下來，結果盤子掉在地上打得粉碎。響聲驚動了農婦，她發現是隻狼，連忙叫人，他們一起用棍子狠狠地打，直打得狼拖著兩條瘸了的腿嚎叫著逃回了森林。 “你太可惡了，竟然把我騙到那農舍，結果被農夫抓住，打得皮開肉綻的。”可狐狸說：“誰讓你這麼貪婪啊。”第三天，它們又一起出去，狼只能跛著腳走，它又對狐狸說：“紅狐，去給我找點吃的，不然我就把你給吃了。”狐狸說：“我知道有個人今天正好殺了頭牲口，剛醃的肉放在地窖的一個桶裡，我們去弄些來。”狼說：“我跟著你一起去，假如我被逮住了，你也好幫我一把。”“行。”狐狸說著就將方法和通地窖的小路告訴了狼。它們終於來到地窖，那裡有很多肉，狼張口就吃了起來。狼想：“我要用足夠的時間吃個痛快才走。”狐狸也很愛吃，但它總是四下張望，時不時跑到進來的洞口，試試自己的身體能不能鑽出去。狼問：“親愛的狐狸，你能不能告訴我你為什麼總是跑來跑去、鑽進鑽出的？”“我得看看是不是有人來了，”狡猾的伙伴回答說，“別吃太多了！”狼卻說：“我要把桶裡的肉全部吃光為止。”此時農夫聽到狐狸跳進跳出的聲音，就朝地窖走來。狐狸一看到他的影子，自己一溜煙地鑽出去逃走了。狼也想跟著跑，可牠吃得肚子鼓鼓的，在洞口卡得牢牢的鑽不出去了。農夫拿著一根棍子把狼打死了，而狐狸卻跑回了森林，為能夠擺脫那貪得無厭的狼而感到十分高興。",
    "qas": [
      { "query_id": "60_0", "query_text": "農夫把誰打死了?", "answers": ["狼"] }
    ]
  },
  {
    "context_id": 61,
    "context_text": "從前有一個家境貧窮，但是心地善良的小姑娘和母親過著孤苦伶丁的生活，她們總是吃不飽肚子。有一天小姑娘走進森林，遇到了一位老婆婆，老婆婆察覺到小姑娘的困境，送給她一口小鍋。當她對著鍋說“小鍋，煮吧”時，鍋裡就會煮出香甜的粥。當她再對鍋說：“別煮啦，小鍋”時，它就停止了。小姑娘把鍋拿回家給母親，從此，她們不再有貧窮和饑餓了，並且經常能喝到香甜的粥。一天，小姑娘出門去，她母親說：“煮吧，小鍋，煮吧。”小鍋煮出了粥，她吃呀吃，一直到吃飽了肚子。可是當她想讓鍋停止煮粥時，卻忘記說什麼了。所以鍋不停地煮呀煮，粥都溢出了鍋簷，它還在煮，結果粥流滿了廚房和整個房子，然後蔓延到隔壁的房子裡，又流進了街道，彷彿要讓全世界挨餓的人們都吃飽，可是這卻造成了一場大災難，因為沒有人能夠停住它。最後只剩下一棟房子沒有被粥淹沒時，小姑娘回到了家，她只說了一句“別煮啦，小鍋”，小鍋立刻停止了煮粥，可是任何人想回到城裡，他必須吃開一條路，方能進去了。",
    "qas": [
      {
        "query_id": "61_0",
        "query_text": "老婆婆送給小姑娘什麼?",
        "answers": ["小鍋"]
      }
    ]
  },
  {
    "context_id": 62,
    "context_text": "懶哈利和胖特麗娜總是為人持重，不為外物所擾。瘦莉莎的想法卻完全相反，她總是從早忙到晚，讓她的大個子丈夫倫茨幹很多的活。可儘管如此，他們還是一無所獲，一事無成。一天晚上，莉莎躺在床上，累得無法動彈，卻心事重重地無法入睡。她用肘撞旁邊的男人說：“倫茨，你聽，我想的是什麼？假如我找到一塊金幣，別人又送我一塊，我再去借一塊，你也給我一塊，那麼，我一共就有四塊金幣，我就要買一頭母牛。”男人覺得這很好，他說：“我雖不知道上哪兒去給你弄到送你的那塊金幣，但是如果你有了這筆錢，你就可以用它買頭母牛，如果母牛生頭小牛，那我們就可以喝上牛奶，提提神了。”女人說：“牛奶不是你的，我們讓小牛吸，讓它長得膘肥體壯，才能賣個好價錢。”男人說：“那是當然，不過我們也可以喝一點點，不礙事。”女人說：“誰叫你這樣對待母牛？不管礙不礙事，我都不會答應。你要是胡思亂想，休想喝到一滴牛奶！你這傻大個真是個貪得無厭的傢伙，要把我幸苦掙來的東西消耗盡嗎？”男人說：“老婆，安靜些，否則我要把你的嘴蒙起來。”“什麼？”她喊道，“你要嚇唬我，你這饞鬼，你這長桿子，你這懶鬼哈利。”她想揪他的頭髮，但長子倫茨坐起來，用一隻手抓著瘦莉莎的兩條細胳膊，用另一隻手將她的頭髮按在枕上，聽憑她叫罵，直到她最後累得又睡著了才鬆開。第二天早上，他們醒來後沒有繼續吵鬧，莉莎後來究竟有沒有出去找她想得到的那塊金幣，那我們就不知道了。",
    "qas": [
      {
        "query_id": "62_0",
        "query_text": "誰總是從早忙到晚?",
        "answers": ["莉莎"]
      }
    ]
  },
  {
    "context_id": 63,
    "context_text": "從前有位以他的智慧而聞名全國的國王，世界上的事情他沒有不知道的，而且，好像再秘密的事情也能有風聲傳到他的耳朵裡。不過，這位國王有個古怪的習慣：每天吃完晚飯，桌子已經收拾乾淨，而且其他人也都已離開之後，一位忠實的侍從會再給他端來一道菜。不過，這道菜用蓋子蓋著，誰也不知道裡面裝的是什麼，就連這侍從也不知道，因為國王每次都要等到房間裡只剩下他一個人時才揭開蓋子吃。這種情況持續了很長一段時間，終於有一天，端碗的侍從再也克制不住好奇心，把這道菜端進了自己的房間。他小心地鎖上門，揭開蓋子，看到盤子裡的菜是一條白蛇。他看到之後，就忍不住想嘗一嘗，於是他用刀子割下一小塊送進嘴裡。蛇肉剛碰到他的舌頭，他就聽到了窗子外面有一些奇怪的小聲音在竊竊私語。他走到窗邊側耳細聽，發現原來是一群麻雀在聊天，相互說著在田野和森林裡的所見所聞。吃了那塊蛇肉之後，他現在居然能聽懂動物語言了！說來也巧，也就在這一天，王后最漂亮的戒指不見了，因為這個侍從哪裡都可以去，所以偷戒指的嫌疑也就落到了他的頭上。國王把他叫去大罵一通，並且威脅說，要是他第二天早晨說不出小偷是誰，那麼他自己會被判為小偷，並被處死。侍從一再聲明自己是清白無辜的，可沒有用，國王還是不改變自己的主意。侍從的心裡又是煩惱又是害怕，便走進院子去想怎樣擺脫自己厄運的辦法。有幾隻鴨子安安靜靜地坐在院子裡的小溪旁，一面用喙梳理羽毛，一面說著悄悄話。侍從站在一旁聽著。它們分別講述著他們一上午都到過哪些地方，都找到一些什麼好東西吃。其中一隻鴨子抱怨說：“我的胃裡有樣很重的東西。我吃東西的時候匆匆忙忙的，結果把王后窗子下的一隻戒指吞進肚子裡去了。”侍從立刻抓住這只鴨子的脖子，把它拿到廚房，對廚師說：“送你一隻肥鴨子。請把它宰了。好的廚師說，一面用手掂了掂鴨子，“這傢伙拼死拼活地把自己吃得肥肥的，早就等著進烤箱了。”廚師說著便砍下了鴨子的腦袋，在掏鴨內髒的時候，發現王后的戒指在裡面。這下侍從輕而易舉地證明了自己的清白。國王覺得不該那樣冤枉他，想作一些彌補，便允許他提出一個請求，而且還答應，只要他開口，可以把宮中最好的職位給他。可是侍從謝絕了這一切，只請求給他一匹馬和一些旅費，讓他出去看看外面的世界。國王答應了他的請求，他便上了路。一天，他來到了一個池塘邊，看到池塘裡有三條魚讓蘆葦纏住了，嘴一張一張地想喝水。雖然人們常說魚都是啞巴，他卻聽到它們在為自己這樣慘死而哀聲歎氣。他很善良，下了馬，把三條魚重新放回到水裡。魚高興極了，從水裡探出頭來，衝著他喊道：“我們會記住你的，而且會報答你的救命之恩。”他騎著馬繼續向前走。過了一會兒，他覺得好像聽到腳底下的沙子裡有什麼聲音。他聽了一會兒，聽到一隻蟻王在抱怨：“那些騎著笨牲口的人類為什麼不離我們遠一點呢？這匹蠢馬沉重的蹄子踩死了我們多少人呵！”於是，他趕緊把馬帶到旁邊的小路上。蟻王對他叫道：“我們會記住你的。好心自然會有好報的！”這條小路把他帶進了一座森林。他看到兩隻老烏鴉站在窩邊，正往外扔小烏鴉。 “你們這些好吃懶做、沒有用的東西！都給我出去！”老烏鴉在罵著，“我們再也養不活你們了。你們都長這麼大了，應該自己養活自己。”可那些小烏鴉一個個躺在地上，撲打著翅膀喊著：“我們真是可憐啊！沒有誰能幫助我們。要我們自己養活自己，可我們連飛都還不會啊！除了躺在這裡餓死，我們還有什麼別的法子呢？”善良的青年從馬背上跳下來，拔出寶劍把馬殺了，留給小烏鴉當糧食。小烏鴉們立刻跳過來，一面吃一面叫道：“我們會記住你的。好心自然會有好報！”他現在只能靠兩條腿步行。他走了很長一段路後，來到了一座大城市。街上嘰嘰喳喳的圍了一群人，一個人騎在馬背上高聲叫道：“公主要選丈夫，但求婚者必須完成一項艱鉅的任務，完不成就得送掉自己的性命。”許多人都已經嘗試過了，可他們只是白白地送掉了性命。我們這位年輕人一看到公主，就被她的美貌迷住了，他忘記了危險，到國王面前去求婚。他被帶到海邊，一枚戒指當著他的面被扔進了海中。國王命令他從海底把戒指撈上來，並且說：“要是你撈不上來，我們就把你重新推進大海，直到浪濤把你吞沒。”大家都為這位英俊的小伙子感到惋惜，一個個都悄悄走了，只留下他一個人在海邊。他站在海邊，盤算著該怎麼辦。突然，他看到有三條魚在向他遊來，而且正是他救過的那三條魚。中間那條魚銜著一隻貝殼，游到岸邊就把它吐在了年輕人的腳邊。他撿起貝殼打開一看，只見那枚金戒指就在裡面。他興沖沖地帶著戒指去見國王，以為國王一定會把答應的獎賞賜給他。可是，當高傲的公主得知他出身低微時，非常瞧不起他，要他先完成第二項任務。她走到花園裡，親手撒了十袋小米在草地上，並且說：“明天日出之前，你必須把這些全部撿起來，一粒也不能少！”年輕人坐在花園裡，盤算著怎樣才能完成這項任務。可是他什麼辦法也沒有想出來，只好難過地坐在那裡，等待著天亮被人帶去處死。誰知當第一縷陽光照進花園時，他卻看到那十袋小米已經裝得滿滿的排在他的身旁，而且一粒也不少。原來，那隻蟻王晚上帶著成千上萬的螞蟻來過了。這些知恩報恩的小動物不辭辛勞地撿起所有的小米，裝進了袋子。不一會兒，公主親自來到了花園，看到年輕人已經完成了交給他的任務，她不由得感到萬分驚訝。可她那顆高傲的心還沒有被征服，於是她說：“雖然他完成了兩項任務，我還是不能嫁給他，除非他能從生命之樹上摘來一個蘋果。”年輕人根本不知道生命之樹長在什麼地方，可他還是出發了，而且準備一直找下去，直到他走不動為止。不過他也不抱多大希望，他找遍了三個王國，一天來到了一座森林。他躺在一棵樹下剛準備睡覺，突然聽到樹枝上有沙沙的聲音，一個金蘋果掉進了他的手裡！與其同時，三隻烏鴉飛了下來，落在他的膝蓋上，說：“我們就是你救活的三隻烏鴉。我們長大了之後，聽說你在尋找金蘋果，便飛過大海，到了長著生命之樹的世界盡頭，給你把蘋果摘來了。”年輕人萬分高興地踏上歸途，帶著金蘋果回到了美麗的公主那裡，這下公主再也沒有什麼可說的了。他倆把生命之果切成兩半，吃了下去，她的心便充滿了對他的愛，他們從此過著幸福安寧的生活。",
    "qas": [
      {
        "query_id": "63_0",
        "query_text": "鴨子把皇后的什麼吞進肚子裡?",
        "answers": ["戒指"]
      }
    ]
  },
  {
    "context_id": 64,
    "context_text": "從前有個很老很老的老人，眼睛花，耳朵也背，雙膝還不住地發抖。每當他坐在餐桌前吃飯時，湯匙也握不穩，常常把菜湯撒在桌布上，湯還會從嘴邊流出來。兒子和媳婦都嫌棄他，老人只好躲到灶後的角落裡吃飯。他們給他一隻瓦盆，把飯菜盛到裡面給他吃，而且每頓飯都不給老人吃飽。老人很傷心，常常眼淚汪汪地看著桌子。有一天，老人的手顫抖得連那隻瓦盆都端不穩了，瓦盆掉到地上打碎了。兒媳婦沒完沒了地訓斥他，老人一聲不吭，只是不住地歎氣。他們於是花了幾分錢買來一隻木碗給老人吃飯用。後來有一天，老人的兒子和媳婦正坐在那兒吃飯，四歲的小孫子在把地上的碎木片拾掇到一起。“你這是干什麼呢？”父親問。“我要做一隻木碗，等我長大了，讓爸爸媽媽用它吃飯。”聽到這話，兒子和媳婦對視了一會兒，最後哭了起來。他們立刻將老人請到桌邊，讓他從此和他們一起吃飯，即使老人潑了點什麼，他們也不再說什麼了。",
    "qas": [
      {
        "query_id": "64_0",
        "query_text": "老人把什麼打碎了?",
        "answers": ["瓦盆"]
      }
    ]
  },
  {
    "context_id": 65,
    "context_text": "她是一個窮得出奇的女人，老是垂頭喪氣。她的丈夫死了，當然得埋掉，但她是那麼窮困，連買一口棺材的錢都沒有。誰也不幫助她，連一個影兒也沒有。她只有哭，祈求上帝幫助她，因為上帝對我們所有的人總是仁慈的。窗子是開著，一隻小鳥飛進屋裡來了。這是一隻從籠子裡逃出來的金絲鳥。它在一些屋頂上飛了一陣子，現在它鑽進這個窮女人的窗子裡來了。它棲在死人的頭上，唱起美麗的歌來。它似乎想對女人說：「你不要這樣悲哀，瞧，我多快樂！」窮女人在手掌上放了一撮麵包屑，叫它飛過來。它向她跳過來。把麵包屑啄著吃了。這景象真逗人。可是，門上響起了敲門聲。一個婦女走進來了。當她看見了從窗子鑽進來的這隻小金絲鳥時，她說：「它一定是今天報紙上談到的那隻小鳥。它是從街道上的一戶人家飛出來的。」這樣，這個窮女人就拿著這隻小鳥到那戶人家去。那家人很高興，又獲得了它。他們問她從哪裡找到它的。她告訴他們，它是從窗外飛進來的。曾經棲在她死去了的丈夫身邊，唱出了一串那麼美麗的歌，使得她不再哭了，儘管她是那麼窮困，既沒有錢為她的丈夫買一口棺材，也弄不到東西吃。這一家人為她感到很難過。他們非常善良。他們現在既然又找回了小鳥，也就很樂意為窮女人的丈夫買一口棺材。他們對這個窮女人說，她可以每天到他們家裡來吃飯。她變得快樂起來，感謝上帝在她最悲哀的時候給她送來了這隻小金絲鳥。",
    "qas": [
      {
        "query_id": "65_0",
        "query_text": "誰從窗子鑽進來?",
        "answers": ["金絲鳥"]
      }
    ]
  },
  {
    "context_id": 66,
    "context_text": "這是一個禮拜天的早晨，射進房間里來的陽光是溫暖的，明朗的。柔和的新鮮空氣從敞開的窗子流進來。在外面，在上帝的藍天下，田野和草原上都長滿了植物，開滿了花朵；所有的小鳥兒都在這里歡樂地唱著歌。外面是一片高興和愉快的景象，但屋子里卻充滿了愁苦和悲哀。甚至那位平時總是興高采烈的主婦，這一天也坐在早餐桌旁邊顯得愁眉不展。最後她站起來，一口飯也沒有吃，揩干眼淚，向門口走去。從表面上看來，上天似乎對這個屋子降下了災難。國內的生活程度很高，糧食的供應又不足；捐稅在不斷地加重，屋子里的資財在一年一年地減少。最後，這里已經沒有什麼東西了，只剩下窮困和悲哀。這種情況一直把丈夫壓得喘不過氣來。他本來是一個勤儉和安分守己的公民；現在他一想到未來就感到毫無出路。的確，有好幾次他想結束他這個愁苦而無安慰的生活。他的妻子，不管心情是多麼好，不管她講什麼話，卻無法幫助他。他的朋友，不管替他出什麼世故的和聰明的主意，也安慰不了他。相反，他倒因此變得更沉默和悲哀起來。因此不難理解，他的可憐的妻子最後也不得不失去了勇氣。不過她的悲哀卻具有完全不同的性質，我們馬上就可以知道。當丈夫看到自己的妻子也變得悲哀起來，而且還想離開這間屋子的時候，他就把她拉回來，對她說：「你究竟有什麼不樂意的事情？在你沒有講清楚以前，我不能讓你出去。」她沉默了一會兒，深深地歎了一口氣，然後說：「嗨，親愛的，昨天夜里我做了一個夢。我夢見老上帝死掉了，所有的安琪兒都陪送他走進墳墓！」「你怎麼能想出、而且相信這樣荒唐的事情呢？」丈夫說。「你還不知道，上帝是永不會死的嗎？」這個善良的妻子的臉上露出了快樂的光芒。她熱情地握著丈夫的雙手，大聲說：「那麼老上帝還活著！」「當然活著！」丈夫回答說，「你怎能懷疑這件事呢？」于是她擁抱他，朝他和藹的眼睛里望——那雙眼睛里充滿了信任、和平和愉快的光。她說：「不過，親愛的，假如老上帝還活著，那麼我們為什麼不相信他，不依賴他呢？他數過我們頭上的每一根頭髮；如果我們落掉一根，他是沒有不知道的。他叫田野上長出百合花，他讓麻雀有食物吃，讓烏鴉有東西抓！」聽完了這番話以後，丈夫就似乎覺得蒙著他的眼睛的那層雲翳現在被揭開了，束著他的心的那根繩子被松開了。好久以來他第一次笑了。他感到他虔誠的、親愛的妻子對他所用的這個聰明的計策：這個辦法使他恢複了他所失去的對上帝的信心，使他重新有了依靠。射進這房子里的陽光現在更和藹地照到這對善良的人的臉上，熏風更涼爽地拂著他們面頰上的笑容，小鳥兒更高聲地唱出對上帝的感謝之歌。",
    "qas": [
      {
        "query_id": "66_0",
        "query_text": "誰夢到老上帝死掉了?",
        "answers": ["妻子"]
      }
    ]
  },
  {
    "context_id": 67,
    "context_text": "從前，在一座大城裡有個老媽媽，夜深了她仍獨自坐在自己的房間裡。她想著自己先是如何失去了丈夫，繼而又失去了兩個兒子，漸漸地又失去了所有的親戚，最後連她最後的朋友也離開了人世。現在只留下她孤零零的一個人，她心裡非常難過，然而最使她痛心的還是那兩個兒子的去世。她在痛苦之際向上帝傾訴，就這樣靜靜地坐在那兒沉思，突然聽到了早禱的鐘聲，她覺得非常奇怪，原來自己竟在悲哀中熬過了一整夜。於是她點亮了燈去了教堂。她到達時，教堂裡已是一片明亮，但不是平常的蠟燭，而是彌滿著黎明的光輝。裡面已擠滿了人，所有的位子都給佔了。老媽媽走向她平常坐的位子，可那兒也被人佔著，整個凳子都被坐滿了。她看了看這些人，盡是她死去的親戚。他們都穿著老式的舊衣服坐在那兒，一個個臉色蒼白。他們既不說話也不唱歌，可教堂裡卻響著輕柔的嗡嗡呢喃聲。這時她一個死去的姨媽站了起來，走上前，對這可憐的老媽媽說：“向祭壇那邊瞧，你就會見到你的兒子們。”老媽媽朝祭壇望去，果然見到了她的兩個兒子，一個吊在絞架上，一個綁在車輪上。只聽見那位姨媽說：“你看，如果他們還活著，上帝不會把他們當作清白無邪的孩子給招回去的，那他們的下場就會是這樣子了。”老人戰戰兢兢地回到家中，跪在地上感謝上帝，感謝他待自己好得超出了自己的理解。兩天後，她躺在床上死了。",
    "qas": [
      {
        "query_id": "67_0",
        "query_text": "老媽媽朝哪望去能見到兒子?",
        "answers": ["祭壇"]
      }
    ]
  },
  {
    "context_id": 68,
    "context_text": "一個牧羊人有一條很忠誠的狗，叫做蘇丹。蘇丹現在已經老了，連牙齒也掉完了。有一天，牧羊人和他的妻子站在房屋前，牧羊人說：“我準備明天上午把老蘇丹殺掉，因為它已經沒有用了。”妻子卻說道：“請把這條可憐的狗留下吧，它為我們忠心耿耿地服務了許多年，我們應該在它有生之年裡繼續供養它。”牧羊人反駁她說：“可我們留著它又能為我們做什麼事呢？它嘴裡沒有一顆牙齒，小偷根本不會在乎他。你說得不錯，它的確為我們做過不少事，但那是它謀生的方式，我們也不曾虧待牠呀！它現在這樣子，明天殺了它更好。”可憐的蘇丹就躺在他們身旁不遠處，它把牧羊人和他妻子的這番對話都聽了去，想到明天就是它的末日，它非常害怕。傍晚，它去了住在森林裡的好朋友狼那兒，把自己的事都告訴了它，說他的主人準備明天要將它殺死。狼聽了說道：“你先別慌，我給你出一個好主意。你的主人每天清晨都會帶著他們的小孩去地裡幹活，這你是知道的。他們幹活時，就會把小孩放在籬笆下的陰涼處。明天清晨你蹲在小孩附近，做出照看小孩的樣子，我從森林裡跑出來把小孩叼走，你必須裝做拚命追趕我的樣子，我也裝做驚慌的樣子扔下小孩逃走。然後你就可以把小孩帶回去了。經過這一鬧，你的主人一定會很感激你救回了他們的孩子，他們就會留下你，繼續供養你了。”狗非常贊賞這個辦法。第二天清晨，它們按計劃進行，狼剛把小孩叼走跑不多遠，牧羊人和他妻子就驚慌地叫喊起來。這時候，老蘇丹跳起來奮力向狼追去，很快就追上了狼，並幫它的男主人和女主人救回了那可憐的小傢伙。看見小孩安然無恙，牧羊人拍了拍蘇丹的頭，說道：“老蘇丹，你從狼口裡救回了我們的孩子，我不會再殺你了，還要好好地養活你，給你好多吃的東西。”說完又轉頭對妻子說：“走！回家去吧，給老蘇丹做一頓好吃的，把我的舊靠墊做窩給它睡，讓它過得好一點。”從這以後，蘇丹終於如願以償，過上了倍受主人家青睞的生活。不久，狼來向蘇丹祝賀，同時對它說：“我的好朋友，現在你也該幫我個忙了，我很久沒吃過一頓飽餐了，就請你在我抓吃你主人的肥羊時，把頭調過去，只當沒看見。”蘇丹說：“那不行，我得忠於我的主人。”狼聽了之後，以為它不過是說說笑話，不會認真對待此事的。晚上，它跑來準備抓隻羊美餐一頓，但蘇丹把狼的企圖告訴了主人。主人躲在羊圈的門後面，等候著狼的到來。狼來了以後，主人等它正忙著物色肥羊時，一記悶棍狠狠地打在了它的背上，連背上的毛都掉下了好大一撮，狼倉皇逃走了。挨了這一棍，狼非常氣憤，它叫蘇丹是“一個老雜種”，發誓要對它進行報復。第二天早晨，狼派野豬來挑戰，要蘇丹到森林裡去，以決鬥的方式來解決它們之間的事。此刻，蘇丹除了主人家的一隻三條腿的瘸腳貓外，再也找不到第二個幫手，它只好叫上這只貓和它一道前往。這可憐的貓跛著腿走起路來極不方便，所以就把尾巴舉起來平衡身子。狼和野豬先在路上等著蘇丹，當它們發現對方時，遠遠看見貓豎在空中那長長的尾巴，以為那是貓為幫助蘇丹決鬥而帶來的一把刀。貓走起來一跛一跛的，它們以為貓每跛一次，就拾起了一塊石頭，是準備用來向它們投擲的。看到這情況，它們倆心裡害怕起來，打起了退堂鼓，說最好取消決鬥為好。說完，野豬急急忙忙地藏進了灌木叢裡，狼跳到一棵大樹上。蘇丹和貓不久就走了過來，四下一瞧，很奇怪它們怎麼還沒來。然而，野豬這時還沒有把自己完全藏好，它的耳朵還露在灌木叢外面，就在它的耳朵輕輕晃動之際，那隻貓覺察到有東西在灌木叢中晃動，以為是一隻老鼠，跳起來撲了上去，又是撕咬又是抓撓。野豬受不了了，它又是跳又是叫，一邊逃跑，一邊大聲叫道：“快看樹上，那上面坐的才是你們要找的對頭。”蘇丹和貓一齊向樹上望去，後見狼正坐在樹枝上，它們叫它是一個膽小鬼，不准它下來。狼十分羞愧，就答應和蘇凡講和，這樣它和老蘇丹又成了好朋友。",
    "qas": [
      {
        "query_id": "68_0",
        "query_text": "狼派誰來挑戰蘇丹?",
        "answers": ["野豬"]
      }
    ]
  },
  {
    "context_id": 69,
    "context_text": "有一個貧窮的老人和他的妻子，他們想把馬賣掉，或者換些對他們更有用的東西。但是應該換些什麼呢？ 「老頭子，你知道得最清楚呀！」老太太說，「今天鎮上趕集，你騎著馬到城裡去，換點好東西吧。」於是她替他準備好早點，然後用手掌心拍拍他的光禿禿的腦袋，還親了一下他的臉蛋。太陽照得像火一樣。這時有個人趕著一頭母牛走來，這母牛很漂亮。 「它一定能產出最好的奶！」老人想，「把馬兒換一頭牛吧一這一定很合算。」於是，他用他的馬和人家換了一頭牛。老人很快地向前走，牛也很快地向前走。不一會兒他們遇到一個趕羊的人。這是一隻很漂亮的羊，非常健壯，毛也好。老人心想：「冬天，羊可以跟我們一起待在屋子裡。」於是，他用他的牛和人家換了一隻羊。然後，他在路上看見一個人，這人手臂下夾著一隻大鵝。它的毛很多，而且又很肥！ 「如果把它放在我們的小池子裡，倒是蠻好的呢。現在，我的太太可以有一隻鵝了。」於是，他用他的羊和人家換了一隻鵝。他又看見一隻短尾巴的雞，它不停地眨著眼睛，看起來挺漂亮。 「咕！咕！」於是，他用他的鵝和人家換了一隻雞。正當老人想去喝一杯燒酒時，一個伙計背著滿滿一袋子的爛蘋果走來。 「這堆東西可不少！總算是一筆財產呀！」他想。於是，他用他的雞和人家換了一袋爛蘋果。一同喝酒的朋友說：「你看著吧，回家後，你老婆一定會打你一頓。」「我將會得到一個吻，而不是一頓痛打，」老人說，「我的太太將會說，老頭子做事總不會錯。」喝酒的朋友不相信，他們決定用一斗金幣來和老人打賭。回到家，老人把交換每一樣東西的經過告訴老太太時，都得到了老太太的讚賞。當看到老頭子換來的一袋爛蘋果時，老太太高興極了：「謝謝你，我的好丈夫！你做的事總不會錯的。」她說完這話後就在他的臉上親了一個響亮的吻。「我喜歡看這幅情景！」那喝酒的朋友說，「老是走下坡路，卻老是快樂。這件事本身就值錢。」於是，這對貧窮的老人得到了一斗金幣。",
    "qas": [
      {
        "query_id": "69_0",
        "query_text": "老人用什麼換一隻雞?",
        "answers": ["鵝"]
      }
    ]
  },
  {
    "context_id": 70,
    "context_text": "從前，有一隻老鼠、一隻小鳥和一根香腸住在一個家裡，它們和睦相處，生活充滿了幸福和快樂。他們分工合作，積累不斷增加，變得十分富裕。小鳥每天飛到森林裡去銜柴回來；老鼠擔水，生火，佈置飯桌；香腸則負責做飯。一個人生活太順暢，就會開始變懶，會想著法子玩新花樣。有一天，小鳥遇到了另外一個朋友，它向朋友很自豪談起自己生活的愜意現狀。那隻鳥卻嘲笑它是一個可憐的傻瓜，說它辛辛苦苦在外面幹活，另兩個夥伴待在家裡幹輕鬆的活：老鼠每天生火、擔水之後就回到自己的房間裡躺下休息，到了吃飯的時候才去擺好桌椅，舖上桌布。香腸則坐在鍋子旁，除了看食物烹煮的情況外，什麼事都不做。到了要吃飯的時候，只加一點油、鹽就算了事，不到一分鐘就乾完了。小鳥聽了這些話，心裡很不是滋味。它飛回家，把柴擔放在地上。大家和平時一樣一起坐在桌子邊吃飯，進餐之後又都回房睡覺，一直睡到第二天早晨起來。還有什麼生活比這種默契、合理分工的生活更令人滿意呢？可是小鳥受了朋友的挑撥，第二天不想到森林裡去了，還說自己一直在服待它們兩個，做了很久的傻子，現在應該交換一下工作，家務事應該大家輪著來幹。儘管老鼠和香腸苦苦勸說，講明它們這樣分工最合理，這樣才可能繼續維持正常的生活。但小鳥聽不進去，堅持它的提議。最後，它倆只好順著它。它們用抽籤的方式決定了這樣的分工：香腸去背柴，老鼠做飯，小鳥去擔水。人要是離開了適合自己幹的工作崗位時，會有什麼結果呢？香腸出發到森林裡去了，小鳥生起火，老鼠架好鍋子，只等香腸回家擔來第二天用的柴枝。但香腸去了很久都沒有回來，它倆意識到它一定出事了。小鳥馬上飛出去沿著小路去找香腸，但它飛了不遠就發現路上有一條狗，狗說它遇到了可憐的小香腸，把它當作可以捕食的獵物抓起來吃掉了。小鳥指責狗公開搶劫，行兇殺人。但一切話都已毫無用處，因為狗說它發現香腸從事的工作與它的身份不符合，斷定它是偽裝的間諜，這樣才把它殺死的。小鳥非常傷心地銜起柴枝回到家裡，把自己所看到和聽到的都告訴了老鼠。他和老鼠都很悲痛，但它們兩個商定，最好還是住在一起。小鳥把桌子舖好了，老鼠把菜也做好了，但當老鼠去盛菜時，熱氣一沖，它一子就掉進了鍋裡，連淹帶燙死去了。小鳥來到廚房想把飯菜端到桌子上去，可它沒有看到廚師。它把柴枝翻來翻去扔得到處都是，這裡叫，那裡喊，每個地方都尋遍了，就是找不到廚師。就在這時，灶裡的火掉到柴枝上，柴枝馬上燃了起來。小鳥急忙去擔水，但匆忙間又把木桶掉到井裡去了，它也跟著一起掉了下去。一個好端端的家庭就這樣完了。",
    "qas": [
      { "query_id": "70_0", "query_text": "誰負責做飯?", "answers": ["香腸"] }
    ]
  },
  {
    "context_id": 71,
    "context_text": "從前，一輛裝滿酒的車陷在路上了，車伕使盡了全身力氣，車子仍是紋絲不動地陷著。這時聖母恰巧打這兒經過，她看到這可憐的人給難住了，便對他說：“又累又渴，給我一杯酒，我會把你的車子弄出來的。”“我很樂意，”車伕回答道，“可我手頭沒有杯子來給你斟酒呀！”於是聖母摘下了一朵帶紅條的小白花，給了馬車伕，這花叫野旋花，很像一只玻璃杯。車伕斟上滿滿一杯酒，聖母喝完後，車子就出來了，車伕可以繼續趕路了。從此這種小花便一直被人稱作“聖母的小酒杯。”",
    "qas": [
      {
        "query_id": "71_0",
        "query_text": "什麼被人稱作聖母的小酒杯?",
        "answers": ["野旋花"]
      }
    ]
  },
  {
    "context_id": 72,
    "context_text": "從前有個小牧童，由於別人無論問什麼，他都能給出個聰明的回答，因而名聲遠揚。那國的國王聽說了，不相信他有這麼厲害，便把牧童招進了宮。國王對他說：“如果你能回答我所提出的三個問題，我就認你做我的兒子，讓你和我一起住在宮裡。”牧童問：“是什麼問題呢？”國王說：“第一個是：大海裡有多少滴水？”小牧童回答：“我尊敬的陛下，請你下令把世界上所有的河流都堵起來，不讓一滴水流進大海，一直等我數完他才放水，我將告訴你大海裡有多少滴水珠。 ”國王又說：“第二個問題是：天上有多少星星？”牧童回答：“給我一張大白紙。”於是他用筆在上面戳了許多細點，細得幾乎看不出來，更無法數清。任何人要盯著看，準會眼花繚亂。隨後牧童說：“天上的星星跟我這紙上的點兒一樣多，請數數吧。”但無人能數得清。國王只好又問：“第三個問題是：永恆有多少秒鐘？”牧童回答：“在後波美拉尼亞有座鑽石山，這座山有兩英里高，兩英里寬，兩英里深；每隔一百年有一隻鳥飛來，用它的嘴來啄山，等整個山都被啄掉時，永恆的第一秒就結束了。”國王說：“你像智者一樣解答了我的三個問題，從今以後，你可以住在宮中了，我會像親生兒子一樣來待你的。”",
    "qas": [
      {
        "query_id": "72_0",
        "query_text": "國王把誰招進宮裡?",
        "answers": ["小牧童"]
      }
    ]
  },
  {
    "context_id": 73,
    "context_text": "一望無際的草原上，每年都會舉辦跳高比賽，花鹿斑斑是去年冠軍，正在刺槐樹下汗流浹背地加緊練習。「斑斑，跳高冠軍的頭銜固然重要，但想要在草原上生存，『跑步』才是保命符，要不要跟我們一起練習呢？」「謝謝你的提醒，我的好朋友依依。」斑斑嘴裡雖然這麼說，卻打從心裡瞧不起這群只會成天跑步的傢伙。斑斑奮力一躍，吃到了平日只有長頸鹿才吃得到的葉子，甜美多汁，卻改變不了牠在花鹿群裡跑步最慢的事實。往年雨量豐沛，草原一片翠綠，獅子的黃毛皮極易被發現，但今年雨量稀少，草原一片枯黃，反而成了獅子的天然保護色！一對花鹿母子在草原邊玩耍，小鹿突然問：「媽咪，那邊的草怎麼自己會動？」母鹿一看大叫：「不得了，獅子來了，大家快跑！」大伙兒一聽到喊叫，嚇得本能地拔腿就跑，依依也大喊：「斑斑，獅子來了，快跑！」「沒事的！」斑斑恍若未聞，仍然在做牠的跳高練習。當斑斑發現獅子朝自己追來，嚇得想往前跑，不過因為平日疏於練習，竟然還在原地不斷跳躍，大伙兒被嚇出一身冷汗，依依靈機一動，叫大家一起大喊：「獵人來了，大家快逃命！」獅子一聽到獵人插手，吃過虧的牠十分清楚獵人的手段，只好放棄到嘴的食物。斑斑在鬼門關前走了一遭，終於體會出要在草裡上生存，得先保住性命，才有餘力發展自己最愛的興趣呢！",
    "qas": [
      {
        "query_id": "73_0",
        "query_text": "誰是去年跳高冠軍?",
        "answers": ["斑斑"]
      }
    ]
  },
  {
    "context_id": 74,
    "context_text": "從前有一個驕傲的茶壺，它對它的瓷感到驕傲，對它的長嘴感到驕傲，對它的那個大把手也感到驕傲。它的前面和後邊都有點什麼東西！前面是一個壺嘴，後面是一個把手，它老是談著這些東西。可是它不談它的蓋子。原來蓋子早就打碎了，是後來釘好的；所以它算是有一個缺點，而人們是不喜歡談自己的缺點的，當然別的人會談的。杯子、奶油罐和糖缽，這整套喫茶的用具，都把茶壺蓋的弱點記得清清楚楚。談它的時候比談那個完好的把手和漂亮的壺嘴的時候多。茶壺知道這一點。「我知道它們！」它自己在心裡說，「我也知道我的缺點，而且我也承認。這足以表現我的謙虛，我的樸素。我們大家都有缺點；但是我們也有優點。杯子有一個把手，糖缽有一個蓋子。我兩樣都有，而且還有他們所沒有的一件東西。我有一個壺嘴；這使我成為茶桌上的皇后。糖缽和奶油罐受到任命，成為甜味的僕人，而我就是任命者——大家的主宰。我把幸福分散給那些乾渴的人群。在我的身體裡面，中國的茶葉在那毫無味道的開水中放出香氣。」這番話是茶壺在它大無畏的青年時代說的。它立在鋪好台佈的茶桌上，一隻非常白嫩的手揭開它的蓋子。不過這只非常白嫩的手是很笨的，茶壺落下去了，壺嘴跌斷了，把手斷裂了，那個壺蓋也不必再談，因為關於他的話已經講得不少了。茶壺躺在地上昏過去了；開水淌得一地。這對它說來是一個嚴重的打擊，而最糟糕的是大家都笑它。大家只是笑它，而不笑那隻笨拙的手。「這次經曆我永遠忘記不了！」茶壺後來檢查自己一生的事業時說。 「人們把我叫做一個病人，放在一個角落裡；過了一天，人們又把我送給一個討剩飯吃的女人。我下降為貧民了；里里外外，我一句話都不講。不過，正在這時候，我的生活開始好轉。真是塞翁失馬，焉知非福。我身體裡裝進了土；對於一個茶壺說來，這完全是等於入葬。但是土裡卻埋進了一個花根。誰放進去的，誰拿來的，我都不知道。不過它既然放進去了，總算是彌補了中國茶葉和開水的這種損失，也算是作為把手和壺嘴打斷的一種報酬。花根躺在土裡，躺在我的身體裡，成了我的一顆心，一顆活著的心——這樣的東西我從來還不曾有過。我現在有了生命、力量和精神。脈搏跳起來了，花根發了芽，有了思想和感覺。它開放成為花朵。我看到它，我支持它，我在它的美中忘記了自己。為了別人而忘我——這是一樁幸福的事情！它沒有感謝我；沒有想到我；它受到人們的崇拜和稱贊。我感到非常高興；它一定也會是多麼高興啊！有一天我聽到一個人說它應該有一個更好的花盆來配它才對。因此人們把我當腰打了一下；那時我真是痛得厲害！不過花兒卻遷進一個更好的花盆裡去了。至於我呢？我被扔到院子裡去了。我躺在那兒簡直像一堆殘破的碎片，但是我的記憶還在，我忘記不了它。",
    "qas": [
      {
        "query_id": "74_0",
        "query_text": "茶壺不談它的什麼?",
        "answers": ["蓋子"]
      }
    ]
  },
  {
    "context_id": 75,
    "context_text": "從前有一個貧窮的農夫名叫螃蟹，趕著兩頭牛拉了一車木頭進城，以二個金幣的價格將木頭賣給了一個大夫。大夫一邊給他點錢，一邊坐在桌旁吃飯，農夫看見大夫的飯菜如此豐盛，從內心感到羨慕，心想如果自己也是大夫該多好。他站在那裡楞了一會兒，終於不好意思地問他是否也能當一名大夫。 “噢，可以，”大夫說：“那很好辦。”“我該作什麼？”農夫接著問。“首先買一本卷首有一隻公雞的入門書；然後將你的牛車和兩頭牛換成錢，給自己買些衣服和隨便一些與醫藥有關的物品；最後做一塊招牌上面寫著：'我是萬事通大夫，'釘在你的門上邊。”農夫照此作好了一切，便開始行醫治病。時間不長，有一個大財主的錢財被盜，聽說在某某村莊有個萬事通大夫，他想他一定知道被盜的錢財在哪裡。於是大財主套上馬車，驅車奔向那個村莊，問螃蟹是不是萬事通大夫。沒錯，我就是，他答道。財主邀請他同去把被偷盜的錢財找回來。 “噢，可以，可是我的老婆，革裡特也必須去。”財主同意了，請他們二人上車，一同上了路。當他們到了那位大人物的豪宅時，餐桌已經擺好，螃蟹被邀請入座就餐。 “好吧，可是我的老婆，革裡特也得入座呀。”他說，然後和他的老婆一塊坐在了桌旁。這時第一個僕人端著一盤精美的菜餚進來，農夫用胳膊肘推了他老婆一下說：“革裡特，這是第一個。”他的意思是這是第一道菜。然而那個僕人卻以為是說：“這是第一個賊。”實際上他就是賊，所以他十分害怕，跟外邊的同夥說：“大夫全都知道，我們可要倒霉啦，他說我是第一個。”第二個不敢進來了，可是他不得不進來。當他端著菜進來時，農夫用胳膊肘推了他老婆一下說：“革裡特，這是第二個。”這個僕人同樣嚇得不輕，馬上抽身出來了。第三個也是被嚇得心驚肉跳，因為農夫又說了聲：“革裡特，這是第三個。”第四個端著一個蓋著蓋子的盤子，財主請大夫顯示一下他的才能，猜猜蓋子底下是什麼。盤子裡裝的是螃蟹。大夫盯著盤子看，可是實在不知說什麼好，他哀歎道：“唉，可憐的螃蟹呀。”財主一聽就大喊：“太棒啦！他知道裡面是什麼，他一定也知道錢在哪兒！”看到這一切，僕人們的神色格外緊張，他們暗示大夫能不能出去一小會兒。於是他就出去了，四個僕人都坦白說是他們偷了錢，並且許諾如果他不揭發他們，他們願意將錢還回而且給他一大筆錢作為酬謝，否則他們會被絞死。他們帶他到了藏錢的地方。他胸有成竹地回到大廳，在桌旁落座後說道：“我的老爺，現在我要從我的書中查找藏金子的地方。”這時，第五個僕人爬進壁爐裡想聽聽大夫還知道些什麼。可是大夫坐著一動不動，打開他的入門書，將書頁來回翻著，尋找那隻公雞。由於一時找不著，他就說：“我知道你就在那兒，所以你最好是自己出來！”那位在壁爐裡的老兄誤認為大夫是指他，真是驚恐萬分，一下子跳了出來，使勁嚷：“那個人真是神掐妙算，無所不知！”這時萬事通大夫告訴了財主藏錢的地方，卻沒有告訴他是誰偷的，結果雙方都給了他酬金，他也由此成了名人。",
    "qas": [
      {
        "query_id": "75_0",
        "query_text": "貧窮的農夫叫什麼?",
        "answers": ["螃蟹"]
      }
    ]
  },
  {
    "context_id": 76,
    "context_text": "陽光斜射在大樹上，輕風掠過，一片嫩嫩的、翠翠的小小葉子，隨風飄落在樹邊的小溪中。好清涼啊！能在這裡自由的飄蕩，是小小葉子仰望已久的夢想，它歡快的游暢著，要去實現自己的一個願望！游啊游，游啊游！溪邊的花草叫住了它：「小小葉子，你要去哪裏」？「我要去人類，實現我的願望」！花草忙說：「不可，不可，太危險了，那裏充滿著謊言與殘惡」！小小葉子沒有停下來，繼續游暢著，喃喃的說：「那裏應該充滿著真誠與忍讓」！游啊游，游啊游！柳樹阿姨叫住了它：「小小葉子，你要去哪裏」？「我要去人類，實現我的願望」！柳樹阿姨忙說：「不可，不可，那裏的邪惡正在迫害善良」！小小葉子沒有停下，喃喃的說：「那我就化做一股正的力量，去制止它的猖狂」！游啊游，游啊游！嬉戲的鴨群叫住了它：「小小葉子，你要去哪裏」？「我要去人類，實現我的願望」！鴨群忙說：「不可，不可，那個社會裏假、惡、斗提倡；真、善、忍不讓，以你小小的力量，怎能改變那裏的模樣，快回來」！小小葉子再也沒有停下，喃喃的說：「無數個小小的力量，就可匯成一堵不可抵擋的正義之牆」！游了好久，一身疲憊的小小葉子再也游不動了。忽然看到溪邊一個小男孩，捧著一本金光閃閃的「佛經」。一股從未感覺到的祥和、寧靜的氣氛使小小葉子不由自主的向溪邊靠近，拚命的向他打招呼，可男孩卻怎麼也聽不到，絕望的小小葉子低下頭吟吟的哭泣！這時，小男孩放下書，來到清澈的小溪邊洗手，無意間看到了一片嫩嫩的、翠翠的小小葉子，心生喜愛，拾了回來、曬乾，把它夾在書中做成一個小小的書籤！小小葉子開心的笑了，願望終於實現了!這一刻，它等了好久、好久……",
    "qas": [
      {
        "query_id": "76_0",
        "query_text": "小男孩捧著一本什麼?",
        "answers": ["佛經"]
      }
    ]
  },
  {
    "context_id": 77,
    "context_text": "在一陣大雷雨以後，當你走過一塊蕎麥田的時候，你常常會發現這裡的蕎麥又黑又焦，好像火焰在它上面燒過一次似的。這時種田人就說：「這是它從閃電得來的。」但為什麼它會落得這個結果？我可以把麻雀告訴我的話告訴你。麻雀是從一棵老柳樹那兒聽來的。這樹立在蕎麥田的旁邊，而且現在還立在那兒。它是一株非常值得尊敬的大柳樹，不過它的年紀很老，皺紋很多。它身體的正中裂開了，草和荊棘就從裂口里長出來。這樹向前彎，枝條一直垂到地上，像長長的綠頭髮一樣。周圍的田裡都長著麥子，長著裸麥和大麥，也長著燕麥，是的有最好的燕麥。當它成熟了的時候，看起來就像許多落在柔軟的樹枝上的黃色金絲鳥。這麥子立在那兒，微笑著。它的穗子越長得豐滿，它就越顯得虔誠，謙卑，把身子垂得很低。可是另外有一塊田，裡面長滿了蕎麥。這塊田恰恰是在那株老柳樹的對面。蕎麥不像別的麥子，它身子一點也不彎，卻直挺挺地立著，擺出一副驕傲的樣子。 「作為一根穗子，我真是長得豐滿」它說。「此外我還非常漂亮，我的花像蘋果花一樣美麗，誰看到我和我的花就會感到愉快。你這老柳樹，你知道還有什麼別的比我們更美麗的東西嗎？」柳樹點點頭，好像想說：「我當然知道！」不過蕎麥驕傲地擺出一副架子來，說：「愚蠢的樹！它是那麼老，連它的肚子都長出草來了。」 這時一陣可怕的暴風雨到來了：田野上所有的花兒，當暴風雨在它們身上經過的時候，都把自己的葉子捲起來，把自己細嫩的頭兒垂下來，可是蕎麥仍然驕傲地立著不動。「像我們一樣。把你的頭低下來呀」花兒們說。「我不須這樣做」蕎麥說。「像我們一樣，把你的頭低下來呀」麥子大聲說。「暴風的安琪兒現在飛來了。他的翅膀從雲塊那兒一直伸到地面;你還來不及求情，他就已經把你砍成兩截了。」「對，但是我不願意彎下來」蕎麥說。「把你的花兒閉起來，把你的葉子垂下來呀」老柳樹說。 「當雲塊正在裂開的時候，你無論如何不要望著閃電：連人都不敢這樣做，因為人們在閃電中可以看到天，這一看就會把人的眼睛弄瞎的。假如我們敢於這樣做，我們這些土生的植物會得到什麼結果呢?況且我們遠不如他們。」「遠不如他們!」蕎麥說。 「我倒要瞧瞧天試試看。」它就這樣傲慢而自大地做了。電光掣動得那麼厲害，好像整個世界都燒起來了似的。當惡劣的天氣過去以後，花兒和麥子在這沉靜和清潔的空氣中站著，被雨洗得煥然一新。可是蕎麥卻被閃電燒得像炭一樣焦黑。它現在成為田裡沒有用的死草。那株老柳樹在風中搖動著枝條;大顆的水滴從綠葉上落下來，好像這樹在哭泣似的。於是麻雀便問：「你為什麼要哭呢?你看這兒一切是那麼令人感到愉快；你看太陽照得多美，你看雲塊飄得多好。你沒有聞到花兒和灌木林散發出來的香氣嗎?你為什麼要哭呢，老柳樹？」於是柳樹就把蕎麥的驕傲、自大以及接踵而來的懲罰講給它們聽。我現在講的這個故事是從麻雀那兒聽來的。有一天晚上我請求它們講一個童話，它們就把這件事情講給我聽。",
    "qas": [
      {
        "query_id": "77_0",
        "query_text": "誰被閃電燒的像炭一樣焦黑?",
        "answers": ["蕎麥"]
      }
    ]
  },
  {
    "context_id": 78,
    "context_text": "一隻蝨子和一隻跳蚤合住一室。有一天，它們在雞蛋殼裡釀啤酒，蝨子一不小心掉了進去，被燙傷了。小跳蚤於是大呼小叫起來。小房門問它：“小跳蚤，你幹嘛尖叫呀？”“蝨子被燙傷了。”小房門於是吱吱嘎嘎響了起來角落裡的掃把聽到了，問：“小房門，你為什麼叫呀？”“難道不該叫嗎？小蝨子燙傷了自己，小跳蚤在傷心地哭泣。 ”小掃把聽了便瘋狂地掃起地來。一輛小拖車路過時問：“你干嘛掃地呀，小掃把？”“我難道不該掃嗎？小蝨子燙傷了自己，小跳蚤在傷心地哭泣。小房門在一個勁地嘎吱嘎吱。”小拖車聽了於是說：“那我就跑起來吧。”說著便瘋了似地狂奔。經過一堆餘燼時，餘燼問：“你怎麼跑得這麼急呀，小拖車？”“我難道不該跑嗎？小蝨子燙傷了自己，小跳蚤在傷心地哭泣，小房門在拚命地嘎吱嘎吱，小掃把在一個勁地掃地。”余燼於是說：“那就讓我熊熊燃燒起來吧。”說著就燃起了火焰。它旁邊的一棵小樹問它：“你怎麼又燒起來了？”“我難道不應該燃燒嗎？小蝨子燙傷了自己，小跳蚤在傷心地哭泣，小房門在拚命地嘎吱嘎吱，小掃把在一個勁地掃地，小拖車也在奔跑不息。”小樹於是說：“我看我該搖晃自己才是。”說著就不停地搖晃起來，把樹葉抖落得滿地都是。一個拎著水罐的小姑娘走了過來，看到小樹便問：“小樹呀，你幹嘛這麼甩自己呀？”“我難道不應該甩嗎？小蝨子燙傷了自己，小跳蚤在傷心地哭泣，小房門在拚命地嘎吱嘎吱，小掃把在一個勁地掃地，小拖車在奔跑不息，連餘燼也重新燃起了自己。”小姑娘一聽，說：“那我也該摔碎這水罐。”說著就將水罐摔了個粉碎。冒水的泉眼問：“姑娘，你為啥摔破水罐呢？”“我難道不應該摔嗎？小蝨子燙傷了自己，小跳蚤在傷心地哭泣，小房門在拚命地嘎吱嘎吱，小掃把在一個勁地掃地，小拖車也奔跑不息，小樹也在不住地搖曳。”“哦，哦！”泉眼說，“那我就該使勁流才是。”於是開始一個勁地流淌。於是一切都被水淹沒了：小姑娘，小樹，餘燼，小拖車，掃把，小房門，小跳蚤和小蝨子，全淹沒了。",
    "qas": [
      { "query_id": "78_0", "query_text": "誰被燙傷了?", "answers": ["蝨子"] }
    ]
  },
  {
    "context_id": 79,
    "context_text": "從前有一個小孩，她的媽媽每天下午給她一小碗牛奶和一些麵包，讓她端著食物坐在院子裡。每當她開始吃的時候，就有一隻蛤蟆從一個牆洞裡爬出來，把它的小腦袋伸進盤子裡同她一起吃。孩子很高興這樣，只要她端著小盤子坐在那兒的時候，蛤蟆沒同時出來，她就會高聲唱：“蛤蟆，蛤蟆，快出來，到這裡來，你這個小東西，吃點麵包，喝點奶，吃好，喝好，身體好。”這時蛤蟆會急忙出來，津津有味地吃起來。為了表示它的謝意，蛤蟆從洞裡搬出了它珍藏的各式各樣的寶物，寶石呀，珍珠呀，和金子的玩具呀。可是蛤蟆只喝牛奶卻不吃麵包渣。一天，小孩子用她的小勺子輕輕地敲了敲蛤蟆的腦袋說：“小傢伙，你也得吃麵包渣呀。”在廚房裡的媽媽聽見了小孩子在和誰說話便往外看，當她看見小孩子正用勺子敲一隻蛤蟆時，她抄起一根長木頭沖了出去，把那隻善良的小生靈打死了。從那時開始小孩就變了，那蛤蟆與她一同進餐的時候，她長得又高又壯，可是現在她失去了紅紅的臉蛋，而且越來越瘦。不久送葬鳥在夜裡開始哭喪，紅胸鴝銜來樹枝和樹葉編成了一個花圈，不久小孩子就躺在了靈床上。",
    "qas": [
      {
        "query_id": "79_0",
        "query_text": "誰只喝牛奶卻不吃麵包渣?",
        "answers": ["蛤蟆"]
      }
    ]
  },
  {
    "context_id": 80,
    "context_text": "從前，有兩個王子想到外面的世界去長見識。出去不久，卻過起了揮金如土的腐化生活，根本不想再回家了。他們的弟弟，一個毫不起眼的小矮子，出門要去尋找他的兩個哥哥。當他經過千辛萬苦找到他們後，他們卻嘲笑他，說他年輕，不懂世務，應該想辦法出去遊歷，他們如此聰明，對這個世界有時也還不能應付。這樣，他們三人一起踏上了遊歷的旅程。他們首先遇到的是一座蟻穴。兩個哥哥要把它推倒挖開，想看看那些可憐的螞蟻在驚慌之下是如何亂竄，如何搬運它們的蟻卵的。但小矮子卻說：“讓這些可憐的小生靈自由地生存吧，我不能容忍你們給它們添麻煩，擾亂它們安寧的生活。”在他的極力反對下，兩個哥哥只得打消念頭，從旁邊走了過去。不久，他們來到了一個湖泊旁，湖中水面上有許許多多的野鴨在游動。兩個哥哥想抓兩只鴨子來烤了吃，但小矮子說：“讓這些可憐的生靈自由地生存吧，你們不要殺死它們。”在他的反對下，他們只好又走了。隨後他們來到一棵大樹前，蜜蜂在樹幹上的一個洞內築起了一個大蜂巢，好多蜂蜜從樹幹上流了下來。兩個哥哥要在樹下放一把火，把蜜蜂統統燒死，以便得到樹洞內的蜂蜜。但小矮子攔住他們說：“讓這些可憐的小蜜蜂自由自在地生存吧，我不能讓你們燒死它們。”最後，三個兄弟來到了一座城堡，他們經過馬廄時，看到一些駿馬站在裡面，但都是一些大理石做的，城堡裡看不到一個人。他們穿過一間又一間房子，終於發現了一扇上面有三把鎖的門，門上有一個窗口，從窗口可以看到房子裡的一切。往裡面一瞧，他們發現房子裡的一張桌子旁坐著一個頭髮花白的老人。他們連叫了兩聲，那老人都沒有聽見，叫第三聲時，他才站起來要他們把鎖打開，讓他走出房間。出來後，他一句話也沒說，也不許他們亂動，默默地將他們領到了一張漂亮的桌子旁，桌子上面擺滿了各種好吃的東西。吃飽喝足之後，他又給他們每人安排了一間臥室睡覺，然後就一聲不吭地走了。第二天早晨，他來到老大的臥室，將老大帶出房間，來到一張大理石桌子前。桌子旁邊有三個石碑，看了碑上的刻文，老大才知道這個城堡竟是被魔法控制著，因為石碑上刻著的是如何才能把這座城堡從魔力控制之下解脫出來的方法。第一條碑文是：在森林的苔蘚下面，散落著公主的一千顆珍珠，必須把它們全部找到，如果在太陽下山前還缺一顆沒找齊，那個尋找的人就將變成大理石。大哥出發了，他找了一整天，但夜幕降臨時，他找到的珍珠還不到一百顆，所以，他像碑文上所說的一樣變成了石頭。第二天，二哥也冒險去了。但他的結果也不比大哥好多少，他只找到一百顆珍珠，因此同樣變成了石頭。最後輪到小矮子了，他在苔蘚中翻找著。可要找到珍珠實在太困難了，這活也太苦太累，他傷心地坐在石頭上哭了起來。就在他處於絕望之時，曾被他救過的蟻王給他幫忙來了。它帶來了五千螞蟻，那些螞蟻很快就把所有的珍珠都找到了，並把它們搬在一起堆成了一大堆。第二條碑文說：必須把公主臥室的鑰匙從湖中撈出來。小矮子來到湖邊，那兩隻他救過的鴨子正在湖中戲水。它們看見他後，馬上游過來問他此行的目的，瞭解了他的困難後，鴨子們立即潛入水中，很快就從湖底把鑰匙撈了上來。第三件事最難，就是要從三個公主中找出最年輕，最美麗的小公主。但她們三個都一樣漂亮，長相完全相同。他得知的唯一線索就是大公主吃過一塊糖，二公主吃過一些糖漿，小公主吃過一滿勺的蜂蜜，他要找出到底是哪一個吃過蜂蜜。那個曾被小矮子救過、倖免於火災的蜂王來了。它在三個公主的嘴巴上嗅了嗅，最後停在了那個吃過蜂蜜的小公主嘴上，小矮子知道那一定就是小公主了。魔法被解除了，所有變成石頭的人都醒了過來，恢復了他們的本來面貌，小矮子和年青美麗的公主結了婚。公主的父親過世之後，小矮子當上了國王，他的兩個哥哥也娶了另外二個公主為妻子。",
    "qas": [
      {
        "query_id": "80_0",
        "query_text": "湖中水面上有什麼在游動?",
        "answers": ["野鴨"]
      }
    ]
  },
  {
    "context_id": 81,
    "context_text": "漁人碼頭在夕陽的餘暉下美得發亮，滿載而歸的漁船陸續回港，碼頭邊擠滿了前來購買漁獲的遊客。陸上的人群熙來攘往，水底下的螃蟹也不閒著，漁夫將過剩或殘缺的魚蝦順手丟入水中，便成了螃蟹們的大餐，不過大螃蟹總是仗著螫大體碩，將美食一掃而空，剩下的肉屑都不夠小螃蟹們塞牙縫！小不點就是這群小螃蟹的一員，長得既不夠大，兩隻螫瘦得跟竹籤似的，老是因為體格瘦弱而搶不到食物，心裡總是希望能夠快快長大。有一天，從水面上降下一個大竹籠，裡面的食物散發出一股濃烈的香氣，沒錯，是新鮮的海螺肉！大批螃蟹蜂擁而上，小不點不小心被擠在螃蟹群裡，也進了大籠子。等籠口一收，大螃蟹們還在你爭我搶，小不點不小心終於嘗到傳說中的「致命美食」！漁夫收起了竹籠子，將一隻隻大螃蟹放進身邊的大水桶裡，只見一大堆螃蟹爭著爬出滑不溜丟的塑膠桶，卻被困在裡面；而小不點竟然因為身體太小而鑽出竹籠，逃回水裡！死裡逃生的小不點瞬間成了大英雄，由於大螃蟹都被抓完了，於是小不點就成了當地的老大，有食物總是第一個吃到，沒多久，就成了道地的大螃蟹了！這一天，水面上又降下一個大竹籠，又是那充滿致命吸引力的海螺肉，這次小不點竟然衝第一到竹籠裡，大口享受著美味的大餐，心裡想著只要待會兒再鑽出竹籠就好了。等漁夫收起竹籠時，小不點這才發現自己的身體已經大到鑽不出去了，後悔自己因為貪吃而闖下大禍！",
    "qas": [
      {
        "query_id": "81_0",
        "query_text": "誰死裡逃生了大英雄?",
        "answers": ["小不點"]
      }
    ]
  },
  {
    "context_id": 82,
    "context_text": "李小鴨生活在一片藍得發亮的美麗湖畔，附近蘆葦叢生，魚蝦又多，是一處適合躲藏與覓食的好地方。李小鴨有個習慣，就是做事一板一眼，總會訂下許多規則，例如早上5點起床、6點吃第一餐，而且只能吃七分飽、中午小睡三十分鐘，一分不差，甚至與同伴玩遊戲，也要玩30分鐘休息5分鐘，規矩之多不勝枚舉。還好大家都了解牠的個性，久了也就不以為意，於是牠便有個外號叫「規矩鴨」。今天規矩鴨又出來湖邊覓食，由於最近食物短缺，牠只好游到更遠的湖邊，但這又違反牠的安全守則第三條規定：「不可以到陌生的環境遊玩或覓食！」只是餓得發慌，只好在邊緣徘徊，這樣就不算違規。「嗯，那我就在這裡覓食了！第一步，要先看看左右邊，確定沒有危險；第兩步，深吸一口氣；第三步，潛入水中；第四步，咬住小魚蝦或小蟲；第五步，浮出水面；第六步，游到湖邊大快朵頤一番！」這是規矩鴨自訂的「潛水覓食守則」，共六步，必須按部就班，一步都馬虎不得。正當規矩鴨潛入水裡咬到一條小魚，滿心歡喜地浮出水面，突然看到前面不遠處，有一個大嘴巴張在那裡！「規矩鴨，快逃命啊！鱷魚來了！」同伴發覺異狀大聲呼喊，規矩鴨一時失了方寸，嘴裡銜著小魚，還在數：「第六步，游到湖邊，糟了，小魚掉了，要重算了，現在是第幾步呢？」眼看鱷魚的嘴巴愈來愈近，規矩鴨還在算著牠的規矩，就快要成為鱷魚的點心，突然平靜的湖面傳來「砰」的一聲槍響，獵人也出現在附近，鱷魚嚇得一溜煙逃走了，反而救了規矩鴨一命。死裡逃生的規矩鴨深自反省，規矩固然重要，但適度的「彈性」似乎更適合自己。",
    "qas": [
      {
        "query_id": "82_0",
        "query_text": "誰做事一板一眼?",
        "answers": ["李小鴨"]
      }
    ]
  },
  {
    "context_id": 83,
    "context_text": "從前有一位王子，他想找一位公主結婚；但是她必須是一位真正的公主。所以他就走遍了全世界，要想尋到這樣的一位公主。可是無論他到什麼地方，他總是碰到一些障礙。公主倒有的是，不過他沒有辦法斷定她們究竟是不是真正的公主。她們總是有些地方不大對頭。結果，他只好回家來，心中很不快活，因為他是那麼渴望著得到一位真正的公主。有一天晚上，忽然起了一陣可怕的暴風雨。天空在掣電，在打雷，在下著大雨。這真有點使人害怕！這時，有人在敲門，老國王就走過去開門。站在城門外的是一位美麗的公主。可是，天哪！經過了風吹雨打之後，她的樣子是多麼難看啊！水沿著她的頭髮和衣服向下面流，流進鞋尖，又從腳跟流出來。她說她是一個真正的公主。「是的，這點我們馬上就可以考查出來。」老皇后心裡想，可是她什麼也沒說。她走進臥房，把所有的被褥都搬開，在床榻上放了一粒豌豆。於是她取出二十床墊子，把它們壓在豌豆上。隨後，她又在這些墊子上放了二十床鴨絨被。這位公主夜裡就睡在這些東西上面。早晨大家問她昨晚睡得怎樣。「啊，不舒服極了！」公主說「我差不多整夜沒有合上眼！天曉得我床上有件什麼東西？有一粒很硬的東西硌著我，弄得我全身發青發紫，這真怕人！ 」現在大家就看出來了，她是一位真正的公主，因為壓在這二十床墊子和二十床鴨絨被下面的一粒豌豆，她居然還能感覺得出來。除了真正的公主以外，任何人都不會有這麼嫩的皮膚的。因此那位王子就選她為妻子了，因為現在他知道他得到了一位真正的公主。這粒豌豆因此也就送進了博物館。如果沒有人把它拿走的話，人們現在還可以在那兒看到它呢。",
    "qas": [
      {
        "query_id": "83_0",
        "query_text": "老皇后在床榻上放了一粒什麼?",
        "answers": ["豌豆"]
      }
    ]
  },
  {
    "context_id": 84,
    "context_text": "從前有位王子，他走到了外面的世界，只見他心事重重，面帶憂傷。他抬頭看著天空，天是那般的碧藍，他歎息道：“一個人能在天堂上該有多好啊！”這時他看到了一位滿頭白發的老人向他走來，樣子十分可憐。他和老人打了聲招呼，並問：“我怎樣才能進天堂呢？”那人答道：“通過貧窮和謙卑！穿上我的破衣服，到人間去遊盪七年，去嘗貧困的滋味；不要錢，如果餓了，就向有同情心的人要點東西來充饑，這樣你就接近天堂了。”王子立刻脫下了華貴的外套，穿上了乞丐的衣服，步入了廣闊的世界，經歷了許多苦難。除了一點食物外，他絲毫不取，只祈求主帶他進天堂。七年過去了，他又回到了他父王的宮殿，但沒有人再認得他，他對僕人說：“快去稟告父王和母后，說我回來了。”但那些僕人不相信他的話，並嘲笑他，讓他一直呆在那兒。他又說：“去把我的王兄們叫來，我想再見見他們。”僕人對他的話仍無動於衷。終於有一個去報告了王子們。但他們也不信，也不理會他。王子又給他母后寫了封信，向他描述了自己經歷的苦難，只是沒提自己就是她的兒子。出於憐憫，王后給了他階梯下一小塊地方居住，每天派兩個僕人給他送飯。誰知其中一個心地很懷，口口聲聲說：“叫化子憑什麼吃那麼好的東西。”於是他把這些食物私自扣了下來，留給自己吃或拿來餵狗，只給這位虛弱憔悴的王子少許水喝。然而另一個僕人心地還算厚道，他把拿到的東西都給王子吃了，數量雖少，但他還能暫時活下來。王子一直極力忍耐著，身體日見虛弱，病情也不斷加劇，最後他要求接受聖禮。彌撒剛做了一半，城裡和附近教堂的鐘就自動敲響了。做完了彌撒，牧師走到階梯下的可憐人面前，發現他已經死了，一手握著玫瑰，一手握著百合，在他身旁還有一張紙，上面寫著他的經歷。當他下葬時，墳墓的一側長出了一株玫瑰，一側長出了一叢百合。",
    "qas": [
      {
        "query_id": "84_0",
        "query_text": "王子給誰寫了一封信?",
        "answers": ["王后"]
      }
    ]
  },
  {
    "context_id": 85,
    "context_text": "天冷極了，下著雪，又快黑了。這是一年的最後一天—大年夜。在這又冷又黑的晚上，一個光著頭赤著腳的小女孩在街上走著。那是一雙很大的拖鞋—那麽大，一向是她媽媽穿的。她穿過馬路的時候，兩輛馬車飛快地沖過來，嚇得她把鞋都跑掉了。一隻怎麽也找不著，另一隻叫一個男孩撿起來拿著跑了。他說，將來他有了孩子可以拿它當搖籃。小女孩只好赤著腳走，一雙小腳凍得紅一塊青一塊的。她的舊圍裙裏兜著許多火柴，手裏還拿著一把。這一整天，誰也沒買過她一根火柴，誰也沒給過她一個錢。可憐的小女孩！她又冷又餓，哆哆嗦嗦地向前走。雪花落在她的金黃的長頭發上，那頭發打成捲兒披在肩上，看上去很美麗，不過她沒注意這些。每個窗子裏都透出燈光來，街上飄著一股烤鵝的香味，因為這是大年夜，她可忘不了這個。她在一座房子的牆角裏坐下來，蜷著腿縮成一團。她覺得更冷了。她不敢回家，因為她沒賣掉一根火柴，沒掙到一個錢，爸爸一定會打她的。再說，家裏跟街上一樣冷。他們頭上只有個房頂，雖然最大的裂縫已經用草和破布堵住了，風還是可以灌進來。她的一雙小手幾乎凍僵了。啊，哪怕一根小小的火柴，對她也是有好處的！她敢從成把的火柴裏抽出一根，在牆上擦燃了，來暖和暖和自己的小手嗎？她終於抽出了一根。哧！火柴燃起來了，冒出火焰來了！她把小手攏在火焰上。多麽溫暖多麽明亮的火焰啊，簡直像一支小小的蠟燭。這是一道奇異的火光！小女孩覺得自己好像坐在一個大火爐前面，火爐裝著閃亮的銅腳和銅把手，燒得旺旺的，暖烘烘的，多麽舒服啊！哎，這是怎麽回事呢？她剛把腳伸出去，想讓腳也暖和一下，火柴滅了，火爐不見了。她坐在那兒，手裏只有一根燒過了的火柴梗。她又擦了一根。火柴燃起來了，發出亮光來了。亮光落在牆上，那兒忽然變得像薄紗那麽透明，她可以一直看到屋裏。桌上鋪著雪白的台佈，擺著精緻的盤子和碗，肚子裏填滿了蘋果和梅子的烤鵝正冒著香氣。更妙的是這只鵝從盤子裏跳下來，背上插著刀和叉，搖搖擺擺地在地板上走著，一直向這個窮苦的小女孩走來。這時候，火柴又滅了，她面前只有一堵又厚又冷的牆。她又擦著了一根火柴。這一回，她坐在美麗的聖誕樹下。這棵聖誕樹，比她去年聖誕節透過富商家的玻璃門看到的還要大，還要美。翠綠的樹枝上點著幾千支明晃晃的蠟燭，許多幅美麗的彩色畫片，跟掛在商店櫥窗裏的一個樣，在向她眨眼睛。小女孩向畫片伸出手去。這時候，火柴又滅了。只見聖誕樹上的燭光越升越高，最後成了在天空中閃爍的星星。有一顆星星落下來了，在天空中劃出了一道細長的紅光。「有一個什麽人快要死了。」小女孩說。唯一疼她的奶奶活著的時候告訴過她∶一顆星星落下來，就有一個靈魂要到上帝那兒去了。她在牆上又擦著了一根火柴。這一回，火柴把周圍全照亮了。奶奶出現在亮光裏，是那麽溫和，那麽慈愛。「奶奶！」小女孩叫起來，「啊！請把我帶走吧！我知道，火柴一滅，您就會不見的，像那暖和的火爐，噴香的烤鵝，美麗的聖誕樹一個樣，就會不見的！」她趕緊擦著了一大把火柴，要把奶奶留住。一大把火柴發出強烈的光，照得跟白天一樣明亮。奶奶從來沒有像現在這樣高大，這樣美麗。奶奶把小女孩抱起來，摟在懷裏。她們倆在光明和快樂中飛走了，越飛越高，飛到那沒有寒冷，沒有饑餓，也沒有痛苦的地方去了。第二天清晨，這個小女孩坐在牆角裏，兩腮通紅，嘴上帶著微笑。她死了，在舊年的大年夜凍死了。新年的太陽升起來了，照在她小小的屍體上。小女孩坐在那兒，手裏還捏著一把燒過了的火柴梗。「她想給自己暖和一下……」人們說。誰也不知道她曾經看到過多麽美麗的東西，她曾經多麽幸福，跟著她奶奶一起走向新年的幸福中去。",
    "qas": [
      {
        "query_id": "85_0",
        "query_text": "誰把小女孩摟在懷裡?",
        "answers": ["奶奶"]
      }
    ]
  },
  {
    "context_id": 86,
    "context_text": "有一天，天氣晴朗，仁慈的上帝想到禦花園裡散散心，於是帶著所有使徒和聖人去了，只留下聖彼得留在天堂看家。上帝臨行前吩咐說在他外出期間不得有人進入天堂，於是聖彼得站在天堂門口守著。可不一會兒就聽到有人敲門，彼得問是誰，要幹什麼？ “我是個可憐的、誠實的裁縫，請求讓我進去。”一個平靜的聲音回答。“好一個誠實的人！ ”彼得說，“就像絞架上的小偷那樣！你一直小偷小摸，還偷了別人的衣服，你進不了天堂。天父說他外出期間嚴禁任何人入內。 ”“行行好吧，”裁縫求道，“揀點桌上掉下來的東西算不上偷，根本不值得一提。你看，我是個跛子，為了走到這兒來，我腳上已經打起泡來了，不可能再走回去。我願意幹最髒最累的活，只求你讓我進來。我會背孩子，給他們洗衣補衣、把他們玩髒的板凳擦乾淨。”彼得被他的話打動了，把天堂的門開了一條窄窄的縫，讓瘦小的瘸腿裁縫溜了進來。彼得要他安安靜靜地坐在門後角落裡，以免上帝回來的時候發現了發脾氣。可彼得一出門，他就充滿好奇地到處走、到處看，把天堂各處都看了個遍。最後他來到一個地方，那裡擺滿了各種珍貴的椅子，其中有一把是純金的，上面鑲滿了寶石，而且比其它椅子高多了，前面還有張腳凳。上帝在家時就是坐在那張椅子上，觀察地上所發生的一切的。裁縫站在那兒，久久盯著那張椅子，根本沒心再看別的東西了。最後他忍不住好奇地爬到那椅子上坐了下來。這一下，他可看到了地上的每件事情了。他看到一個又醜又老的婦人在小溪邊洗東西時將兩條絲巾悄悄抽出來藏到一邊，裁縫一看氣壞了，一把抓起金腳凳朝那老小偷砸了下去。他一看沒法將那凳子拿回來放回原處了，趕忙悄悄從椅子上溜下來，仍舊回到門後角落裡坐著，裝作沒有動過的樣子。天堂的主人上帝回來時沒有發現門後的裁縫。可是當他坐到椅子上時，發現擱腳的凳子不見了。他問彼得凳子哪兒去了，彼得說不知道。上帝又問彼得有沒有人來過。 “沒人到這兒來過，”彼得回答說，“只有一個跛腳裁縫，這會兒還在門後面坐著呢。”上帝叫人把裁縫叫來，問他是不是拿了那張凳子，放到哪兒去了？ “殿下，”裁縫高興地回答說：“我看到一個老婦人在洗衣服的時候偷絲巾。我一氣之下就把凳子砸下去了。”“你這個無賴！”上帝說，“假如我也像你那樣判是非，你還有今天？假如我也像你那樣判是非，這些椅子、凳子甚至連叉子也該早扔沒了。你不能再呆在天堂了，必須立刻出去。想上哪兒上哪兒吧，這裡除了我，誰也沒權治別人的罪。”彼得只好把裁縫帶出天堂。裁縫的鞋子也破了，腳上全是泡，只好柱著拐杖到那些好士兵尋歡作樂的等候處去了。",
    "qas": [
      {
        "query_id": "86_0",
        "query_text": "上帝留下誰在天堂看家?",
        "answers": ["聖彼得"]
      }
    ]
  },
  {
    "context_id": 87,
    "context_text": "有一次，跳蚤、蚱蜢和跳鵝想要知道它們之中誰跳得最高。它們把所有的人和任何願意來的人都請來參觀這個偉大的場面。它們這三位著名的跳高者就在一個房間裡集合起來。「對啦，誰跳得最高，我就把我的女兒嫁給誰！」國王說，「因為，假如讓這些朋友白白地跳一陣子，那就未免太不像話了！」跳蚤第一個出場。它的態度非常可愛：它向四周的人敬禮，因為它身體中流著年輕小姐的血液，習慣于跟人類混在一起，而這一點是非常重要的。接著蚱蜢就出場了，它的確很粗笨，但它的身體很好看。它穿著它那套天生的綠制服。此外，它的整個外表說明它是出身于埃及的一個古老的家庭，因此它在這兒非常受到人們的尊敬。人們把它從田野里弄過來，放在一個用紙牌做的三層樓的房子里——這些紙牌有畫的一面都朝里。這房子有門也有窗，而且它們是從“美人”身中剪出來的。「我唱得非常好」它說，「甚至16個本地產的蟋蟀從小時候開始唱起，到現在還沒有獲得一間紙屋哩。它們聽到我的情形就嫉妒得要命，把身體弄得比以前還要瘦了。」跳蚤和蚱蜢這兩位毫不含糊地說明了它們是怎樣的人物。它們認為它們有資格和一位公主結婚。跳鵝一句話也不說。不過據說它自己更覺得了不起。宮裡的狗兒把它嗅了一下，很有把握地說，跳鵝是來自一個上等的家庭。那位因為從來不講話而獲得了三個勳章的老顧問官說，他知道跳鵝有預見的天才：人們只須看看它的背脊骨就能預知冬天是溫和還是寒冷。這一點人們是沒有辦法從寫曆書的人的背脊骨上看出來的。「好，我什麼也不再講了！」老國王說，「我只須在旁看看，我自己心中有數！」現在它們要跳了。跳蚤跳得非常高，誰也看不見它，因此大家就說它完全沒有跳。這種說法太不講道理。蚱蜢跳得沒有跳蚤一半高。不過它是向國王的臉上跳過來，因此國王就說，這簡直是可惡之至。跳鵝站著沉思了好一會兒；最後大家就認為它完全不能跳。「我希望它沒有生病！」宮裡的狗兒說，然後它又在跳鵝身上嗅了一下。它笨拙地一跳，就跳到公主的膝上去了。她坐在一個矮矮的金凳子上。國王說：「誰跳到我的女兒身上去，誰就要算是跳得最高的了，因為這就是跳高的目的。不過能想到這一點，倒是需要有點頭腦呢，跳鵝已經顯示出它有頭腦。它的腿長到額上去了！」所以它就得到了公主。「不過我跳得最高！」跳蚤說。 「但是這一點用處也沒有！不過盡管她得到一架帶木栓和蠟油的鵝骨，我仍然要算跳得最高。但是在這個世界裡，一個人如果想要使人看見的話，必須有身材才成。」跳蚤於是便投效一個外國兵團。據說它在當兵時犧牲了。那隻蚱蜢坐在田溝裡，把這世界上的事情仔細思索了一番，不禁也說：「身材是需要的！身材是需要的！」於是它便唱起了它自己的哀歌。我們從它的歌中得到了這個故事，這個故事可能不是真的，雖然它已經被印出來了。",
    "qas": [
      {
        "query_id": "87_0",
        "query_text": "跳蚤習慣習慣跟什麼混在一起?",
        "answers": ["人類"]
      }
    ]
  },
  {
    "context_id": 88,
    "context_text": "從前有位遠見卓識、機智聰明的農夫，有關他足智多謀的故事至今人們仍廣為傳頌。其中最精彩的要首推他曾經怎樣捉弄魔鬼的故事。一天，農夫在田間勞動了一整天，天黑時正準備回家，忽然發現自己的田裡有堆煤在燃燒，他驚訝萬分，於是便走上前去看，發現竟有一個黑色的小魔鬼走在燃燒的煤堆上。 “你是坐在財寶上嗎？”農夫問。正是財寶。 ”魔鬼答道，“而且比你一生見到的都要多呢！ ”“財寶在我田裡就得歸我。”農夫說道。魔鬼說，“只要你肯將兩年內一半的收成給我就行了。錢，我有的是，但我更喜歡地上的果實。”農夫答應了這樁交易，並說：“為了避免在我們分配時出現糾紛，凡泥土上的東西歸你，泥土下的歸我。”魔鬼感到心滿意足，但這位聰明的農夫卻種上了蘿卜。現在收穫的季節到了，魔鬼又來了，要求收回屬於他的收成。但除了那些枯黃的敗葉外，他一無所獲；而農夫卻在興高采烈地挖著他的蘿卜。 “這次讓你佔了便宜，”魔鬼說，“下次可不能這樣。地上的歸你，地下的歸我。”“悉聽尊便。”農夫答道。播種的季節又到了，這次他可不播蘿卜，而是種上了小麥。麥子熟了，他來到田間，把麥稈齊根割倒在地。魔鬼又來了，見到除了殘茬外，他又一無所獲，氣得轉身就走，順著石縫鑽了進去。“我就是這樣騙倒魔鬼的。”農夫說完，趕緊拾起財寶回家去了。",
    "qas": [
      {
        "query_id": "88_0",
        "query_text": "農夫發現田裡有堆什麼在燃燒?",
        "answers": ["煤"]
      }
    ]
  },
  {
    "context_id": 89,
    "context_text": "當我們的主還在地上巡視時，有一天晚上，他帶著聖彼得到一個鐵匠家投宿，鐵匠倒還樂意。這時碰巧來了位乞丐，年邁體弱，精神不振，樣子十分可憐，他求鐵匠施捨點東西給他，聖彼得很同情他，說：“主呀，如果你願意，請幫他治一下病吧，讓他能夠自己掙得食物。”“師傅，請把你的鐵爐借我用一下，加些炭在裡面，我要把這老乞丐煉得年輕些。”鐵匠非常樂意，聖彼得便拉起風箱，上帝把乞丐推進爐火中的最旺處，老人在裡面燒得像玫瑰般通紅，口裡還大聲贊美著上帝。過了一會兒，上帝踏到水槽前，把這燒紅的人放了進去浸在水中，等他冷卻後，上帝就向他祝福。過了一會兒，那小個子老人一躍而出，面目一新了，他顯得那樣挺直、健康，就像一位二十歲的小伙子。鐵匠在一旁仔細地瞧著，請他們一起吃了晚飯。鐵匠有位半瞎背駝的老岳母，她走到年輕人的跟前，仔細地瞧著，問他爐火可曾燒了他。那人告訴他從來沒有這般舒服過，立在爐火中，就像沐浴在清涼的露水中一樣。那年青人的話在老婦人的耳邊響了一整夜。第二天早上，上帝準備上路了，他感謝了鐵匠，鐵匠認為他也能把自己的老岳母變得年輕些，因為昨天的一切他都看在眼裡。於是他問岳母是否也想變成個十八歲的少女跳來跳去。她說：“我太想了。”於是鐵匠生起了一爐大火，把老婦人推了進去。她在裡面翻來覆去，叫得十分可怕。“安靜地坐著，你又叫又跳幹什麼？ ”鐵匠對她叫道。說完他又重新拉風箱，把老婦人的破衣服都燒了個精光。老婦人還是叫不絕口，鐵匠便懷疑道：“難到我手藝沒學到家？”於是把她拖了出來，扔進水槽裡。老人又是一陣尖叫，連住在樓上的鐵匠的妻子和老人的媳婦都聽見了，她們一齊跑下樓梯來。只見老婆子在水槽裡捲成一團，號啕大哭，她的臉已起皺，燒得不成樣子了。那兩個人正懷著孩子，由於受了驚嚇，那天晚上就生下了兩個小孩，不像人，而像猴子。後來他們跑進了森林，從此地上就有了猴子。",
    "qas": [
      {
        "query_id": "89_0",
        "query_text": "上帝把誰推進火爐中的最旺處?",
        "answers": ["乞丐"]
      }
    ]
  },
  {
    "context_id": 90,
    "context_text": "在很久很久以前,有一隻非常可愛而且又善良的小白兔住在一個小地洞裡,他每天早上都會到田裡工作而到了晚上都會很早很早的回家。有一天晚上當小白兔正在睡覺時,忽然有一只鞋子從天上掉了下來,咚~的一聲打到正在熟睡的小白兔身上。被打醒的小白兔非常非常的好奇到底是誰的鞋子掉下來打到他呢?隔天早上小白兔就帶這那只鞋去尋找這支鞋的主人。正當小白兔走到公園要休息時,咦~他忽然發現有一只小喵咪愁眉苦臉的一個人坐在地上,善良的小白兔上跑過去慰問他說:“咦~小喵咪啊! 小喵咪啊!你為什麼要不開心呢?”小喵咪很難過的說:“因為,因為人家的三十塊錢一不小心就掉到水溝裡面了啊!這樣一來我就不能買 我中午就沒有東西吃了,怎麼辦?”好心的小白兔對小喵咪說:“那我先借你三十元,等到下次我們又見面時你在還給我好不好?好了不要在不開心了”小喵咪很高興對小白兔說:“真的嗎?謝謝你!”小白兔又問小喵咪說:“那你知道這只鞋子是誰的嗎?”小喵咪搖搖頭表示不知道，失望的小白兔笑著說:“真的喔!嘻~不要緊,那我要走了喔!拜拜”就這樣小白兔又繼續往前尋找這隻鞋的主人。小白兔走在路上時,咦~他忽然發現有一只可憐的小狗狗正蹲在樹的前面,在那嚎啕大哭著,善良的小白兔跑過去問小狗狗說:“怎麼了?為什你會哭得那麼傷心呢?”可憐的小狗狗邊哭邊說:“昨天晚上我正要回家時因為不小心跌倒而鞋子正好這時候飛了出去,因為天色真的太暗,所以我找不到我的鞋子了。”小白兔聽了拿起手中那只鞋問小狗狗說:“我這裡剛好有一只鞋你看看是不是你的？”小狗狗很高興的說:“對,對這正是我昨天掉的那只鞋,真的非常謝謝你！”小白兔聽了對小狗狗說:“不用客氣！下次你要小心一點喔!”。就這樣小白兔終於找到那隻鞋的主人了。",
    "qas": [
      {
        "query_id": "90_0",
        "query_text": "有一只什麼從天上掉下來?",
        "answers": ["鞋子"]
      }
    ]
  },
  {
    "context_id": 91,
    "context_text": "有一隻鴨媽媽在池塘邊孵蛋，不久後，小鴨寶寶都誕生了，但只有一顆好大的蛋沒有孵出來，鴨媽媽心想，這顆蛋可能要多孵幾次才能孵出來，過了沒多久，蛋終於孵化了，結果小鴨們看到自己的弟弟孵出來的模樣七嘴八舌的說:「怎麼那麼醜?」「對呀!怎麼跟我們不一樣?」鴨媽媽叮嚀小鴨們:「無論牠是否跟你們不一樣，都是媽媽的心肝寶貝，不可以欺負牠，知道嗎?」但是小鴨們完全不聽媽媽的，硬要欺負這個和牠們不一樣的弟弟，還給這小鴨取名為醜小鴨，不只這樣，連鴨子親戚們都嫌醜小鴨長的太難看，要鴨媽媽把牠趕走，儘管親戚們怎麼說，鴨媽媽依然疼愛著醜小鴨。醜小鴨不願看到媽媽難過，決定離開池塘，踏上牠的流浪之旅。走著走著，醜小鴨快要餓昏了，牠找到一間屋子，很有禮貌的上前敲門，這時走出一位老婆婆，醜小鴨拜託老婆婆給牠一點食物，老婆婆看醜小鴨很可憐，決定讓牠在這裡住，但到了晚上，老婆婆養的貓和母雞就來刁難醜小鴨說:「你會生蛋還是會抓老鼠?如果什麼都不會，你就不可以在這白吃白喝。」醜小鴨沒有辦法，只好離開老婆婆家繼續流浪，隔天醜小鴨來到一座湖泊，看見一群美麗優雅的天鵝展開翅膀飛行，醜小鴨看到這幕景象羨慕的說:「如果我也可以這麼美麗，那該有多好?」結果，寒冷的冬天來臨，醜小鴨被凍結在結冰的湖上，動彈不得，結果昏倒了，後來被一位樵夫救起，到了樵夫家，醜小鴨看見樵夫的小孩走過來，醜小鴨以為樵夫的小孩想要欺負牠，於是到處亂跑，把樵夫家弄得亂七八糟，樵夫的妻子很生氣，便把牠趕出去，醜小鴨只好在湖邊的洞穴度過寒冬。到了隔天，溫暖的春天來臨，醜小鴨走了出來，這時牠看見之前那幾隻天鵝，天鵝們想要過來找醜小鴨，但這時醜小鴨又以為天鵝們想要欺負牠，拚命要跑走，結果牠看見湖面上自己的身影，原來牠也變成天鵝，原來醜小鴨小時候其實是一隻天鵝寶寶，不是鴨子，醜小鴨非常高興，小時候長的太醜都沒有人願意跟牠做朋友，現在牠終於有朋友了。",
    "qas": [
      {
        "query_id": "91_0",
        "query_text": "醜小鴨其實是一隻什麼?",
        "answers": ["天鵝"]
      }
    ]
  },
  {
    "context_id": 92,
    "context_text": "一個商人在集市上生意紅火，他賣完了所有的貨，錢袋裝得滿滿的。他想天黑前趕到家，便把錢箱捆在了馬背上，騎著馬兒出發了。中午時分，他到了一個鎮上休息了一會。當他想繼續趕路時，馬童牽出馬來對他說：“老爺，馬後腿的蹄鐵上需要加顆釘子。”“由它去吧，”商人回答說，“這塊蹄鐵肯定能撐到走完這六裡路，我要急著趕路呢！”下午時候，他又一次叫人餵馬，馬童走進房間對他說：“老爺，馬後腿上的一塊蹄鐵掉了，要不要我把它帶到鐵匠那去呢？”“由它去吧！”商人回答說，“這馬一定能堅持走完這剩下的幾里路，我時間緊著呢！”他騎著馬兒繼續往前走，但不久以後馬就開始一步一瘸的了，再過會兒就開始踉踉蹌蹌，最後它終於跌倒在地，折斷了腿。那生意人只好扔下他的馬，解下錢箱扛在背上，步行回家。等趕回家時已是午夜時分，只聽他嘀咕著：“都是那顆該死的釘子把我給害慘了。”",
    "qas": [
      {
        "query_id": "92_0",
        "query_text": "誰說馬後腿上的一塊蹄鐵掉了?",
        "answers": ["馬童"]
      }
    ]
  },
  {
    "context_id": 93,
    "context_text": "土地像藍天一樣大，他的牛羊能蓋滿三座山崗，他的房屋象彩畫一樣華麗，他的錢財自己也數不清。可是，他從早到晚都在盤算，怎樣叫別人破產，自己更加發財，弄得白天吃不下飯，晚上睡不好覺，瘦得像個老猴子。他的隔壁，是個小水磨，住著一個看守水磨杓的姑娘。這個姑娘日子困難極了，每天早晨只不過一杓糌粑面，中午也只有一糌粑面，晚上呢，只能喝一碗糌粑糊糊湯。身上穿的，與其說是衣服，不如說是一塊遮羞的破布。但她每天從早到晚，都在不停地唱歌。有時唱些快樂的歌，有時唱些憂鬱的歌，有時還手舞足蹈，輕輕起舞。財主看了，覺得很奇怪。他想：“天呀！這個姑娘吃沒吃的，穿沒穿的，為甚麼不管白天黑夜、春夏秋冬，總是跟布穀鳥一樣，不停地歌唱呢？而我，錢財堆聚成小山一樣，幾輩子都用不完，卻時刻愁眉苦臉，憂心忡忡呢？難道金錢和唱歌還有甚麼關係嗎？”有一天，他看見姑娘出去搬青稞，便輕手輕腳步地溜進水磨，從懷裏摸出一錠馬蹄銀，放在磨盤上。不久，姑娘背著青稞進來，看見這麼大的一塊銀子，心裏又高興、又害怕，瞧瞧四周沒有人，趕緊把它藏在自己的懷裏。從這時起，姑娘整天心思恍惚，坐立不安，再也聽不到她不知疲倦的歌唱了。財主看到這個情形，嘆了一口氣說：“哎，銀子和歌聲，看樣子脾氣不一樣！”",
    "qas": [
      {
        "query_id": "93_0",
        "query_text": "姑娘背著什麼近來?",
        "answers": ["青稞"]
      }
    ]
  },
  {
    "context_id": 94,
    "context_text": "烏黑的天空層雲密布，不時閃出驚人電光，在如鹿角分叉的閃電末端，總是附帶了一小截閃光，稍縱即逝，那就是小閃電雲米可，由於他年紀還小，每次閃出的電力老是不足，於是常常被其他大閃電雲同伴嘲笑他是「跟屁蟲」，米可賭氣地降落山頭。山頭旁有位小孩子正在捉蜻蜓，忽然看到前面不遠處竟然有一朵雲，悄悄靠近，一把捉住了米可！米可奮力抵抗，但微弱的閃光比螢光蟲還小，只能認命了！此時有一位年輕人正巧路過，看到可憐的米可垂落一滴滴淚水，並發出哀鳴，於是開口向小孩子買。小孩子正訝異這朵雲怎麼漸漸變小，而且好像在哭泣，正嚇得不知所措，於是就便宜地賣給了年輕人。年輕人將米可帶回家，心想它既是一朵雲，就需要水氣，於是燒了一大鍋熱水，用蒸氣薰米可，米可才悠悠轉醒，慢慢恢復元氣。「謝謝你救了我！」雖然年輕人聽不到米可的感謝聲，米可依然用力搖了搖身體，並放出微弱的閃光，年輕人意會，笑容滿面地選了個陰天，將米可重新帶回山頂，將它放了出去，米可又重回久違的天空懷抱。事隔多年，在一次暴風雪中，有一位商人正要趕路回家，由於沿途都是崎嶇山路，那位商人竟然不繞道而行，直接想穿過危險山頭。米可一下子認出就是那位救命恩人，眼看太陽漸漸下山，山裡一片灰暗，商人走在熟悉的森林裡雖然不害怕，卻朝一處因為雪崩剛剛塌陷的懸崖走過去！米可知道事情急迫，奮力閃出身上亮光，雖然事隔多年已有進步，但卻只有手電筒大小，在陰暗的山谷裡恍如流光閃爍！米可冷靜下來，心想現在只有自己能救他了，於是深呼吸，將附近的烏雲吸附過來，自己也膨脹成一顆大氣球，再用盡全身力氣發出此生最明亮的一閃，一道閃電劃破天際直瀉而下，正巧命中一棵枯樹，枯樹瞬間起火燃燒，也將商人前進的路截斷了！商人猛然一驚，停下快捷的步伐，這才發現，前方不遠處正是一大片新懸崖！商人抬頭望向天空，仍有一道道亮光閃現，彷彿在幫他照路一般，於是順著亮光，走在不熟悉的山路上，最後平安走出深山，回到平地。此時天空烏雲略散，微亮的星空下仍閃著電光，商人向它揮揮手，閃電似乎明白了，回以數道足以照亮幽暗夜空的明晰亮光。",
    "qas": [
      {
        "query_id": "94_0",
        "query_text": "米可被其他同伴嘲笑他是什麼?",
        "answers": ["跟屁蟲"]
      }
    ]
  },
  {
    "context_id": 95,
    "context_text": "在一處能登高望遠的小土丘上，出現了一個孤獨的身影，彷彿一尊不動的雕像，把美麗的夕陽餘輝，遺忘在眼眸深處。過了許久，雕像似的田鼠阿力突然一震，牠下定決心，一定要澈底改變自己這種老是缺乏自信的個性。隔天一大清早，阿力來到土撥鼠家，牠知道土撥鼠是鼠輩裡最會挖洞的高手。「我可不可以拜你為師，請你教我挖洞的技巧？」阿力一臉誠懇的樣子，打動了土撥鼠阿強的心。「首先要把爪子磨利、磨亮，再……」阿強伸出牠又長又有力的爪子，在陽光下閃閃發光，好像二根又黑又亮的炭條；而阿力又細又小的爪子，簡直像剛從土裡冒出頭的嫩芽。「嘿咻……嘿咻……」阿強沒三兩下就挖出一條又寬又大的地道；而阿力忙了老半天，只在地面留下一個小洞而已。阿強叫阿力自己多練習，一下子又從新挖的地道消失了！阿力從早上挖到中午，又從中午挖到黃昏，星星都好奇的探出頭來，牠終於完成一個可以容牠躲入的小地道，牠高興地大叫：「雖然我無法挖得像土撥鼠師父那麼好，但是我終於學會挖洞的技巧了！」第二天清晨，阿力又開心的跑去找飛鼠阿明，牠是鼠輩裡最會飛的高手。「我可不可以拜你為師，請你教我飛翔的技巧？」看著阿力誠懇的模樣，飛鼠阿明也爽快答應了。「首先要找到一棵高大的樹爬上去，然後……」阿明三兩下子就爬到離地面足足有10公尺高的樹幹上，眼睛瞧著前方，露出滿意的表情；而爬了老半天才上樹的阿力，喘得像牛一樣，簡直說不出話來，正勉強開口詢問飛翔技巧，阿明已經縱身一跳，大喊：「然後張開雙手保持平衡，瞄準目標，勇敢跳下去……呀～呼～」阿力從高處往下俯瞰，這是牠這輩子爬過最高的樹，雙腿發軟，哪裡還敢想像一躍而下的「勇氣」！遠處傳來阿明的催促聲，阿力牙一咬，眼一閉，張開雙臂，俯身跳了下去：「唉呀……救命啊！」還好落地前被一叢葉子承接住，這也是阿明預先設想好的，萬一失手也不會有生命危險。阿力心有餘悸，但是聽到阿明師父的稱讚話，開心的自言自語：「雖然我無法飛得像飛鼠師父那麼好，但是我終於學會飛翔的基本技巧了！」經過一夜的休息，阿力再度精神百倍，準備繼續牠的學習之旅。「救命啊！……誰來救救我？」阿力隱約聽到樹林裡的救命聲，小心翼翼靠過去，發現一棟小木屋，周圍有高牆擋住，牆內有一棵高大的芒果樹，樹上有隻狐狸被網子緊緊纏住，顯然中了人類的陷阱。阿力認出是隔壁村子的阿發，二話不說，想前去救援。首先要通過高牆，阿力立刻用阿強教牠的挖洞技巧，輕易穿過了那堵高牆；接下來爬到樹上，但繩子吊在一個牠搆不著的地方，於是阿力牙一咬，運用阿明教牠的飛翔方法，張開雙臂，對準目標，縱身一跳，正好落在網子上；再以天生的利牙，在獵人回來前救了阿發一命「謝謝你阿力，你好厲害喔！」四周突然響起一片掌聲，不知道什麼時候開始，現場已經圍滿了各種動物，大家開心的合力將阿力抬起來往上拋，熾熱的光芒灑在臉上，不知道是燙紅還是害羞，阿力紅著臉告訴大家，只要努力，一定會找到自己的優點喔！",
    "qas": [
      {
        "query_id": "95_0",
        "query_text": "誰是鼠輩裡最會飛的高手?",
        "answers": ["阿明"]
      }
    ]
  },
  {
    "context_id": 96,
    "context_text": "有一處幽靜的山谷，林木蒼翠，景色宜人，這裡住著一群與世無爭的灰熊。其中有一隻灰熊長得特別壯碩，而且力大無窮，名叫阿力，只是個性孤僻，除了溫柔的小母熊小蘭以外，沒有其他灰熊願意當牠的朋友。有一天有一群小熊在樹下玩耍，阿力正巧路過，突然對這群小熊大吼一聲，聲音幾乎掀掉整座山谷，小熊們嚇得四處逃竄，從此只要阿力經過的地方，再也沒有熊敢靠近牠！儘管事後也在現場的小蘭努力向大家解釋，說阿力那一聲巨吼是要趕走正在接近小熊的宿敵「豹」！但阿力的義舉並未得到掌聲，反而讓大家避之唯恐不及。在一次嚴重的暴風雪裡，千年的古木突然倒塌，正巧壓住母熊的洞口，小熊們被困在洞裡，母熊在洞外焦急地咆哮，大伙兒見狀都來幫忙，但古木實在太過巨大，眼看小熊們就要餓死在洞內。這時由遠方傳來巨大的聲響，接著一聲熟悉的大吼，大家紛紛走避，母熊本能地守主洞口，卻全身顫抖。只見阿力以最快的速度奔馳而來，好像一座會移動的大山，隨著身後小蘭的出現，大家才鬆了口氣，原來是小蘭找來阿力幫忙。阿力奮不顧身與巨木搏鬥，全身擦出一處處傷痕，卻還惦記洞內挨餓的小熊，好幾次龐大的身軀在雪地上重重摔跤，但阿力總是掙扎爬起來，彷彿把洞內小熊當做自己的小孩一般，盡全力搶救。好不容易將巨木移動半分，正好夠小熊的迷你身軀穿過，母子重逢的溫馨畫面讓大家陪著流眼淚，渾身是傷的阿力則在眾人的感激聲中，依然面帶招牌傻笑，大家這才發現，阿力一點也不兇，還有一顆善良的心，只是不擅於表達自己的感情罷了。從此以後，小熊們整天圍著阿力玩，有的跳到牠的背，有的爬上牠的肩膀，阿力也樂在其中，好像一家人似的。這時山谷裡偶爾會傳來一聲大吼，接著有幾聲小吼呼應，聲震山岡，嚇得附近的肉食動物們紛紛走避，相互告誡，說這裡一定住了一群強悍的動物，會發出雷一般的叫聲，實在招惹不起，於是這處山谷便有了外號，叫「雷公谷」。",
    "qas": [
      { "query_id": "96_0", "query_text": "小熊的宿敵是誰?", "answers": ["豹"] }
    ]
  },
  {
    "context_id": 97,
    "context_text": "在遙遠的古代，人們心中的美好願望往往能夠變成現實。就在那個令人神往的時代，曾經有過一位國王。國王有好幾個女兒，個個都長得非常美麗；尤其是他的小女兒，更是美如天仙，就連見多識廣的太陽，每次照在她臉上時，都對她的美麗感到驚詫不已。國王的宮殿附近，有一片幽暗的大森林。在這片森林中的一棵老椴樹下，有一個水潭，水潭很深。在天熱的時候，小公主常常來到這片森林，坐在清涼的水潭邊上。她坐在那裡感到無聊的時候，就取出一隻金球，把金球拋向空中，然後再用手接住。這成了她最喜愛的遊戲。不巧的是，有一次，小公主伸出兩隻小手去接金球，金球卻沒有落進她的手裡，而是掉到了地上，而且一下子就滾到了水潭裡。小公主兩眼緊緊地盯著金球，可是金球忽地一下子在水潭裡就沒影兒了。因為水潭裡的水很深，看不見底，小公主就哭了起來，她的哭聲越來越大，哭得傷心極了。哭著哭著，小公主突然聽見有人大聲說：“哎呀，公主，您這是怎麼啦？您這樣嚎啕大哭，就連石頭聽了都會心疼的呀。”聽了這話，小公主四處張望，想弄清楚說話聲是從哪兒傳來的，不料卻發現一隻青蛙，從水裡伸出他那醜陋不堪的肥嘟嘟的大腦袋。“啊！原來是你呀，游泳健將，”小公主對青蛙說道，“我在這兒哭，是因為我的金球掉進水潭裡去了。”“好啦，不要難過，別哭了，”青蛙回答說，“我有辦法幫助您。要是我幫您把您的金球撈出來，您拿什麼東西來回報我呢？ ”“親愛的青蛙，你要什麼東西都成呵，”小公主回答說，“我的衣服、我的珍珠和寶石、甚至我頭上戴著的這頂金冠，都可以給你。 ”聽了這話，青蛙對小公主說：“您的衣服、您的珍珠、您的寶石，還有您的金冠，我哪樣都不想要。不過，要是您喜歡我，讓我做您的好朋友，我們一起遊戲，吃飯的時候讓我和您同坐一張餐桌，用您的小金碟子吃東西，用您的小高腳杯飲酒，晚上還讓我睡在您的小床上；要是您答應所有這一切的話，我就潛到水潭裡去，把您的金球撈出來。”“好的，太好了，”小公主說，“只要你願意把我的金球撈出來，你的一切要求我都答應。”小公主雖然嘴上這麼說，心裡卻想：“這只青蛙可真夠傻的，盡胡說八道！他只配蹲在水潭裡，和其他青蛙一起呱呱叫，怎麼可能做人的好朋友呢？”青蛙得到了小公主的許諾之後，把腦袋往水裡一扎，就潛入了水潭。過了不大一會兒，青蛙嘴裡銜著金球，浮出了水面，然後把金球吐在草地上。小公主重又見到了自己心愛的玩具，心裡別提有多高興了。她把金球揀了起來，撒腿就跑。別跑！別跑！ ”青蛙大聲叫道，“帶上我呀！我可跑不了您那麼快。 ”儘管青蛙扯著嗓子拚命叫喊，可是沒有一點兒用。小公主對青蛙的喊叫根本不予理睬，而是徑直跑回了家，並且很快就把可憐的青蛙忘記得一乾二淨。青蛙只好蹦蹦跳跳地又回到水潭裡去。第二天，小公主跟國王和大臣們剛剛坐上餐桌，才開始用她的小金碟進餐，突然聽見啪啦啪啦的聲音。隨著聲響，有個什麼東西順著大理石台階往上跳，到了門口時，便一邊敲門一邊大聲嚷嚷：“小公主，快開門！”聽到喊聲，小公主急忙跑到門口，想看看是誰在門外喊叫。打開門一看，原來是那隻青蛙，正蹲在門前。小公主見是青蛙，猛然把門關上，轉身趕緊回到座位，心裡害怕極了。國王發現小公主一副心慌意亂的樣子，就問她： “孩子，你怎麼會嚇成這個樣子？該不是門外有個巨人要把你抓走吧？”“啊，不是的，”小公主回答說，“不是什麼巨人，而是一只討厭的青蛙。”“青蛙想找你做什麼呢？”“唉！我的好爸爸，昨天，我到森林裡去了。坐在水潭邊上玩的時候，金球掉到水潭裡去了，於是我就哭了。我哭得很傷心，青蛙就替我把金球撈了上來。因為青蛙請求我做他的朋友，我就答應了，可是我壓根兒沒有想到，他會從水潭裡爬出來，爬這麼遠的路到這兒來。現在他就在門外呢，想要上咱這兒來。”正說著話的當兒，又聽見了敲門聲，接著是大聲的喊叫： “小公主啊我的愛，快點兒把門打開！愛你的人已到來，快點兒把門打開！你不會忘記昨天，老椴樹下水潭邊，潭水深深球不見，是你親口許諾言。”國王聽了之後對小公主說，“你決不能言而無信，快去開門讓他進來。”小公主走過去把門打開，青蛙蹦蹦跳跳地進了門，然後跟著小公主來到座位前，接著大聲叫道，“把我抱到你身旁呀！”小公主聽了嚇得發抖，國王卻吩咐她照青蛙說的去做。青蛙被放在了椅子上，可心裡不太高興，想到桌子上去。上了桌子之後又說，“把您的小金碟子推過來一點兒好嗎？這樣我們就可以一快兒吃啦。”很顯然，小公主很不情願這麼做，可她還是把金碟子推了過去。青蛙吃得津津有味，可小公主卻一點兒胃口都沒有。終於，青蛙開口說，“我已經吃飽了。現在我有點累了，請把我抱到您的小臥室去，舖好您的緞子被蓋，然後我們就寢吧。”小公主害怕這只冷冰冰的青蛙，連碰都不敢碰一下。一聽他要在自己整潔漂亮的小床上睡覺，就哭了起來。國王見小公主這個樣子，就生氣地對她說，“在我們困難的時候幫助過我們的人，不論他是誰，過後都不應當受到鄙視。”於是，小公主用兩隻纖秀的手指把青蛙挾起來，帶著他上了樓，把他放在臥室的一個角落裡。可是她剛剛在床上躺下，青蛙就爬到床邊對她說，“我累了，我也想在床上睡覺。請把我抱上來，要不然我就告訴您父親。” 一聽這話，小公主勃然大怒，一把抓起青蛙，朝牆上死勁兒摔去“現在你想睡就去睡吧，你這個醜陋的討厭鬼！ ”誰知他一落地，已不再是什麼青蛙，卻一下子變成了一位王子：一位兩眼炯炯有神、滿面笑容的王子。直到這時候，王子才告訴小公主，原來他被一個狠毒的巫婆施了魔法，除了小公主以外，誰也不能把他從水潭裡解救出來。於是，遵照國王的旨意，他成為小公主親密的朋友和伴侶，明天，他們將一道返回他的王國。第二天早上，太陽爬上山的時候，一輛八匹馬拉的大馬車已停在了門前，馬頭上都插著潔白的羽毛，一晃一晃的，馬身上套著金光閃閃的馬具。車後邊站著王子的僕人——忠心耿耿的亨利。亨利的主人被變成一隻青蛙之後，他悲痛欲絕，於是他在自己的胸口套上了三個鐵箍，免得他的心因為悲傷而破碎了。馬車來接年輕的王子回他的王國去。忠心耿耿的亨利扶著他的主人和王妃上了車廂，然後自己又站到了車後邊去。他們上路後剛走了不遠，突然聽見辟辟啦啦的響聲，好像有什麼東西斷裂了。路上，辟辟啦啦聲響了一次又一次，每次王子和王妃聽見響聲，都以為是車上的什麼東西壞了。其實不然，忠心耿耿的亨利見主人是那麼地幸福，因而感到欣喜若狂，於是那幾個鐵箍就從他的胸口上一個接一個地崩掉了。",
    "qas": [
      {
        "query_id": "97_0",
        "query_text": "青蛙變成了什麼?",
        "answers": ["王子"]
      }
    ]
  },
  {
    "context_id": 98,
    "context_text": "山坡上有一座風磨，看去很不可一世，他自己也覺得很了不起「我一點兒也不驕傲！」他說道，「不過我很亮，很知書達理，外表內心都如此。太陽和月亮我可以外用，也可以內用。而且除此之外，我還有混合油燭、魚油燈和油脂燭。我敢說我心明眼亮；我是會思考的生靈，體形勻稱，令人高興。懷裡揣著一塊很好的磨石。我有四個翅膀，它們長在我的頭上，就在帽子下面。鳥兒只有兩只翅膀，還需把它們背在背上。我生來是荷蘭人，從我的體態就可以看出：一個漂泊的荷蘭人！它被認為是超自然的，我知道，可是我卻很自然。我腰上有走廊，最底下一層有居室，我的思想便裝在那裡。我的最強大的、佔統治地位的思想，被別的思想稱之為：磨坊工。他知道他要幹什麼，他高高地站在麥粉麥麩之上。不過他也有自己的伴兒，人家把她叫做阿媽，她是我的心。她從來不倒著跑，她也知道自己要幹什麼，她知道己能做些什麼。她溫和得像一絲微風，強壯得像一陣狂風。她懂得怎麼待人接物，以實現自己的願望。她是我的溫柔的思想，老爹是我的強硬的思想；他們是兩個同時又是一個，他們以我的另一半相互稱呼對方。他們兩個還有小子：都是會長大的小思想。小子們盡胡鬧。不久以前，我曾經認真地讓老爹和他的徒弟檢查一下我懷裡的磨石和輪子，我很想知道它們出了什麼毛病。因為我的內部有了點毛病，誰都應該檢查檢查自己。這時，小子們胡鬧了起來，樣子非常可怕，對像我這樣一位高高立在坡上的人來說，這很不成樣子：你應該記住你是站在眾目睽睽的地方。名聲這東西是別人對你的看法。可是，我要說什麼呢，小子們一陣可怕的胡鬧！最小的一個一直爬到了我的帽子裡喊叫，弄得我怪癢癢的。小思想會長大，這我是知道的。外面也有思想跑，它們不完全是我這一族的，因為我誰也沒有看到，除了我自己之外。那些沒有傳出磨盤轉動聲音、沒有翅膀的屋子，它們也有思想。它們跑到了我的思想裡來，和我的思想訂了婚，就像通常說的那樣。這太奇怪了！是啊，真是非常奇怪。我身上，或者說我的身體裡起了某種變化：磨的結構似乎變了！就好像老爹換了另一半了，找到了一個性情更加溫和，更可愛的伴兒，很年輕，很虔誠，不過還是原來的，是時間使得她變得更柔和更虔誠。叫人不痛快的事兒現在沒有了，一切都使人十分舒服。日子一天天過去，新的日子又到來了，總是更加光明更加舒心。可是，是啊，千真萬確，有一天我完了，完全結束了：我要被拆除掉，給我建立一個新的更好的磨坊。我結束了可是又繼續存在著！完全成了另外一個，可又是同一個！要我明白實在困難，不管太陽、月亮、混合油燭、魚油燭和油脂燭把我照得多麼心明眼亮！我原來的木材和磚塊要重新從地上豎立起來。我真希望我能保留住我的老思想：磨坊的老爹、阿媽、大大小小，全家，我叫他們全體，一體，卻又那麼多，一整個的思想連隊，因為我不能沒有他們！我自己也要存下來，保存懷裡的磨盤，頭上的翅膀，肚皮上的走廊。否則我自己就會認不出自己來了，別人也就會認不出我來。他們再不會說，要知道山坡上有磨坊，看去很不可一世，可一點兒也不驕傲。 」磨坊講了這麼一大堆，它講的比這還要多，但是這些是至關重要的。日子來了又去了，昨天是它的末日。磨坊起火了。火焰竄得老高老高的，竄出竄進，把木樑木板都舔光、吞掉。磨坊塌了，只剩下了一堆灰。起火的地方冒著煙，風把煙吹走了。磨坊里活的東西都還在，這事故沒有損傷他們，倒是因禍得福。磨坊一家，一個魂靈，許多「思想」，但仍然只是一個思想，又得到了一個新的、更加美好的磨坊，可以提供服務，它和舊的完全一樣。大夥兒說：要知道山坡上有風磨，看去很不可一世！不過這座新磨坊裡面設備更好，更符合時代的要求，因為它前進了。那些舊木料都是被蟲蛀過的，都是腐朽了的，現在已經化為灰燼了；磨坊軀體不像他想的那樣重新立起。他太摳字眼了，不應該從字眼上看待事物。",
    "qas": [
      {
        "query_id": "98_0",
        "query_text": "山坡上有一座什麼?",
        "answers": ["風磨"]
      }
    ]
  },
  {
    "context_id": 99,
    "context_text": "遠古時代，當上帝親自巡視大地時，土地的產量比現在高得多。那時，麥穗不只結五六十粒，而是四五百粒，麥稈從頭到腳長滿了麥粒，稈有多長，穗就有多長。然而人類是如此的淺俗，他們生活豐裕時，就不再珍惜上蒼的恩賜，以致變得漫不經心、大手大腳。一天，一位婦女路經一片麥地，她的小孩在她身邊跑著，一下跌進了泥坑裡，弄髒了小衣服。於是，這位母親扯下一把漂亮的麥穗，用它擦淨了衣服。碰巧上帝從這兒經過，見到這情形他非常生氣，說：“從此麥稈不再結穗，人類不配再獲得上蒼的賜予。”周圍的人聽到這話嚇壞了，紛紛跪下，祈求上帝仍留些麥穗於稈上，即使人類不配這一恩賜，但是為了那些無辜的家禽，求上帝開恩，否則它們就會餓死。上帝預見到人類的苦難，可憐他們，答應了這一請求。於是麥穗留了下來，就像現在生長的這樣子。",
    "qas": [
      {
        "query_id": "99_0",
        "query_text": "母親扯下一把什麼擦淨衣服?",
        "answers": ["麥穗"]
      }
    ]
  },
  {
    "context_id": 100,
    "context_text": "一座村子裡住著一位貧窮的老太太，她摘了一盤豆子，準備煮熟了吃。她在爐子裡點上火，為了讓爐子燒得快一點，她生爐子的時候用了一把麥草。當把豆子倒進鍋裡時，她沒有註意到一粒豆子掉了出來，落在地上的一根麥草旁。不一會兒，一塊燃燒的煤炭也從爐子中跳了出來，落在它倆的旁邊。於是，麥草開口說：“親愛的朋友們，你們從哪裡來呀？”煤塊答道：“我總算幸運地從火裡跳出來了。要是我沒有使勁跳出來，我必死無疑，一定會被燒成灰燼。”豆子說：“我也成功地逃了出來，可要是那老太太把我倒進了鍋子，我肯定會像我的伙伴們一樣，被她毫不留情地煮成濃湯。”難道我不是不幸中之萬幸嗎？ ”麥草問，“那個老太太把我所有的兄弟塞進爐火裡，變成了輕煙。她一把就抓住了六十根，要了它們的命。幸好我從她的指縫裡溜掉了。 ”“可我們現在怎麼辦呢？”煤塊問。“我覺得，”豆子回答，“既然我們都幸運地死裡逃生，我們就應該像好夥伴一樣團結在一起。為了避免在這地方再遭到厄運，我們應該離開這裡，到別的地方去。 ”另外兩位都覺得這是一個好主意，於是它們便結伴而行。沒過多久，它們來到了一條小溪邊，小溪上既沒有橋，也沒有跳磴，它們不知道該怎麼過去。麥草靈機一動，說：“讓我橫躺在小溪上，你們可以像過橋一樣從我身上走過去。”麥草說著便把自己的身子從小溪的這一邊伸到了另一邊。煤塊性子比較急，立刻大著膽子走上了這座剛剛搭好的橋。可是它走到橋中間時，聽到溪水在腳下嘩嘩地流淌，不由得害怕起來，站在那裡不敢往前走。這下麥草燃了起來，斷成兩截掉進了小溪。煤塊跟著掉了下去，碰到水發出絲的一聲，就送命。豆子一直謹慎地呆在岸上，看到這情景不由得放聲哈哈大笑。它笑呀笑，笑得裂開了自己的肚皮。它本來也許就這樣完蛋了，但幸運的是，一個外出找活干的裁縫正好坐在小溪旁休息。這位裁縫心腸很好，取出針線把它的肚子縫在了一起。豆子好好地謝了裁縫，可由於裁縫用的是黑線，所以豆子的身上至今還留有一條黑縫。",
    "qas": [
      {
        "query_id": "100_0",
        "query_text": "誰性子比較急?",
        "answers": ["煤塊"]
      }
    ]
  }
]
